[
{"productYear": "2015", "title": "MB&F LM101 Frost Yellow Gold", "productPrice": null, "productDescription": ["Maximillian Busser and Friends, or as we more familiarly know it, MB&F, is one of the most well known and avant-garde independent watch brands on the scene today. Known famously by its ethos of collaborating and acknowledging other master watchmakers in the industry, it is helmed by Max Busser who together has created some of the most radical and out-there watch designs. ", "The LM101, as denoted, is part of the Legacy Machine series and is the most wearable MB&F by a long margin. Sized at 40mm, it is sized more conservatively than the other 44mm LM’s and for me, sits the best on the wrist. While the LM101 is considered the entry-level MB&F, it is my favorite because of its balance between being simple yet looking crazy at the same time.", "This particular example is the LM101 ‘Frost’ and was a limited edition produced by the brand in 2015. They made 18 examples of these in yellow gold, making it incredibly rare and a true ‘limited’ edition. As the name denotes, the technique of frosting takes center stage. Developed by Abraham-Louis Breguet in the late 18th and 19th centuries, it is a method that was widely used as a finishing technique for pocket watches. While today most watches are finished with your typical Geneva stripes, it is very nice to see an alternative on wristwatches. ", "The dial of this LM101 is beautifully hand-frosted and the way it shimmers and reflects light is really amazing. The dial can look very dark in certain lighting and complete explode with flecks of yellow speckles when the sun shines down. Of course, while its all about the frosting technique, we cannot forget the MB&F signature that made it so famous in the first place- the huge 14mm floating balance on the front of the watch. With a v-shaped 3D bridge suspending the balance on top of the dial, this is anything but a ‘classical’ watch and I guarantee you will find yourself staring at this watch all day long. A power reserve land time indication lacquered sub dial floats above the frosted dial as well and finishes off the 3D masterpiece.", "Flip the watch over and you will see that MB&F didn’t stop at the dial. The entire movement is frosted and in yellow gold as well. The overall aesthetic design of the movement is so beautiful, with huge spaces between the bridges and large blued screws contrasting with the frosted gold. Interestingly, the LM101 movement is the first entirely developed and assembled in-house movement from the brand, with help of course form a long time friend of the house, Kari Voutilainen.", "With only 18 pieces produced of this MB&F LM101 ‘Frost’ in yellow gold, this is a truly rare and special watch that you will not see very often."], "productCr": "This MB&F LM101 Frost is in mint condition. It is in full working order and comes as a full set.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0122_Layer-29.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0002_Layer-87.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0028_Layer-18.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0027_Layer-19.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0018_Layer-23.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0023_Layer-27.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0025_Layer-21.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0003_Layer-86.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0001_Layer-88.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0004_Layer-85.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0005_Layer-84.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0006_Layer-83.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0008_Layer-81.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0007_Layer-82.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0019_Layer-28.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0021_Layer-24.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0020_Layer-25.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0022_Layer-26.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0026_Layer-20.png?v=1587118238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/MB_F-LM101-Frost-Yellow-Gold_0024_Layer-22.png?v=1587118238"]},
{"productYear": "2019", "title": "A. Lange & Sohne Datograph Perpetual Grey", "productPrice": null, "productDescription": ["When thinking of the real heavyweights in Haute Horlogerie, only a few big names come to mind- Patek Philippe, Vacheron Constantin, Audemars Piguet, and of course, the Germans next door, A. Lange & Sohne. While many see Swiss watches as the pinnacle of watchmaking, Lange serves as a reminder that this isn’t the case. In fact, one can say that in some areas, Lange is considered much better than its Swiss counterparts. ", "Everything said in the introduction predominantly revolves around one aspect of watchmaking- the chronograph. A. Lange & Sohne today is seen as the undisputed king of chronographs and there is a good reason why- the in-house Datograph. ", "First introduced in 1999, it sent shockwaves through the watch industry as creating an in-house chronograph was no easy feat, let alone for some young German brand. Remember, this was a time when houses like Patek Philippe and Vacheron Constantin were still using Lemania movements for their chronographs, and Lange wasn’t even a decade old. ", "The Datograph was a very traditional, super high-end, manually wound chronograph made in Germany and not only was it a technical marvel, but it was finished to the highest standards and looked beautiful too. Imagine how the Swiss felt when this happened! Architecturally, the Datograph movement had an amazing three-dimensional look to it, with an intricately engraved balance cock and bridges and plates made out of German silver. The finishing was the best in the industry and there was just this warm glow to the movement from the German Silver that Swiss movements just didn’t have.", "It wasn’t until 2010 that Patek caught up and released their own in-house manually wound chronograph and it took another 5 years after that for Vacheron to catch up.", "Since then, there have been variations of Lange’s chronograph movement and this is one of them. The Datograph Perpetual was first released in 2006 and was a natural progression after the standard Datograph. The perpetual calendar chronograph has always been seen as a flagship complication for any brand and it was imperative that Lange did so too. ", "With a 41mm 18k white gold case, the comparisons to the Patek Philippe 5270 was always inevitable and largely seen as a big rivalry between two of the biggest watch manufactures. With it’s iconic jumping big date at 12 o’clock though, it is unmistakably a Lange. ", "It goes without saying that the L952.1 caliber is a sight to behold and even people who don’t know about watches can tell just how good it is. Just like every perpetual calendar chronograph watch, this Datograph Perpetual uses a calendar module fitted atop the chronograph watch to complete the complication. The movement is incredibly hand finished with thick bevelling and deep Glashütte ribbing on every surface. ", "The Datograph Perpetual has always been very conservative in its design, being made only with a white dial in either a white gold or rose gold case but in 2018 they released this example- fitted with a beautiful grey dial. The grey is quite enigmatic and ethereal in its nature as it varies in tone depending on the light source. While blue dials are all the rage these days I was very happy to see Lange buck the trend with this fantastic grey dial. ", "Despite the huge rivalry between the other Swiss brands, there is no doubt that A. Lange & Sohne is at the top of its game, with this Datograph Perpetual as one of its flagships. Even the legend Philippe Dufour himself owns a Datograph and routinely cites Lange as the best in terms of movement finishing in mainstream watchmaking. "], "productCr": "This A. Lange & Sohne Datograph Perpetual is in mint condition. It has only been worn a few times and comes as a full set with all of its original paperwork and boxes. It is in full working condition and still under ALS’s warranty.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0018_Layer-122.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0006_Layer-90.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0002_Layer-102.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0011_Layer-119.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0005_Layer-95.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0010_Layer-120.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0001_Layer-161.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0003_Layer-101.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey-_0008_Layer-98.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0014_Layer-116.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0007_Layer-89.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0004_Layer-97.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0015_Layer-115.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0016_Layer-114.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0001_Layer-105.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0013_Layer-117.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0012_Layer-118.png?v=1601870692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-Perpetual-Grey_0009_Layer-121.png?v=1601870692"]},
{"productYear": "2002", "title": "Audemars Piguet Royal Oak 25820ST Smooth Grey", "productPrice": null, "productDescription": ["The Royal Oak, with its masculine octagonal case, exposed screws, and integrated bracelet is one of the most distinctive watches in the market today. It is imposing and recognizable, and in my opinion, one of the best statement watches money can buy. ", "The Royal Oak is not only famous for what it looks like, but also how it was introduced. First released in the ’70s, the original Ref. 5402 was a bold stainless steel watch designed by Gerald Genta that created shockwaves. It was designed as a luxury sports watch and the scandalous part was that it was priced accordingly- the same as an equivalent gold watch of its era. ", "People just could not accept that a pedestrian material such as steel could be priced so exorbitantly and consequently, it was not very popular. It was only after some time that the public saw this as something genuinely original and avant-garde. Today though, in-line with the craze for stainless steel, the Royal Oak is an icon. ", "In fact, part of the reason why there is a renewed interest in perpetual calendar Royal Oaks is that AP themselves have been releasing many of their iconic new models with this collection, from the black and white ceramic models, including the most recent open-worked version, and of course the insane RD2 ultra, ultra-thin.", "While the current Royal Oak Perpetual Calendar is fairly common, the 25820, especially with a smooth grey dial, is extremely rare. Just try looking around for another, you won’t find too many as they were made in low numbers. On top of this, collectors who own this reference are often reluctant to let them go. ", "Flipping the watch over, you’ll be greeted with the beautifully decorated Cal. 2120/2802, with the engraved rotor especially stunning. This is a grande complication inside one of the most iconic sports watches and I have no doubt that the Royal Oak Perpetual Calendar Ref. 25820 is an investment grade piece. "], "productCr": "This Audemars Piguet Royal Oak Perpetual Calendar 25820ST is in good condition. It has a few scratches and marks from previous use but there are no dings or anything deep. It comes as a full set with its winding box, manual, and guarantee booklet. This particular example had its movement changed by Audemars Piguet in 2003, one year after the purchase of this watch, and it is fully documented by AP Italy in the set. The movement is identical to the original.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Smooth-Grey-Dial_0001_Layer-138.png?v=1608247479", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Grey-Smooth-Dial_0021_Layer-73.png?v=1608247481", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Grey-Smooth-Dial_0027_Layer-59.png?v=1608247483", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Grey-Smooth-Dial_0024_Layer-63.png?v=1608247485", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Smooth-Grey-Dial_0006_Layer-133.png?v=1608247486", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Grey-Smooth-Dial_0025_Layer-62.png?v=1608247488", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Grey-Smooth-Dial_0020_Layer-74.png?v=1608247490", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Smooth-Grey-Dial_0003_Layer-136.png?v=1608247494", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Smooth-Grey-Dial_0002_Layer-137.png?v=1608247496", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Grey-Smooth-Dial_0026_Layer-61.png?v=1608247498", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Smooth-Grey-Dial_0005_Layer-134.png?v=1608247500", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Grey-Smooth-Dial_0019_Layer-75.png?v=1608247502", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Smooth-Grey-Dial_0007_Layer-132.png?v=1608247504", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Smooth-Grey-Dial_0008_Layer-131.png?v=1608247506", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Smooth-Grey-Dial_0004_Layer-135.png?v=1608247507", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Grey-Smooth-Dial_0022_Layer-72.png?v=1608247509", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25820ST-Grey-Smooth-Dial_0028_Layer-58.png?v=1608247511"]},
{"productYear": "1995", "title": "Audemars Piguet Royal Oak 25810OR 120th Anniversary", "productPrice": null, "productDescription": ["The Royal Oak, with its masculine octagonal case, exposed screws, and integrated bracelet is one of the most distinctive watches in the market today. It is imposing and recognizable, and in my opinion, one of the best statement watches money can buy. ", "The Royal Oak is not only famous for what it looks like, but also how it was introduced. First released in the ’70s, the original Ref. 5402 was a bold stainless steel watch designed by Gerald Genta that created shockwaves. It was designed as a luxury sports watch and the scandalous part was that it was priced accordingly- the same as an equivalent gold watch of its era. ", "People just could not accept that a pedestrian material such as steel could be priced so exorbitantly and consequently, it was not very popular. It was only after some time that the public saw this as something genuinely original and avant-garde. Today though, in-line with the craze for stainless steel, the Royal Oak is an icon. ", "Furthermore, the Ref. 25810 marked the first time a Royal Oak Perpetual Calendar featured a leap year indicator and a week indicator on the periphery. What makes this watch extra special lies in the movement, where you can see a beautifully intricate, hand engraved ‘120’ rotor in commemoration. ", "With a 39mm case, it sits much better on the wrist than the newer 41mms, with not only better proportions but also being more faithful to the original. In fact, the movement inside this watch is the same you will find on the Jumbo models as it is the legendary JLC Cal. 2120 with a perpetual calendar module built on top. As a result, this watch shares the same thickness as the 15202 with a slightly thicker bezel to accommodate the perpetual calendar module. For such a complicated watch that takes into account how many days each month has, including leap years, this is truly impressive. ", "The discontinued Royal Oak Perpetual Calendars have become immensely popular in the last two years and it's easy to see why. For a long time they were underappreciated and I am glad to see that finally, collectors are taking this reference seriously. ", "In fact, part of the reason why there is a renewed interest in perpetual calendar Royal Oaks is that AP themselves have been releasing many of their iconic new models with this collection, from the black and white ceramic models, including the most recent open-worked version, and of course the insane RD2 ultra, ultra-thin."], "productCr": "This Audemars Piguet Royal Oak Perpetual Calendar 25810OR is in excellent condition. It comes as a full set with its original box, anniversary certificate and guarantees. The watch winding box is working and the watch is also in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0005_Layer-78.png?v=1614325423", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0011_Layer-63.png?v=1614325425", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0003_Layer-59.png?v=1614325426", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0013_Layer-46.png?v=1614325428", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0012_Layer-47.png?v=1614325430", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0004_Layer-72.png?v=1614325432", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0008_Layer-65.png?v=1614325433", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0014_Layer-43.png?v=1614325435", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0001_Layer-75.png?v=1614325437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0009_Layer-53.png?v=1614325439", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0006_Layer-71.png?v=1614325440", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0003_Layer-73.png?v=1614325443", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0009_Layer-67.png?v=1614325445", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0008_Layer-77.png?v=1614325447", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0002_Layer-74.png?v=1614325449", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0001_Layer-61.png?v=1614325450", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0002_Layer-60.png?v=1614325453", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0004_Layer-58.png?v=1614325454", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0005_Layer-57.png?v=1614325456", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0006_Layer-56.png?v=1614325457", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0007_Layer-66.png?v=1614325459", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0007_Layer-76.png?v=1614325460", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-25810OR-120th-Anniversary_0010_Layer-50.png?v=1614325462"]},
{"productYear": "1999", "title": "Daniel Roth 10th Anniversary Papillon", "productPrice": null, "productDescription": ["When we think of the big independents today, names such as Voutilainen, Dufour, Journe and Smith come to mind. In fact, there is such a huge appreciation for independents today that is has become somewhat mainstream within collecting circles to own at least one watch from an independent brand. ", "Before all of this hype though, there was Daniel Roth. To be honest, in my opinion, the story of the Daniel Roth brand is a tragic one that could’ve worked out very differently. ", "To add some context, Daniel Roth was one of the most talented watchmakers of his generation and was responsible for many things you see today but do not realise. For one, he was a leading figure that established the design language of Breguet dress watches that you see today. In the ’60s and ’70s, Breguet had become a below-average watch brand with no future, until they were acquired by Chaumet, who in turn brought in Daniel Roth to lead the helm. The reference 3130, with its guilloche dial and its straight lugged case, set the tone for Breguet and was created by Daniel Roth. Moreover, he played a significant role in producing complicated movements for Lemania who may I remind you up until recently still provided the likes of Patek Philippe and Vacheron Constantin with chronograph calibres. ", "After that chapter of Roth’s life and entering into the ’90s, the independent brand ‘Daniel Roth’ began taking form and the watch you see here today is the pinnacle of it. This Daniel Roth Papillon was made as a 10-year anniversary celebration of the brand and it features a jumping hour complication and his distinctive tonneau-shaped case. Looking closer, you will see the beautiful attention to detail on the watch, with a guilloche dial reminiscent of his days in Breguet and a beautiful symmetrical design layout. The 12 o’clock aperture shows the jumping hour while the bottom half of the dial tells the minute with an oversized blued pointer. In the middle of the dial and layered above the hour and minute lies a beautiful running seconds subdial with a different guilloche pattern and a large blued seconds hand. The depth of the dial achieved through the layering and different guilloche patterns is really stunning. Flip the watch over and you will see his signature guilloched solid gold rotor and his calibre finished to perfection. ", "I truly think that these Daniel Roth watches are hugely under-appreciated and it is a tragedy that the man himself does not get the recognition he deserves. Due to bad business decisions, several takeovers and just pure bad luck, the brand Daniel Roth eventually ended up with Bvlgari, who today absorbed his distinctive case shape and branded it under their own. Compared to the original Roth pieces, which were elegant, understated and beautiful, today’s reiteration by Bvlgari is a far cry from that- oversized and gaudy. It does make me sad to see such a great watch brand tarnished, but I am sure it will be a matter of time before his great work is appreciated again. ", "Only 110 Papillon examples were produced in white gold, making it a very rare watch."], "productCr": "This Daniel Roth Anniversary Papillon is in good condition. It is used and has minor scratches from previous use but retains its originality and form. The dial is in excellent condition and the movement and jumping hour is functioning smoothly. It comes as a full set with its inner wooden box and outer leather case, and guarantee.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-10th-Anniversary-Papillon-Front-Shot.jpg?v=1568352438", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-10th-Anniversary-Papillon-Creative-Shot.jpg?v=1568352438", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-10th-Anniversary-Papillon-Creative-1.jpg?v=1568352438", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-10th-Anniversary-Papillon-Movement-Shot-1.jpg?v=1568352438", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-10th-Anniversary-Papillon-AR-Shot.jpg?v=1568352438", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-10th-Anniversary-Papillon-AL-Shot.jpg?v=1568352438", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-10th-Anniversary-Papillon-Movement-Shot.jpg?v=1568352438", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-10th-Anniversary-Papillon-Side-Shot.jpg?v=1568352438", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-10th-Anniversary-Papillon-Side-Shot-1.jpg?v=1568352424"]},
{"productYear": "2014", "title": "Patek Philippe Nautilus 5711A", "productPrice": null, "productDescription": ["I guess I have to begin by saying what everyone already knows: The Nautilus has to be the most popular watch of the last five years, especially in blue. At the center of the hype is the watch you see here today- the Patek Philippe Nautilus 5711 in stainless steel with a blue dial. ", "First released in the 1970s the Nautilus, designed by none other than Gerald Genta himself, was a crazy, avant-garde sports watch in stainless steel that sold for an eye-watering price. While the Royal Oak was designed in this same sense, Audemars Piguet was largely seen as the bad boys of the industry and when Patek Philippe followed suit, clients and critics alike who were used to seeing elegant dress watches were shocked to see that they followed in the footsteps AP. This was further reinforced by the fact that both were designed by the same man! The reference 3700 ‘Jumbo’, the first Nautilus model ever made, of course as we know managed to defy the odds and today is one of the holy grails of vintage Patek Philippe. ", "Fast forward to 2006, and Patek Philippe releases the heir apparent to the 3700 ‘Jumbo’, the 5711. Featuring an ultra-slim 8.3mm case, it is so thin not only for a sports watch but in general, sliding easily under the cuff of a shirt. The dial, offered in blue and white came with the familiar ridged dial and integrated stainless steel bracelet. For a while, you could’ve bought these at the boutique at retail but in the last few years, it is practically close to impossible to buy any Nautilus, let alone this 5711. While on paper the 5711 sits as the cheapest Nautilus you can buy, it is the hardest one to get as this is the reference collectors want the most. With this example, you get a stunning blue dial that throws off shades of green, black and blue depending on the light source and a beautifully finished case, with beautifully polished beveled edges contrasting with the brushed overall finish.", "The Patek Philippe Nautilus is really the ultimate luxury sports watch, combining brutalist design elements with an elegant profile and sizing. It is just such a cool watch and with the 5711 in particular, it is as pure as it gets, remaining faithful to the original Genta-designed 3700 ‘Jumbo’ from 40 years ago. "], "productCr": "This Patek Philippe Nautilus 5711 is in good condition. There are minor hairlines throughout that is visible in the photography. It comes as a full set with all of its accessories including its inner and outer box, certificate of origin, leather wallet and manuals. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-Blue-2_0019_Layer-37.png?v=1616488568", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-2_0029_Layer-29.png?v=1616488570", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-2_0024_Layer-34.png?v=1616488572", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-2_0025_Layer-33.png?v=1616488573", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-Blue-2_0018_Layer-39.png?v=1616488575", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-2_0026_Layer-32.png?v=1616488577", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-Blue-2_0017_Layer-40.png?v=1616488579", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-2_0028_Layer-30.png?v=1616488581", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-2_0023_Layer-35.png?v=1616488583", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-Blue-2_0015_Layer-42.png?v=1616488585", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-2_0027_Layer-31.png?v=1616488586", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-Blue-2_0016_Layer-41.png?v=1616488588", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-Blue-2_0020_Layer-38.png?v=1616488589"]},
{"productYear": "2013", "title": "F.P. Journe Chronometre A Resonance Black Label", "productPrice": null, "productDescription": ["Where to begin with F.P. Journe. Started by the man himself in 1999, Journe had previously spent quite a few years restoring and producing movements and also made a couple of pocket watches during that time. It took quite a few years before his brand went from something only a hardcore collector could appreciate to being appreciated by a more mainstream audience and today, he is considered by many as one of the most successful and important independent brands to have emerged.", "In my opinion, F.P. Journe has hit the sweet spot, producing around 900 pieces a year only. This ensures that they are exclusive enough that people consider any Journe a rare piece, but not so rare that it becomes esoteric. There are brands like Roger Smith and Philippe Dufour, both who are considered godfathers of high horology, but they make so few pieces a year that the average watch collector would not know about them. Mention F.P. Journe though, and you’ll have collectors jumping with joy. ", "With the Resonance, one really has to begin with the movement and the whole concept behind the watch. Powered by the in-house Calibre 1499.2, the idea of resonance was something that intrigued Francois-Paul Journe for a long time. Failing to create a successful movement that incorporated resonance in the ’80s, it took nearly two decades for Journe to finally be happy with a finished product and that very product is the watch you see here today. In fact, the Chronometre a Resonance has been in production since the Year 2000, and this year (2019) marks the final year for this calibre. ", "Briefly explaining, mechanical resonance is a physical principle where two oscillating balance wheels in a single movement sync up, improving stability and timekeeping via energy transference through vibrating sound waves from the wheels in motion. Though this might sound very complicated, it is a very romantic idea and something that certainly appeals to watch collectors. It is for this very reason that the F.P. Journe Resonance has become the most iconic wristwatch from the man himself.", "What distinguishes this piece from your regular Journe is of course in the name, all Black Label pieces take on a monochromatic colour palette. Beginning with a 40mm platinum case, it is interesting to note that Journe only uses platinum for his precious white metal watches, so you won’t find any in white gold. The main differentiating factor of this edition is the deep black glossy dial. Two clocks are displayed on the dial, with the left side hidden in a rotating aperture and the right one displaying the more traditional F.P. Journe layout. A crown at 4 o’clock acts as a resetting tool for the two sub-seconds, where pulling it out resets and hacks the seconds and syncs them in the process while the crown at 12 o’clock is used for setting the time and winding the watch. ", "F.P. Journe has carved a very interesting niche in the independent watch world where he has managed to blend traditional watchmaking and design cues with modern technology and an unmistakably Journe aesthetic. Despite using very traditional elements like his serif’d Arabic numerals, a knurled winding crown and a standard round case, the way it has been laid out combines to create a look that is F.P. Journe through and through. ", "The purists really love Journe because of his motto ‘Invenit et Fecit’, which translates from Latin to Invent and Create. To this day, F.P. Journe has stuck to this mantra, where he continues to invent his own in-house movements. Furthremore, everything else is also in-house, even to the point of owning his own case-maker and dial-maker. For a small brand that makes less than 1000 pieces a year, it is really impressive."], "productCr": "This F.P. Journe Chronometre a Resonance is in mint condition and comes as a full set with its Black Label certificate, inner and outer box. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_a_Resonance__0036_Layer_91.jpg?v=1574420922", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_A_Resonance_Creative_0002_Layer_26.jpg?v=1574420922", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_A_Resonance_Creative_0003_Layer_25.jpg?v=1574420922", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_a_Resonance__0039_Layer_88.jpg?v=1574420922", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_a_Resonance__0037_Layer_90.jpg?v=1574420922", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chrnometre_a_Resonance.jpg?v=1574420922", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_a_Resonance__0040_Layer_87.jpg?v=1574420922", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_a_Resonance__0041_Layer_86.jpg?v=1574420922", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_a_Resonance__0038_Layer_89.jpg?v=1574420922", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_A_Resonance_Creative_0001_Layer_27.jpg?v=1574420922"]},
{"productYear": "1990's", "title": "Patek Philippe Nautilus 3800 Diamond 'Double Dial'", "productPrice": null, "productDescription": ["I guess I have to begin by saying what everyone already knows: The Nautilus has to be the most popular watch of the last five years. With the modern 5711 trading at multiples of its retail and the vintage Jumbo 3700 trading for, even more, most people have been priced out of these examples. ", "Well, good thing Patek had a mid-size sibling to go along the Jumbo back in the day and as a result of these premiums, the prices of these have followed too. The 3800 was introduced at a time when the Nautilus was still seen as a brash, anti-Patek watch. Clients and critics alike were used to seeing elegant dress watches and were perhaps shocked to see that they followed in the footsteps of Audemars Piguet’s Royal Oak when they introduced the 3700 in the 70’s- Not to mention using the same designer in Gerald Genta! Furthermore, watch sizes of that era were much smaller, so to have a 42mm piece was considered hugely oversized and this is where the 3800 fits in, sized at 38mm and more acceptable to the general public. ", "The 3800 is every bit as good as its larger sibling and featuring the same monobloc case with beautiful finishing throughout. Every surface is brushed and polished and when it reflects light it simply looks amazing. ", "For the longest time, the 3800 Nautilus has lived in the shadow of the ‘Jumbo’, but as collectors become savvier, knowledgable, and confident, many have realized that they in fact prefer this reference as it suits their wrists better. Mid-size watches are hugely popular today and it shows that there are references like this that are just as rare and collectible. ", "It’s hard not to love the Nautilus, despite the mainstream craze as once you strap it onto your wrist, you begin to understand why"], "productCr": "This Patek Philippe Nautilus 3800 is in excellent condition and all original. The stainless steel case is very sharp and retains strong bevels. There are minor scratches throughout visible in the photography. This watch comes with a second white dial and as a watch only. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Diamond-Blue-White-_0033_Layer-57.png?v=1616488330", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Steel-Diamond-Blue-_0005_Layer-45.png?v=1616488330", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Diamond-Blue-White-_0032_Layer-59.png?v=1616488330", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Steel-Diamond-Blue-_0004_Layer-53.png?v=1616488330", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Diamond-Blue-White-_0031_Layer-60.png?v=1616488330", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Steel-Diamond-Blue-_0002_Layer-57.png?v=1616488330", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Steel-Diamond-Blue-_0007_Layer-42.png?v=1616488330", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Steel-Diamond-Blue-_0009_Layer-50.png?v=1616488330", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Diamond-Blue-White-_0029_Layer-62.png?v=1616488330", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Steel-Diamond-Blue-_0008_Layer-47.png?v=1616488330", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Steel-Diamond-Blue-_0006_Layer-39.png?v=1616488330", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Diamond-Blue-White-_0027_Layer-64.png?v=1616488330", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Diamond-Blue-White-_0028_Layer-63.png?v=1616488330", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Diamond-Blue-White-_0030_Layer-61.png?v=1616488330", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Diamond-Blue-White-_0034_Layer-58.png?v=1616488330", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Steel-Diamond-Blue-_0001_Layer-46.png?v=1616488330", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Steel-Diamond-Blue-_0003_Layer-56.png?v=1616488330"]},
{"productYear": "2000", "title": "Audemars Piguet Royal Oak 25820SP Perpetual Calendar", "productPrice": null, "productDescription": ["The Royal Oak, with its masculine octagonal case, exposed screws and integrated bracelet is one of the most distinctive watches in the market today. It is imposing and recognisable, and in my opinion, one of the best statement watches money can buy. ", "The Royal Oak is not only famous for what it looks like, but also how it was introduced. First released in the ’70s, the original Ref. 5402 was a bold stainless steel watch designed by Gerald Genta that created shockwaves. It was designed as a luxury sport watch and the scandalous part was that it was priced accordingly- the same as an equivalent gold watch of its era. ", "People just could not accept that a pedestrian material such as steel could be priced so exorbitantly and consequently, it was not very popular. It was only after some time that the public saw this as something genuinely original and avant-garde. Today, Audemars Piguet has not only expanded the Royal Oak line to include other materials, but has managed to make this model their flagship and an icon.", "Of late, while the Royal Oak itself has been immensely in demand, the discontinued perpetual calendars have been right at the top of it. This example is a special reference, as denoted by the ‘SP’ ending, meaning that it is made of both stainless steel and platinum. The shiny, polished finish is platinum while the brushed surfaces are steel. I have handled a fair few perpetual calendar Royal Oaks and I must say that the inclusion of platinum really adds some nice weight and heft to it. ", "Furthermore, the high polish finish of the platinum bezel and center links really stands out and has a huge presence on the wrist. While it is quite unusual for these two materials to be used on the same watch, it seems that this trait is somewhat of a Royal Oak thing, as AP still does this today on the newer 15202IP. ", "With a 39mm case, it sits much better on the wrist than the newer 41mms, with not only better proportions but also being more faithful to the original. In fact, the movement inside this watch is the same you will find on the Jumbo models as it is the legendary JLC Cal. 2120 with a perpetual calendar module built on top. As a result, this watch shares the same thickness as the 15202 with a slightly thicker bezel to accommodate the perpetual calendar module. For such a complicated watch that takes into account how many days each month has, including leap years, this is truly impressive. ", "Part of the reason why there is a renewed interest in perpetual calendar Royal Oaks is because AP themselves have been releasing many of their iconic new models with this collection, from the black and white ceramic models, including the most recent open-worked version, and of course the insane RD2 ultra, ultra-thin. With all of this hype, collectors have begun to realize just how special the early perpetual calendars are and how rare they are, with extremely low production numbers."], "productCr": "This Audemars Piguet Royal Oak Perpetual Calendar 25820SP is in excellent condition. It comes as a true full set, with its original watch winder wooden box, outer box, guarantee booklet, manual, hang tag and calendar pusher adjuster. Furthermore, this watch was serviced in 2018 by Audemars Piguet USA, ensuring it is in full working condition. All parts are original and nothing has been changed, including the correct unsigned AP crown. The case is unpolished and sharp and has some minor hairlines from use over time. A nice bonus is that this watch was sold in the year 2000, and comes with a further certificate signifying this watch was sold on the 125th anniversary of Audemars Piguet.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SP_0001_Layer65.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SPCreatives_0014_Layer17.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SP_0010_Layer57.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SPCreatives_0013_Layer18.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SP_0009_Layer58.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SPCreatives_0007_Layer24.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SPCreatives_0008_Layer23.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SPCreatives_0016_Layer15.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SPCreatives_0012_Layer19.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SP_0002_Layer56.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SPCreatives_0009_Layer22.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SPCreatives_0011_Layer20.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SP_0005_Layer62.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SP_0006_Layer61.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SP_0007_Layer60.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SPCreatives_0010_Layer21.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SPCreatives_0015_Layer16.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SP_0004_Layer63.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SP_0003_Layer64.jpg?v=1585057083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakPerpetualCalendar25820SP_0008_Layer59.jpg?v=1585057071"]},
{"productYear": "2008", "title": "F.P. Journe Octa Lune 38mm", "productPrice": null, "productDescription": ["Where to begin with F.P. Journe. Started by the man himself in 1999, Journe had previously spent quite a few years restoring and producing movements and also made a couple of pocket watches during that time. It took quite a few years before his brand went from something only a hardcore collector could appreciate to being appreciated by a more mainstream audience and today, he is considered by many as one of the most successful and important independent brands to have emerged.", "In my opinion, F.P. Journe has hit the sweet spot, producing around 900 pieces a year only. This ensures that they are exclusive enough that people consider any Journe a rare piece, but not so rare that it becomes esoteric. There are brands like Roger Smith and Philippe Dufour, both who are considered godfathers of high horology, but they make so few pieces a year that the average watch collector would not know about them. Mention F.P. Journe though, and you’ll have collectors jumping with joy. ", "It goes without saying that F.P. Journe has been one of the hottest brands in the last 12 months, finally gaining the recognition that it deserved all along. With early brass movement pieces hitting records at auction, the rest of the collection has followed. This particular example is one of the more desirable models as it is a discontinued 38mm version. Collectors value the old 38mm sizing due to its perfect proportions and how well it sits on the wrist. Furthermore, this one comes with the elusive and desirable salmon dial. This is one of those watches where photos really do not do the watch justice- in real life, the dial pops and the subtle grained texture of the salmon dial really comes to life.", "Flip the watch over and you will see the in-house FPJ calibre 1300.3 made entirely of rose gold. It has a beautiful 22k gold rotor and all parts are hand finished to perfection. It has a 120-hour power reserve, and this is indicated on the dial.", "The Octa Lune regardless of which variant is one of the all-time greats from the F.P. Journe line up and with this aesthetic not in production anymore, it certainly makes it an investment-grade piece and one that you’ll be happy to wear every day. "], "productCr": "This F.P. Journe Octa Lune is in mint condition. It is in full working order and comes as a full set with its inner and outer box, warranty and manual.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGold_0030_Layer19.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGoldCreatives_0003_Layer57.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGold_0032_Layer18.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGold_0035_Layer15.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGoldCreatives_0014_Layer46.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGoldCreatives_0001_Layer59.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGoldCreatives_0002_Layer58.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGoldCreatives_0006_Layer54.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGoldCreatives_0007_Layer53.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGoldCreatives_0015_Layer45.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGold_0031_aaaaaa.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGold_0034_Layer16.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGoldCreatives_0013_Layer47.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGoldCreatives_0012_Layer48.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGoldCreatives_0011_Layer49.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGold_0038_Layer12.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGold_0039_Layer11.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGoldCreatives_0010_Layer50.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGoldCreatives_0009_Layer51.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGoldCreatives_0008_Layer52.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGoldCreatives_0005_Layer55.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGoldCreatives_0004_Layer56.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGold_0037_Layer13.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGold_0036_Layer14.jpg?v=1585058675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaLune38mmRoseGold_0033_Layer17.jpg?v=1585058675"]},
{"productYear": "2000s", "title": "Roger Dubuis Sympathie 37 Perpetual Chronograph", "productPrice": null, "productDescription": ["For a long time, the Roger Dubuis name was thought to be over and irrelevant to collectors. With Dubuis watches of today having garish designs and proportions that are all wrong, it is no wonder why. The truth is, Roger Dubuis, the man, left the company in 2005 and while he was undoubtedly a brilliant watchmaker, he lacked business expertise.", "An independent brand with aspiration, I have no doubt that today’s indies have Dubuis and other pioneers of his time to thank for laying out the groundwork. Roger Dubuis formed his eponymous brand in 1995 after two decades at Patek Philippe and at the time, it not only took huge courage to start an independent brand but Dubuis had to also operate in an area that wasn’t as mainstream as it is today.", "There were two main lines that Dubuis produced- the Homage series, which were more traditional round cased watches, and what you see here today- the Sympathie series. Featuring a more experimental case design, this is the most iconic Dubuis shape with an amorphous and angular shape. ", "Not only is the Sympathie case distinctively Dubuis, but his dial design also had a strong identity. This Sympathie 37 has a beautiful opaline dial and features stylized lettering on both the Arabic numerals and the calendar display. The thing that strikes me the most about early Roger Dubuis watches is that not only is it of the highest standard, but it somehow manages to have a truly original design language- something that is truly lacking in most of today’s industry.", "Each Roger Dubuis model from his time was made in limited editions of 28, making this example extremely special and rare. "], "productCr": "This Roger Dubuis Sympathie 37 is in very good condition. It comes with its original inner and outer box, solid white gold caseback, original Roger Dubuis Alligator strap, certificate and brochure. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph-White-Gold_0017_Layer-30.png?v=1606467291", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph_0042_Layer-23.png?v=1606467292", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph_0036_Layer-30.png?v=1606467294", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph_0039_Layer-26.png?v=1606467296", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph_0040_Layer-25.png?v=1606467298", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph-White-Gold_0018_Layer-28.png?v=1606467299", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph_0035_Layer-32.png?v=1606467301", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph-White-Gold_0020_Layer-26.png?v=1606467303", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph_0037_Layer-28.png?v=1606467305", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph_0038_Layer-27.png?v=1606467307", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph-White-Gold_0021_Layer-25.png?v=1606467309", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph-White-Gold_0016_Layer-29.png?v=1606467311", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph-White-Gold_0019_Layer-27.png?v=1606467312", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph-White-Gold_0022_Layer-24.png?v=1606467314", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph-White-Gold_0023_Layer-23.png?v=1606467317", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph_0041_Layer-24.png?v=1606467319", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Perpetual-Calendar-Chronograph_0043_Layer-20.png?v=1606467320"]},
{"productYear": "2006", "title": "Rolex Cosmograph Daytona 116520", "productPrice": null, "productDescription": ["I really don’t think I need to go too much into the Daytona as anyone who is anyone knows about this watch. It has always been the case that the ultimate Rolex is ironically not a solid gold President Day-Date, but the Cosmograph Daytona. With waitlists in the years to authorised dealers these days not even entertaining you unless you’ve bought another Rolex before, the Daytona is without a doubt the most desirable and hardest to get Rolex in the market today. ", "This example is the discontinued reference 116520 and the introduction of this reference marked a historical change for Rolex where in the year 2000, they moved away from using outsourced chronograph movements, to their new, in-house Calibre 4130. Prior to this in the 16520 model, Rolex used a Zenith El Primero movement and prior to that, Valjoux ebauches on the 62XX series.", "Part of the allure of the Daytona certainly has to be its look, with its sleek stainless steel case and glossy black dial, on the wrist it just works amazingly well. As this reference has been succeeded by the newer 116500, I know that the 116520 will soon become more and more sought after and collectable. "], "productCr": "This Rolex Cosmograph Daytona is in mint condition and comes as a super full set, with its inner and outer box, guarantee punched papers, leather wallet, calendar, hang tag and manual. It is a D Serial and in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-White_0021_Layer-17.png?v=1596699319", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-White_0023_Layer-83.png?v=1596699322", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-White_0020_Layer-19.png?v=1596699325", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-White_0024_Layer-80.png?v=1596699328", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-White_0026_Layer-77.png?v=1596699331", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-White_0018_Layer-21.png?v=1596699333", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-White_0025_Layer-79.png?v=1596699335", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-White_0022_Layer-18.png?v=1596699337", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-White_0022_Layer-84.png?v=1596699340", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-White_0017_Layer-22.png?v=1596699342", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-White_0016_Layer-23.png?v=1596699344", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-White_0019_Layer-20.png?v=1596699347", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-White_0021_Layer-85.png?v=1596699349", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-White_0020_Layer-86.png?v=1596699351"]},
{"productYear": "2014", "title": "F.P. Journe Octa Reserve De Marche Black Label", "productPrice": null, "productDescription": ["Where to begin with F.P. Journe. Started by the man himself in 1999, Journe had previously spent quite a few years restoring and producing movements, and also made a couple of pocket watches during that time. It took quite a few years before his brand went from something only a hardcore collector could appreciate to being appreciated by a more mainstream audience and today, he is considered by many as one of the most successful and important independent brands to have emerged."], "productCr": "This F.P. Journe Octa Reserve de Marche Black Label comes as a full set, with its box and papers. It has its inner and outer box, its Black Label Certificate of Guarantee dated and signed by Francois-Paul Journe, its Collection Octa booklet, a spare F.P. Journe black alligator strap and a F.P. Journe cleaning cloth. This watch is in mint condition. It has some very minor superficial scratches from use. It is in full working order and comes on its original black Alligator strap and signed platinum tang buckle.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P-Journe-Octa-Reserve-de-Marche-Black-Label-Front-Shot.jpg?v=1544689043", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P-Journe-Octa-Reserve-de-Marche-Black-Label-Creative.jpg?v=1544689043", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P-Journe-Octa-Reserve-de-Marche-Black-Label-Creative-2.jpg?v=1544689043", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P-Journe-Octa-Reserve-de-Marche-Black-Label-Wrist-Shot.jpg?v=1544689043", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P-Journe-Octa-Reserve-de-Marche-Black-Label-Creative-1.jpg?v=1544689043", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P-Journe-Octa-Reserve-de-Marche-Black-Label-AL-Shot.jpg?v=1544689043", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P-Journe-Octa-Reserve-de-Marche-Black-Label-Movement-Shot-1.jpg?v=1544689043", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P-Journe-Octa-Reserve-de-Marche-Black-Label-Movement-Shot-2.jpg?v=1544689043", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P-Journe-Octa-Reserve-de-Marche-Black-Label-AR-Shot.jpg?v=1544689043", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P-Journe-Octa-Reserve-de-Marche-Black-Label-Creative-3.jpg?v=1544689043", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P-Journe-Octa-Reserve-de-Marche-Black-Label-Side-Shot.jpg?v=1544689043", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P-Journe-Octa-Reserve-de-Marche-Black-Label-Buckle-Shot.jpg?v=1544689043"]},
{"productYear": "2000's", "title": "Vianney Halter Classic", "productPrice": null, "productDescription": ["It is not often the case we can call a watch entirely unique and original, but if someone were to get close, Vianney Halter would have to be in the conversation. One of the early pioneers of the independent movement, Vianney Halter existed before collecting independents a trend. Small scale and taking his time, he has become known today for his distinctive aesthetic. ", "This is the Vianney Halter Classic, one of his most iconic, next to the more complicated Antiqua. A time-only piece, it is housed in a 36mm 18k yellow gold case and features real rivets on the edge of the case along with a studded crown. Two nibs on the top and bottom of the case connect the lugs which hold the strap, rounding off this undoubtedly steampunk style watch. The case is finished with a circular brushing at the top and polished sides, adding a nice depth to the overall look. Wearing and winding the watch, I found it to be a very pleasant tactile experience, from the grip of the studded crown and touching the different surfaces of the watch. ", "The dial is incredibly beautiful on this Classic, with radial stylized Arabic numerals sitting atop a circular brushed silver surface. Towards the center of the dial, there is contrast with the graining and this is topped off with the delicately beautiful curved blued hands. ", "Powering this watch is a heavily modified Lemania 8810 with a mystery ‘sapphire’ rotor that allows the user to see the movement undisturbed. There are weights on the periphery of the rotor to allow effective oscillation and the movement looks simple but is nevertheless expertly finished with curved angles along the way. ", "At a first glance, the Vianney Halter Classic looks like a relatively simple and novel watch, but the more you look at it the more you realize how much attention to detail has gone into it- from the case design to the textures of the dial and finishing of the movement. Limited to 250 pieces and released in 2001, this is truly a rare and exclusive watch that looks completely unique to what is available in the market today. "], "productCr": "This Vianney Halter is in very good condition. It is unpolished and retains all of its original finishing. It comes as a full set with box and papers and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-Rose-Gold-2_0016_Layer-22.png?v=1616488858", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-RG-2_0054_Layer-7.png?v=1616488858", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-RG-2_0052_Layer-9.png?v=1616488858", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-RG-2_0053_Layer-8.png?v=1616488858", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-RG-2_0055_Layer-5.png?v=1616488858", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-Rose-Gold-2_0017_Layer-21.png?v=1616488858", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-RG-2_0051_Layer-11.png?v=1616488858", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-RG-2_0056_Layer-3.png?v=1616488858", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-Rose-Gold-2_0018_Layer-20.png?v=1616488858", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-RG-2_0057_Layer-1.png?v=1616488858", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-Rose-Gold-2_0020_Layer-18.png?v=1616488858", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-Rose-Gold-2_0021_Layer-17.png?v=1616488858", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-Rose-Gold-2_0022_Layer-16.png?v=1616488858", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-Rose-Gold-2_0019_Layer-19.png?v=1616488805"]},
{"productYear": "2019", "title": "Patek Philippe Annual Calendar 5205G Blue", "productPrice": null, "productDescription": ["I would first begin by saying that in my opinion, the Patek Philippe 5205 Annual Calendar is perhaps the perfect embodiment of what a modern Patek should be. Sure, it is not the rarest or most complicated watch that the brand makes, but I feel that the sum of its parts, from the dial to the case and movement, really makes this a contender for the definitive Patek Philippe of the 21st century so far.", "Introduced in 2010, the 5205 marked a new generation of Annual Calendars from Patek Philippe and featured a distinctive 3 aperture layout at 10, 12 and 2 o’clock that displayed the day, date, and month respectively. This was an aesthetic that was truly something new and it is no surprise that this became one of the brand’s best sellers. ", "Rewinding back slightly, the annual calendar complication was invented and patented by Patek Philippe in 1996 as they realized that there was a gap between a simple calendar watch and the highly complicated perpetual calendar complication. While a simple calendar must be adjusted every month, and a perpetual calendar never needs to be adjusted, even on leap years, an annual calendar sits in the middle, where the user only has to adjust the watch once a year in February, while the mechanism takes care of the 30 and 31 days of the rest of the year. The highly expensive perpetual calendar was too inaccessible and the annual calendar provided the perfect balance between practicality and cost.", "The reason why I think the 5205 is the perfect modern watch is that while it may seem like your average dress watch, the design cues Patek incorporated into the references really makes it one of the most versatile pieces to own. Beginning with the 18k rose gold case, it is sized at a modern 40mm and sits very well on the wrist, giving the right amount of presence without being too large. The case itself has an unusual concave bezel which really draws you into the dial and one of my favourite parts of this watch is the beautiful hollowed-out lugs that flow amorphously through to the centre of the case. The holes and indentation to the side of the case really make this watch much ‘lighter’ in its aesthetic and really provides a much-needed balance. ", "Patek Philippe has been trying to modernize their brand for a long time in an attempt to attract a younger crowd and while in recent times they’ve had some hit and misses, they really knocked this one out of the park."], "productCr": "This Patek Philippe 5205 is unworn and comes as a full set, including its inner and outer box, Patek Philippe leather folder, Certificate of Origin, manual, pusher pin and hang tag. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G-Blue-_0017_Layer-129.png?v=1608249314", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G-Blue_0011_Layer-98.png?v=1608249315", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G-Blue_0013_Layer-70.png?v=1608249317", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G-Blue-_0021_Layer-125.png?v=1608249319", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G-Blue_0017_Layer-66.png?v=1608249321", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G-Blue_0018_Layer-128.png?v=1608249322", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G-Blue-_0019_Layer-130.png?v=1608249324", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G-Blue-_0022_Layer-124.png?v=1608249326", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G-Blue_0016_Layer-67.png?v=1608249329", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G-Blue-_0023_Layer-123.png?v=1608249331", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G-Blue_0018_Layer-65.png?v=1608249333", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G-Blue_0076_Layer-99.png?v=1608249334", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G-Blue_0012_Layer-97.png?v=1608249336", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G-Blue_0015_Layer-68.png?v=1608249338", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G-Blue-_0020_Layer-126.png?v=1608249340"]},
{"productYear": "2012", "title": "Rolex Cosmograph Daytona 116520", "productPrice": null, "productDescription": ["I really don’t think I need to go too much into the Daytona as anyone who is anyone knows about this watch. It has always been the case that the ultimate Rolex is ironically not a solid gold President Day-Date, but the Cosmograph Daytona. With waitlists in the years to authorised dealers these days not even entertaining you unless you’ve bought another Rolex before, the Daytona is without a doubt the most desirable and hardest to get Rolex in the market today. ", "This example is the discontinued reference 116520 and the introduction of this reference marked a historical change for Rolex where in the year 2000, they moved away from using outsourced chronograph movements, to their new, in-house Calibre 4130. Prior to this in the 16520 model, Rolex used a Zenith El Primero movement and prior to that, Valjoux ebauches on the 62XX series.", "Part of the allure of the Daytona certainly has to be its look, with its sleek stainless steel case and glossy black dial, on the wrist it just works amazingly well. As this reference has been succeeded by the newer 116500, I know that the 116520 will soon become more and more sought after and collectable. "], "productCr": "This Rolex Cosmograph Daytona is in mint condition and comes as a full set, with its inner and outer box, guarantee card, leather wallet and manual. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-Black-2_0005_Layer-60.png?v=1596699421", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-Black-2_0029_Layer-81.png?v=1596699424", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-Black-2_0004_Layer-62.png?v=1596699426", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-Black-2_0030_Layer-78.png?v=1596699428", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-Black-2_0003_Layer-63.png?v=1596699430", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-Black-2_0028_Layer-82.png?v=1596699432", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-Black-2_0027_Layer-87.png?v=1596699434", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-Black-2_0006_Layer-61.png?v=1596699436", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-Black-2_0002_Layer-59.png?v=1596699438", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Daytona-116520-Black-2_0001_Layer-64.png?v=1596699440"]},
{"productYear": "2000s", "title": "Cartier Tortue Monopoussoir CPCP", "productPrice": null, "productDescription": ["The name Cartier needs no introduction. As one of the most influential and celebrated jewellery and watch brands of the last 100 years, it has always stood as a mark of luxury and desirability. Without taking away from its historical significance, I would say that when it comes to watches, Cartier has always been predominantly known as a ‘design’ brand rather than a pure watchmaking one, with stunningly iconic models such as the Tank, the Crash and the Santos all seen as important due to how it looks. In fact, to this day, it is the beautiful and unconventional designs that attract collectors and a unique position in the watch brand hierarchy that no other possesses. ", "As I have mentioned many times, the ’90s was an unconventional and murky time for watch brands, having just come out of the quartz crisis that decimated most of the industry. Brands were either experimenting like crazy or strictly conservative, wary of the fact they just survived the equivalent of a nuclear bomb. The industry was slowly coming back, with consumers beginning to take an interest in mechanical watches and with this in mind, Cartier decided that I was time to improve its image as a true watchmaking brand. ", "The result was the Collection Privé Cartier Paris division, referred to simply as the CPCP. The intention of the CPCP was to be the premier mechanical watchmaking division of Cartier and looking back on it today, it was one of the best decisions they ever made. The philosophy was simple, the CPCP took iconic models that were already loved by many, and reproduced them with high-grade movements, working with bonafide watch manufactures such as Piaget, Jaeger-LeCoultre, Frédéric Piguet, Girard-Perregaux and more. ", "The CPCP collection ran for 10 years between 1998 and 2008 and I can confidently say it is one of the most significant periods in Cartier’s history. It’s beautiful to see that Cartier was doing ‘reissues’ before it was even a thing and doing it the right way- respecting the past while producing something that is modern. Not only this, but the CPCP models were produced in truly limited numbers, with many having a designated run of 50 to 100 pieces. For those in the Collection Privé that weren’t strictly ‘limited’, it is estimated that only 250-300 pieces were made for each reference making any CPCP watch out there truly special. ", "Collectors are finally taking notice of this, and Cartier in general as a brand worth collecting. With more knowledge available now, the demand for Cartier has been huge and I only see it getting larger, especially for important references such as those from the CPCP line. "], "productCr": "This Cartier Tortue Monopoussoir is in good condition. It has minor scratches from use but remains unpolished. It comes as a full set with its Collection Prive box and guarantee papers. This watch is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-Collection-Prive-YG_0009_Curves-1.png?v=1606464482", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Monopoussoir-Tortue-CPCP-Collection-Prive-YG_0013_Layer-66.png?v=1606464484", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Monopoussoir-Tortue-CPCP-Collection-Prive-YG_0016_Layer-53.png?v=1606464486", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Monopoussoir-Tortue-CPCP-Collection-Prive-YG_0015_Layer-57.png?v=1606464488", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-Collection-Prive-YG_0010_Layer-78.png?v=1606464490", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Monopoussoir-Tortue-CPCP-Collection-Prive-YG_0012_Layer-65.png?v=1606464492", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Monopoussoir-Tortue-CPCP-Collection-Prive-YG_0017_Layer-50.png?v=1606464493", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-Collection-Prive-YG_0012_Layer-76.png?v=1606464495", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-Collection-Prive-YG_0011_Layer-77.png?v=1606464497", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Monopoussoir-Tortue-CPCP-Collection-Prive-YG_0014_Layer-64.png?v=1606464498", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-Collection-Prive-YG_0013_Layer-75.png?v=1606464500", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-Collection-Prive-YG_0014_Layer-74.png?v=1606464502"]},
{"productYear": "2018", "title": "Ming 17.03 GMT Black", "productPrice": null, "productDescription": ["Being an independent watch brand is no easy feat. Taking on the Swiss juggernauts in a time when the market is saturated with different watches and having the odds stacked against you is something most would run away from. I mean, it is clear- just look at the number of independent brands over the years that have come and gone, who just couldn’t make it and either sold out to a bigger brand or just vanish completely. ", "That being said, if there was a shining light, a name that has defied the odds through truly original thinking and an unwavering desire for quality, it would have to be MING. ", "Established in 2017 in Kuala Lumpur, Malaysia, Ming Thein founded his eponymous brand with the intention to create a watch that satiated his obsessive desire for perfection while maintaining a price point that was fair and accessible. Being associated with the watch industry for many years through both his passion and his profession as a commercial photographer, he managed to build up a vast knowledge of watchmaking and design, culminating with the release of the 17.01 in 2017. ", "The example you see here today, is what followed in the ’17’ series- the 17.03. Released in 2018, the 17.03 features a useful GMT function that is adjustable through the first position of the crown. Easy and quick to use, it is exactly what a travel watch should be.", "Sized in a 38mm Grade-2 Titanium case, this design has now become the signature look of MING. With flared lugs and a curved bar strap, the completely brushed case really combines with the black of the dial to create a beautifully stealthy and easy to wear watch. This example comes fitted on a MING titanium bracelet, which is perhaps one of my favorite bracelets in the market. With fitted end links that join with the case seamlessly, this bracelet is unbelievably ‘soft’ and comfortable on the wrist. ", "The dial is a three-part construction that includes the central sunburst pattern with its GMT indicator, an outer peripheral ring with concentric rings, and the now famous sapphire donut rings that are filled with luminoiva and display the numerals atop it all.", "The beauty of MING is that somehow, they have managed to transcend a ‘pricing-based’ class system that has always been around in the watch industry. From an obscure, new brand on the block in 2017, today MING commands a huge legion of fans, from ultra-high-end collectors to your average guy who is just starting out. In fact, not only do MING watches sell for a premium in the used market (something that is pretty much unheard of with something like this), the last few releases have seen them sold out in record time, with the last 27.01 Ultra Slim selling out in under 10 minutes. ", "Furthermore, the 17.06 Copper managed to win the Horological Revelation Prize at the GPHG in 2019, a watch industry award that is akin to the Grammys. It was an amazing feat that truly solidified the MING brand as a true success and one that is here to last."], "productCr": "This Ming 17.03 GMT Black is in excellent condition. It comes as a full set with its box and card, and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Black_0013_Layer-44.png?v=1596700680", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Black_0038_Layer-67.png?v=1596700682", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Black_0012_Layer-46.png?v=1596700684", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Black_0037_Layer-69.png?v=1596700687", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Black_0011_Layer-47.png?v=1596700688", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Black_0036_Layer-76.png?v=1596700690", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Black_0014_Layer-45.png?v=1596700692", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Black_0010_Layer-48.png?v=1596700694", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Black_0009_Layer-49.png?v=1596700697", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Black_0008_Layer-50.png?v=1596700699"]},
{"productYear": "Circa 2000's", "title": "F.P. Journe Chronometre A Resonance", "productPrice": null, "productDescription": ["Where to begin with F.P. Journe. Started by the man himself in 1999, Journe had previously spent quite a few years restoring and producing movements and also made a couple of pocket watches during that time. It took quite a few years before his brand went from something only a hardcore collector could appreciate to being appreciated by a more mainstream audience and today, he is considered by many as one of the most successful and important independent brands to have emerged.", "In my opinion, F.P. Journe has hit the sweet spot, producing around 900 pieces a year only. This ensures that they are exclusive enough that people consider any Journe a rare piece, but not so rare that it becomes esoteric. There are brands like Roger Smith and Philippe Dufour, both who are considered godfathers of high horology, but they make so few pieces a year that the average watch collector would not know about them. Mention F.P. Journe though, and you’ll have collectors jumping with joy. ", "Briefly explaining, mechanical resonance is a physical principle where two oscillating balance wheels in a single movement sync up, improving stability and timekeeping via energy transference through vibrating sound waves from the wheels in motion. Though this might sound very complicated, it is a very romantic idea and something that certainly appeals to watch collectors. It is for this very reason that the F.P. Journe Resonance has become the most iconic wristwatch from the man himself.", "The example you see here today features the old Resonance aesthetic, with two symmetrical sub-dials displaying the two different clocks. A crown at 4 o’clock acts as a resetting tool for the two sub-seconds dial, where pulling it out resets and hacks the seconds and syncs them in the process while the crown at 12 o’clock is used for setting the time and winding the watch. For something so complicated, it is actually surprisingly easy to use.", "It has to be mentioned that the Resonance is perhaps one of the most desired Journe pieces, confirmed later in 2019 when an early brass movement example went for 250,000 USD. I’m really glad to finally see Journe receive the recognition he deserves. ", "F.P. Journe has carved a very interesting niche in the independent watch world where he has managed to blend traditional watchmaking and design cues with modern technology and an unmistakably Journe aesthetic. Despite using very traditional elements like his serif’d Arabic numerals, a knurled winding crown and a standard round case, the way it has been laid out combines to create a look that is F.P. Journe through and through. ", "The purists really love Journe because of his motto ‘Invenit et Fecit’, which translates from Latin to Invent and Create. To this day, F.P. Journe has stuck to this mantra, where he continues to invent his own in-house movements. Furthermore, everything else is also in-house, even to the point of owning his own case-maker and dial-maker. For a small brand that makes less than 1000 pieces a year, it is really impressive."], "productCr": "This F.P. Journe Chronometre a Resonance is in excellent condition. It is in full working order and it comes with an extract certificate from F.P. Journe. It has been registered and approved and the extract is being delivered.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonance40mmRoseGold_0040_Layer10.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/aaaaProduct-Shot-Template.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonanceRoseGoldCreatives_0026_Layer35.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonance40mmRoseGold_0042_Layer8.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonance40mmRoseGold_0045_Layer5.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonanceRoseGoldCreatives_0018_Layer43.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonanceRoseGoldCreatives_0017_Layer44.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonanceRoseGoldCreatives_0024_Layer37.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonanceRoseGoldCreatives_0023_Layer38.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonanceRoseGoldCreatives_0022_Layer39.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonanceRoseGoldCreatives_0019_Layer42.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonanceRoseGoldCreatives_0021_Layer40.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonanceRoseGoldCreatives_0020_Layer41.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonance40mmRoseGold_0041_Layer9.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonance40mmRoseGold_0049_Layer1.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonance40mmRoseGold_0048_Layer2.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonance40mmRoseGold_0044_Layer6.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonance40mmRoseGold_0047_Layer3.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonance40mmRoseGold_0046_Layer4.jpg?v=1585193990", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneChronometreaResonance40mmRoseGold_0043_Layer7.jpg?v=1585193990"]},
{"productYear": "2017", "title": "Ming 17.01 Anthracite No.03", "productPrice": null, "productDescription": ["Being an independent watch brand is no easy feat. Taking on the Swiss juggernauts in a time when the market is saturated with different watches and having the odds stacked against you is something most would run away from. I mean, it is clear- just look at the number of independent brands over the years that have come and gone, who just couldn’t make it and either sold out to a bigger brand or just vanish completely. ", "Established in 2017 in Kuala Lumpur, Malaysia, Ming Thein founded his eponymous brand with the intention to create a watch that satiated his obsessive desire for perfection while maintaining a price point that was fair and accessible. Being associated with the watch industry for many years through both his passion and his profession as a commercial photographer, he managed to build up a vast knowledge of watchmaking and design, culminating with what you see here today- the 17.01.", "The 17.01 was released in 2017 in anthracite and blue, with both having a limited run of 150 pieces. Sized in a 38mm Grade-5 Titanium case, this design has now become the signature look of MING. With short, outward curving lugs and a curved bar strap, the top of the case is polished while the sides are brushed, adding a nice depth to the overall look. ", "The dial, is a three-part construction that includes the central guilloché-like pattern, the outer, circular brushed periphery, and the now-famous sapphire donut rings that displays the numerals atop it all. With these combined, the dial has an amazing depth that varies in color depending on the lighting, displaying shades of grey all the way to a deep black. ", "The case is solidly constructed, offering a 100m water resistance with triple crown gaskets and is nitrogen-filled in order to slow down the deterioration of lubricants, enhancing reliability and longevity. The manually wound SW210-1 caliber is no slouch either. MING put it through a 250-hour testing program, adjust to 5 positions. ", "The beauty of MING is that somehow, they have managed to transcend a ‘pricing-based’ class system that has always been around in the watch industry. From an obscure, new brand on the block in 2017, today MING commands a huge legion of fans, from ultra-high-end collectors to your average guy who is just starting out. In fact, not only do MING watches sell for a premium in the used market (something that is pretty much unheard of with something like this), the last few releases have seen them sold out in record time, with the last 27.01 Ultra Slim selling out in under 10 minutes. ", "Furthermore, the 17.06 Copper managed to win the Horological Revelation Prize at the GPHG in 2019, a watch industry award that is akin to the Grammys. It was an amazing feat that truly solidified the MING brand as a true success and with this 17.01 Anthracite, it is worth mentioning that this bears the serial No. 3, making it the third watch ever made by the brand. It is a rare opportunity to purchase a collectible and unique watch, and also a true piece of MING history. "], "productCr": "This Ming 17.01 Anthracite is in excellent condition. It comes as a full set with its box and card, and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Black-_0006_Layer-51.png?v=1596700176", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Black_0041_Layer-72.png?v=1596700176", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Black-_0005_Layer-53.png?v=1596700176", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Black_0042_Layer-66.png?v=1596700176", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Black-_0003_Layer-55.png?v=1596700176", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Black_0040_Layer-73.png?v=1596700176", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Black_0039_Layer-74.png?v=1596700176", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Black-_0007_Layer-52.png?v=1596700176", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Black-_0002_Layer-56.png?v=1596700176", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Black-_0001_Layer-57.png?v=1596700176", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Black-_0004_Layer-54.png?v=1596700176"]},
{"productYear": "2016", "title": "Audemars Piguet Royal Oak 15400ST Ruthenium", "productPrice": null, "productDescription": ["The Royal Oak, with its masculine octagonal case, exposed screws and integrated bracelet is one of the most distinctive watches in the market today. It is imposing and recognizable, and in my opinion, one of the best statement watches money can buy. ", "The Royal Oak is not only famous for what it looks like, but also how it was introduced. First released in the ’70s, the original Ref. 5402 was a bold stainless steel watch designed by Gerald Genta that created shockwaves. It was designed as a luxury sport watch and the scandalous part was that it was priced accordingly- the same as an equivalent gold watch of its era. ", "People just could not accept that a pedestrian material such as steel could be priced so exorbitantly and consequently, it was not very popular. It was only after some time that the public saw this as something genuinely original and avant-garde. Today though, in-line with the craze for high horology, sport watches, the Royal Oak is an icon. As Audemars Piguet famously stated in its marketing ad from ’70s: ‘would you buy a Rembrandt for its canvas?’", "The example you see here today is the discontinued reference 15400. Produced until 2019 and succeeded by the current 15500, the biggest difference over its predecessor the 15300 was that the size was increased to 41mm. Other than that, it maintained all other aesthetic cues and an overall design staying true to the Royal Oak DNA."], "productCr": "This Audemars Piguet Royal Oak 15400 is in good condition. There are minor hairlines throughout from previous use. It comes as a full set with its inner and outer box, instruction manual and guarantee booklet.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15400ST-Ruthenium_0043_Layer-29.png?v=1592300748", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15400ST-Anthracite_0007_Layer-64.png?v=1592300748", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15400ST-Ruthenium_0045_Layer-27.png?v=1592300748", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15400ST-Ruthenium_0046_Layer-26.png?v=1592300748", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15400ST-Anthracite_0009_Layer-62.png?v=1592300748", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15400ST-Anthracite_0006_Layer-67.png?v=1592300748", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15400ST-Anthracite_0008_Layer-63.png?v=1592300748", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15400ST-Anthracite_0010_Layer-61.png?v=1592300748", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15400ST-Ruthenium_0044_Layer-28.png?v=1592300748", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15400ST-Ruthenium_0047_Layer-25.png?v=1592300666", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15400ST-Ruthenium_0048_Layer-24.png?v=1592300666"]},
{"productYear": "1999", "title": "Audemars Piguet Royal Oak 14790 Blue", "productPrice": null, "productDescription": ["The Royal Oak, with its masculine octagonal case, exposed screws, and integrated bracelet is one of the most distinctive watches in the market today. It is imposing and recognizable, and in my opinion, one of the best statement watches money can buy. ", "The Royal Oak is not only famous for what it looks like, but also how it was introduced. First released in the ’70s, the original Ref. 5402 was a bold stainless steel watch designed by Gerald Genta that created shockwaves. It was designed as a luxury sports watch and the scandalous part was that it was priced accordingly- the same as an equivalent gold watch of its era. ", "People just could not accept that a pedestrian material such as steel could be priced so exorbitantly and consequently, it was not very popular. It was only after some time that the public saw this as something genuinely original and avant-garde. Today though, in-line with the craze for stainless steel, the Royal Oak is an icon. ", "While it has always been about the ‘Jumbo’ or larger-sized Royal Oaks, in recent times, there has been a growing appreciation for mid-sized examples, namely what you see here today, the Ref. 14790. This is certainly in line with the large watch trend ending as collectors are beginning to appreciate proportionate and more elegantly sized watches. ", "Identified by collectors as occupying three distinct generations, the ref. 14790ST I have here is a second-generation featuring a rare blue ‘petite tappisserie’ dial. Not to be mistaken with the Yves Klein dial, this shade of blue is rarer, more muted, and is denoted by its ‘.01’ dial code in the full reference number. While the .01 is stated to be blue or grey, you hardly ever see this shade of blue. ", "Powered by the in-house caliber 2225 movement, the ref. 14790ST features a 21kt gold winding bidirectional winding rotor and a 40-hour power reserve.", "With its exceedingly rare dial, gorgeous proportions, and coming as a full set, this ref. 14790ST will no doubt make for an exquisite inclusion in even the most zealous of Royal Oak collections. "], "productCr": "This Audemars Piguet Royal Oak 14790 is in very good condition. The case has minor marks on it visible in the photography but the case definition remains excellent. It comes as a full set with its original octagonal box and guarantee papers. It is in full working order and has been recently serviced.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790-Blue_0026_Layer-99.png?v=1614325083", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790ST-Blue_0015_Layer-64.png?v=1614325084", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790ST-Blue_0017_Layer-55.png?v=1614325100", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790ST-Blue_0023_Layer-48.png?v=1614325102", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790ST-Blue_0021_Layer-51.png?v=1614325104", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790-Blue_0023_Layer-103.png?v=1614325106", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790ST-Blue_0025_Layer-44.png?v=1614325108", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790ST-Blue_0016_Layer-62.png?v=1614325110", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790ST-Blue_0019_Layer-39.png?v=1614325111", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790-Blue_0024_Layer-102.png?v=1614325115", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790-Blue_0025_Layer-101.png?v=1614325119", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790ST-Blue_0020_Layer-52.png?v=1614325117", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790-Blue_0027_Layer-100.png?v=1614325120", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790-Blue_0021_Layer-105.png?v=1614325114", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790-Blue_0022_Layer-104.png?v=1614325122", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790ST-Blue_0018_Layer-54.png?v=1614325124", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790ST-Blue_0022_Layer-49.png?v=1614325126", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-14790ST-Blue_0024_Layer-45.png?v=1614325129"]},
{"productYear": "2014", "title": "Audemars Piguet Royal Oak 15202 Jumbo 'Blue'", "productPrice": null, "productDescription": ["The Royal Oak, with its masculine octagonal case, exposed screws and integrated bracelet is one of the most distinctive watches in the market today. It is imposing and recognizable, and in my opinion, one of the best statement watches money can buy. ", "While to most, every Royal Oak looks the same, to those who know- the reference 15202 sits above and beyond the rest both in aesthetics and demand. While Audemars Piguet has made many variants of time-only Royal Oaks, the 15202 is the one that is most faithful to the original Ref. 5402 and as such, shares the ‘Jumbo’ nickname. Sized at 39mm and using the same JLC derived Cal. 2121 as the original, this is the Royal Oak for the purists. Two hands, 8.1mm and a beautiful sapphire case back with a decorate rotor- it sits with perfect proportionality on the wrist. ", "In fact, many of you should know by now, that the blue dial Jumbo you see here today is probably the most desired and hardest to get Royal Oak from an authorized dealer. As a boutique exclusive, only existing clients that have bought many other APs are allocated one, with dealers only getting in a piece or two a year. As a result, there is a huge premium on the used market for examples like this. ", "I must say, I get why people are so in love with the blue Jumbo. The blue dial really shimmers in the light and throws off different shades of blue depending on the light source. While on my wrist, I often find myself just staring at the dial, not even knowing what time it is. "], "productCr": "This Audemars Piguet Royal Oak 15202 is in mint condition. This example comes as a full set with its outer and inner box, manual and guarantee. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202ST-Blue-3_0013_Layer-119.png?v=1614324677", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202ST-Blue-3_0028_Layer-40.png?v=1614324679", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202ST-Blue-3_0011_Layer-121.png?v=1614324681", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202ST-Blue-3_0026_Layer-42.png?v=1614324683", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202ST-Blue-3_0010_Layer-122.png?v=1614324685", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202ST-Blue-3_0029_Layer-38.png?v=1614324686", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202ST-Blue-3_0012_Layer-120.png?v=1614324688", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202ST-Blue-3_0008_Layer-124.png?v=1614324690", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202ST-Blue-3_0009_Layer-123.png?v=1614324691", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202ST-Blue-3_0027_Layer-41.png?v=1614324693"]},
{"productYear": "1999", "title": "Cartier Tank Americaine CPCP", "productPrice": null, "productDescription": ["The name Cartier needs no introduction. As one of the most influential and celebrated jewellery and watch brands of the last 100 years, it has always stood as a mark of luxury and desirability. Without taking away from its historical significance, I would say that when it comes to watches, Cartier has always been predominantly known as a ‘design’ brand rather than a pure watchmaking one, with stunningly iconic models such as the Tank, the Crash, and the Santos all seen as important due to how it looks. In fact, to this day, it is the beautiful and unconventional designs that attract collectors and a unique position in the watch brand hierarchy that no other possesses. ", "As I have mentioned many times, the ’90s was an unconventional and murky time for watch brands, having just come out of the quartz crisis that decimated most of the industry. Brands were either experimenting like crazy or strictly conservative, wary of the fact they just survived the equivalent of a nuclear bomb. The industry was slowly coming back, with consumers beginning to take an interest in mechanical watches, and with this in mind, Cartier decided that it was time to improve its image as a true watchmaking brand. ", "The result was the Collection Privé Cartier Paris division, referred to simply as the CPCP. The intention of the CPCP was to be the premier mechanical watchmaking division of Cartier and looking back on it today, it was one of the best decisions they ever made. The philosophy was simple, the CPCP took iconic models that were already loved by many, and reproduced them with high-grade movements, working with bonafide watch manufactures such as Piaget, Jaeger-LeCoultre, Frédéric Piguet, Girard-Perregaux, and more. ", "The easiest way to differentiate a CPCP watch was by the dial, with all but one model (Tank Cintrée) featuring a ‘Cartier Paris’ inscription- an ode to its heritage. The dials were always crafted from solid gold and often featured a strong hand-turned guilloche pattern.", "While many of Cartier’s design dates back to the early 20th century, the Tank Americaine is a relatively new creation. Released in 1989 and intended to be a more accessible and masculine version of the flagship Tank Cintree, it was released as a normal and unspectacular quartz watch. The dimensions of the Tank Americaine were enlarged, swapping the Cintree’s elongated case for a thicker and wider watch with more presence. ", "Released in 1998 and part of the Collection Privé Cartier Paris (CPCP), this example is not only rare but powered by a high quality 430 MC manually wound caliber and features a beautiful guilloché dial that CPCP watches have become known for. The prominent rosette in the middle of the dial is a beautiful touch and the more wearable 45X26mm dimensions work fantastically on the wrist.", "Collectors are finally taking notice of this, and Cartier in general is a brand worth collecting. With more knowledge available now, the demand for Cartier has been huge and I only see it getting larger, especially for important references such as those from the CPCP line. "], "productCr": "This Cartier Tank Americaine is in excellent condition. It comes as a full set with its box and papers and it is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-CPCP-RG_0001_Layer-47.png?v=1612753226", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-CPCP-YG_0036_Layer-10.png?v=1612753226", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-CPCP-RG_0012_Layer-52.png?v=1612753226", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-CPCP-YG_0032_Layer-14.png?v=1612753226", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-CPCP-RG_0010_Layer-54.png?v=1612753226", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-CPCP-YG_0037_Layer-9.png?v=1612753226", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-CPCP-RG_0014_Layer-51.png?v=1612753226", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-CPCP-YG_0038_Layer-8.png?v=1612753226", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-CPCP-RG_0008_Layer-56.png?v=1612753226", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-CPCP-YG_0035_Layer-11.png?v=1612753226", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-CPCP-RG_0009_Layer-55.png?v=1612753226", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-CPCP-RG_0011_Layer-53.png?v=1612753226", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-CPCP-YG_0034_Layer-12.png?v=1612753226", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-CPCP-YG_0031_Layer-15.png?v=1612753226", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-CPCP-YG_0033_Layer-13.png?v=1612753226"]},
{"productYear": "1990s", "title": "Cartier Santos Dumont 1575", "productPrice": null, "productDescription": [], "productCr": "This Cartier Santos Dumont is in very good condition. It has minor scratches throughout that are visible in the photography but the case is in fantastic shape, with strong bevels and overall definition. It comes as a watch only and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Santos-Dumont-1575-Platinum_0010_Layer-88.png?v=1614325688", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Santos-Dumont-Platinum_0055_Layer-10.png?v=1614325691", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Santos-Dumont-Platinum_0056_Layer-7.png?v=1614325693", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Santos-Dumont-1575-Platinum_0009_Layer-89.png?v=1614325699", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Santos-Dumont-1575-Platinum_0007_Layer-91.png?v=1614325696", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Santos-Dumont-Platinum_0057_Layer-5.png?v=1614325701", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Santos-Dumont-Platinum_0059_Layer-2.png?v=1614325702", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Santos-Dumont-Platinum_0054_Layer-12.png?v=1614325704", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Santos-Dumont-1575-Platinum_0008_Layer-90.png?v=1614325707", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Santos-Dumont-Platinum_0058_Layer-3.png?v=1614325709", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Santos-Dumont-1575-Platinum_0011_Layer-87.png?v=1614325710", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Santos-Dumont-1575-Platinum_0012_Layer-86.png?v=1614325712", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Santos-Dumont-1575-Platinum_0013_Layer-85.png?v=1614325715"]},
{"productYear": "2020", "title": "Ming 27.01", "productPrice": null, "productDescription": ["Established in 2017, Ming Thein founded his own eponymous watch brand with the intention of creating a timepiece that was offered at a fair price point, original in its design and catered to his exacting nature. Funded by six founders, Ming has grown beyond what was originally thought possible and today quickly sells out every watch they drop. A shining example for other independent brands to follow, Ming has become one of the hottest brands on the market.", "Following on from their original release, Ming asked what would happen if they evolved the 17.01 and brought it three years forward to 2020. The answer to that question, is the 27.01 that I have here. Spiritual successor of the 17.01, the 27.01 features the next generation of Ming’s design language and exists as still-accessible daily wearer, created by watch enthusiasts, for watch enthusiasts. ", "A natural continuation of Ming’s design language, the 27.01 features elements such as radial dial symmetry, enhanced legibility, an ‘O’ marker at 12 o’clock, Ming’s now-iconic flared lugs, a range of surface finishes, and visual layering to make the 27.01’s dimensions seem deeper than they are. On top of the additional layering and material transitions, the case now incorporates flying blade lugs, a feature new to design language 2.", "At just 6.9mm thick, the 27.01 is the thinnest Ming to date, while still retaining wrist presence at 38mm in diameter. Continuing their partnership with Jean Rousseau Paris for their straps, the 27.01 is mounted to a blue rubber strap that contrasts the 27.01’s anthracite dial nicely.", "Powered by a heavily, heavily reworked ETA Peseux 7001, Ming and Schwarz Etienne remade all of the plates and bridges, had it black chromed, and only kept the gear train and escapement. It is certainly a fine movement to look at and a great example of how to get originality despite the movement not being ‘in-house’.", "An impressive continuation of the 17 series, the 27.01 provides plenty of insight into how Ming will progress in the future and what they see as important design choices, while also remaining faithful to what came before it. ", "This example was part of the original release of 27.01s in 2020 and if you didn’t know, they sold out in minutes. It is amazing to see how the brand has progressed in just three short years. "], "productCr": "This Ming 27.01 is in mint condition. It comes as a full set with its box and papers and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-27.01_0037_Layer-108.png?v=1614326507", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-27.01-_0053_Layer-15.png?v=1614326509", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-27.01-_0049_Layer-22.png?v=1614326512", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-27.01-_0050_Layer-21.png?v=1614326514", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-27.01_0038_Layer-109.png?v=1614326515", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-27.01_0036_Layer-110.png?v=1614326520", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-27.01-_0051_Layer-18.png?v=1614326519", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-27.01-_0048_Layer-25.png?v=1614326524", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-27.01_0034_Layer-112.png?v=1614326517", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-27.01_0035_Layer-111.png?v=1614326523", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-27.01-_0052_Layer-16.png?v=1614326526", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-27.01_0039_Layer-107.png?v=1614326527", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-27.01_0040_Layer-106.png?v=1614326532"]},
{"productYear": "2002", "title": "Daniel Roth Small Seconds", "productPrice": null, "productDescription": ["When we think of the big independents today, names such as Voutilainen, Dufour, Journe, and Smith come to mind. In fact, there is such a huge appreciation for independents today that it has become somewhat mainstream within collecting circles to own at least one watch from an independent brand. ", "Before all of this hype though, there was Daniel Roth. To be honest, in my opinion, the story of the Daniel Roth brand is a tragic one that could’ve worked out very differently. ", "After that chapter of Roth’s life and entering into the ’90s, the independent brand ‘Daniel Roth’ began taking form. There are three distinct periods in the Daniel Roth brand, the early period when he was truly independent, the middle period when The Hour Glass was a stakeholder, and the final period when Bvlgari took over and Daniel Roth left the company.", "In 1995, Daniel Roth joined forces with The Hour Glass Group and the example you see here today is part of that period. With a beautiful black dial with Roth’s signature ‘ligne’ guilloche, it is classic and elegant in its design. ", "I truly think that these Daniel Roth watches are hugely under-appreciated and it is a tragedy that the man himself does not get the recognition he deserves. Due to bad business decisions, several takeovers, and just pure bad luck, the brand Daniel Roth eventually ended up with Bvlgari, who today absorbed his distinctive case shape and branded it under their own. Compared to the original Roth pieces, which were elegant, understated, and beautiful, today’s reiteration by Bvlgari is a far cry from that- oversized and gaudy. It does make me sad to see such a great watch brand tarnished, but I am sure it will be a matter of time before his great work is appreciated again. "], "productCr": "This Daniel Roth Small Seconds is in great condition. It is in full working order and comes as a full set with its box and papers.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-Seconds-at-Six-Black_0006_Layer-125.png?v=1614325911", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-Seconds-at-Six-Steel-Black-_0061_Layer-11.png?v=1614325912", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-Seconds-at-Six-Steel-Black-_0065_Layer-9.png?v=1614325914", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-Seconds-at-Six-Steel-Black-_0062_Layer-6.png?v=1614325916", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-Seconds-at-Six-Black_0005_Layer-127.png?v=1614325918", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-Seconds-at-Six-Black_0003_Layer-129.png?v=1614325919", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-Seconds-at-Six-Steel-Black-_0064_Layer-1.png?v=1614325921", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-Seconds-at-Six-Black_0001_Layer-131.png?v=1614325922", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-Seconds-at-Six-Black_0002_Layer-130.png?v=1614325924", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-Seconds-at-Six-Black_0004_Layer-128.png?v=1614325925", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-Seconds-at-Six-Steel-Black-_0060_Layer-13.png?v=1614325928", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-Seconds-at-Six-Black_0007_Layer-126.png?v=1614325929", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel-Roth-Seconds-at-Six-Steel-Black-_0063_Layer-4.png?v=1614325933"]},
{"productYear": "1995", "title": "Patek Philippe Calatrava 3796G", "productPrice": null, "productDescription": ["One of the bedrocks of the Patek Philippe collection is its classic dress watch- the Calatrava. A necessary foundation piece for any Haute Horlogerie brand, the dress watch is a must and with the Calatrava, Patek Philippe continues to build on its rich tradition till this day. ", "For a bit of historical context, we go back to the ’30s when Charles and Henri Stern purchased the Patek Philippe brand. To revamp the manufacture, the first model they produce is, of course, the Calatrava. The Ref. 96 came in 1932, at a time when wristwatches were beginning to take over pocket watches and it was a move that cemented their status as one of the eminent watch brands of the world. To this day, the Stern family still owns Patek Philippe and you can tell that the Calatrava and in particular this first reference, is very important to them. ", "In the 1980s, under the helm of Philippe Stern, the brand introduces the Ref. 3796, which is what you see here today. What many do not realise, is that the Ref. 3796 is nearly a one to one recreation of the original Calatrava. From its case size to its coin-edged bezel, it wears exactly the same. ", "I see it as a tribute and a nod to the family heritage of both Patek and the Sterns and a historically important reference. This example is made particularly special as although today white metal Patek’s are fairly common, back then they were made in much lower quantities and as a result commands a premium for its rarity. ", "Many see the Calatrava as the blueprint for the ultimate dress watch, and I can’t help but agree. With perfect proportions and elegance, this Ref. 3796 is a great dress watch and one that remains understated, until someone who knows notices. "], "productCr": "This Patek Philippe 3796G is in good condition. It has some minor hairlines from use but retains a strong case with its hallmark on the caseback still visible. It is all original and the movement is fully functional. It comes on a Patek Philippe Black Alligator strap in used condition and its original 18k white gold tang buckle.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrave-3796G-Front-Shot.jpg?v=1568354317", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrava-3796G_0007_Layer-101.png?v=1592301672", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrava-3796G_0009_Layer-99.png?v=1592301672", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrave-3796G-AR-Shot.jpg?v=1592301672", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrave-3796G--AL-Shot.jpg?v=1592301672", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrave-3796G-Caseback-Shot.jpg?v=1592301672", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrava-3796G_0008_Layer-100.png?v=1592301672", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrave-3796G-Side-Shot-1.jpg?v=1592301672", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrave-3796G-Side-Shot.jpg?v=1592301672", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrave-3796G-Buckle-Shot-1.jpg?v=1592301672", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrava-3796G-Creative.jpg?v=1592301672", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrava-3796G-Wrist-Shot.jpg?v=1592301672", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrave-3796G-Buckle-Shot.jpg?v=1592301672"]},
{"productYear": "2009", "title": "F.P. Journe Chronometre Souverain 38mm", "productPrice": null, "productDescription": ["Regarded as one of the hottest horological prospects in the world right now, it is immensely impressive that F.P. Journe has only been around for the length of time that it has. Founded in 1999, F.P. Journe burst onto the watchmaking scene with a 20 piece limited run of Tourbillon Souverain Souscription watches that cash-strapped Francois Paul used to finance his brand, just like Abraham Louis Breguet did over 200 years ago. 20 odd years later, however, the F.P. Journe brand has become a horological powerhouse with waiting lists growing ever-longer and auction results growing ever more impressive.", "Here, I have an early 38mm yellow gold F.P Journe Chronomètre Souverain offered in spectacular condition. Introduced in 2005, the Souverain impressively won that year’s ‘Favourite Men’s Watch’ award at the GPHG. Quintessentially Journe-like, the Souverain has become the bedrock from which all other Journe models are built.", "One of the most incredible aspects of this Chronomètre Souverain is without a doubt its white dial. Featuring a hobnail, Clous de Paris pattern in its center, the dial plays with light in a gorgeously enticing way. Framing the dial is a black seconds track along its periphery that, in conjunction with the black Breguet numerals, contrasts the blued steel hands nicely. Thanks to a sub-seconds dial found between 7 and 8 o’clock and a 56-hour power-reserve indicator at 3 o'clock, the Souverain has a highly-legible asymmetrical dial which combines utilitarianism with the aesthetical Journe design choices for which the brand is now famed.", "Aside from the dial, the Chronomètre Souverain also has another trick up its sleeve. On display through the sapphire crystal caseback is the impressive in-house cal. 1304. Made entirely of 18k rose gold, the cal. 1304 has two mainspring barrels that work in parallel to power the movement over the course of its 56-hour power reserve. Gorgeously constructed and in plain sight thanks to it being manually wound, the cal. 1304 presents the same visual delight from the rear of the Souverain as the dial does from the front.", "What makes this particular example even more special is the fact that it comes sized at 38mm. While today’s Journes are all 40mm or 42mm, early F.P. Journes were sized at 38mm and have now been long discontinued. Collectors in general prefer the old 38mm sizing due to its rarity and also its overall proportionality. Overall, the Chronometre Souverain just might be the perfect discreet dress watch, with all of the craftsmanship and finishing one would want. "], "productCr": "This F.P. Journe Chronometre Souverain is in very good condition. It has some minor scuffs throughout from previous use but remains unpolished and sharp. It comes as a full set with its inner and outer box, warranty card, cloth and instructions brochure. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-38mm-RG_0015_Layer-96.png?v=1606465001", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-RG-38mm_0058_Layer-8.png?v=1606465003", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-RG-38mm_0057_Layer-9.png?v=1606465005", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-RG-38mm_0061_Layer-5.png?v=1606465007", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-38mm-RG_0017_Layer-94.png?v=1606465009", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-38mm-RG_0019_Layer-92.png?v=1606465011", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-RG-38mm_0060_Layer-6.png?v=1606465013", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-RG-38mm_0064_Layer-2.png?v=1606465015", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-38mm-RG_0020_Layer-91.png?v=1606465017", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-38mm-RG_0016_Layer-95.png?v=1606465018", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-38mm-RG_0018_Layer-93.png?v=1606465021", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-38mm-RG_0021_Layer-90.png?v=1606465022", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-38mm-RG_0022_Layer-89.png?v=1606465092", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-38mm-RG_0023_Layer-88.png?v=1606465095", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-RG-38mm_0059_Layer-7.png?v=1606465097", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-RG-38mm_0062_Layer-4.png?v=1606465099", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-RG-38mm_0063_Layer-3.png?v=1606465101", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-RG-38mm_0065_Layer-1.png?v=1606465107"]},
{"productYear": "2017", "title": "Ming 19.01", "productPrice": null, "productDescription": ["Being an independent watch brand is no easy feat. Taking on the Swiss juggernauts in a time when the market is saturated with different watches and having the odds stacked against you is something most would run away from. I mean, it is clear- just look at the number of independent brands over the years that have come and gone, who just couldn’t make it and either sold out to a bigger brand or just vanish completely. ", "That being said, if there was a shining light, a name that has defied the odds, through truly original thinking and an unwavering desire for quality, it would have to be MING. ", "Established in 2017 in Kuala Lumpur, Malaysia, Ming Thein founded his eponymous brand with the intention to create a watch that satiated his obsessive desire for perfection while maintaining a price point that was fair and accessible. Being associated with the watch industry for many years through both his passion and his profession as a commercial photographer, he managed to build up a vast knowledge of watchmaking and design, culminating with the launch of his very own watch brand. ", "The 19.01 is the second model to come out after the 17.01, it was developed and built without consideration for the cost. The Ming 19.01 is the result of the team at Ming asking what their ultimate daily wearer watch would be. Packing all of the associated factors together into one perfect Ming timepiece, the 19.01 is a distinctive, robust, and practical timepiece that comes with all of the Ming design choices we have come to expect from the beloved independent brand.", "Starting with the construction, we have a 39mm grade 5 titanium case that has been milled to receive the very special movement that can be found within. This method eliminates the need for spacer rings and allows the caseback to be received directly into the case. Both sapphire crystals, have been given a double anti-reflective coating and possess a shouldered profile, giving them the name “box” crystal.", "The dial of the 19.01 is stunning in its looks and something that is truly original. While glass and dial have traditionally been separate, the 19.01 combines the two with layers of sapphire. Deep-blue and purple in its color, the top sapphire is fumè in its style. Opaque at the center and increasingly translucent as the eye radiates towards the periphery, the 19.01 begins to subtly hint at its incredible movement found within before you even manage to examine the caseback.", "Contained within the 19.01 is a Ming-exclusive version of the Schwarz-Etienne MSE100, now called the MSE100.1. Featuring two skeletonized mainspring barrels, which deliver 100 hours of power reserve, a two-tone anthracite bead-blasted finish, and skeletonized bridges, the MSE100.1 is a special movement for a very special watch. Featuring gorgeously executed anglage throughout, the MSE100.1 is the perfect movement to combine its own mechanical excellence and beauty with the visual complexity of the 19.01’s construction.", "No doubt a flagship watch, the 19.01 symbolizes their own investment in themselves as both designers and watchmakers in what is an extremely exciting timepiece. With its mechanical excellence and visually striking design, the 19.01 will make for a wonderful addition to any collection."], "productCr": "This Ming 19.01 is in mint condition. It comes as a full set with its box and papers and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01-1_0037_Layer-107.png?v=1608253530", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0035_Layer-54.png?v=1608253521", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0034_Layer-55.png?v=1608253521", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0032_Layer-80.png?v=1608253521", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0003_Layer-105.png?v=1608253521", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0005_Layer-103.png?v=1608253521", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0037_Layer-52.png?v=1608253521", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0006_Layer-102.png?v=1608253521", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0040_Layer-48.png?v=1608253521", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0002_Layer-106.png?v=1608253521", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0004_Layer-104.png?v=1608253521", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0007_Layer-101.png?v=1608253521", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0036_Layer-53.png?v=1608253521", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0033_Layer-56.png?v=1608253521", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0008_Layer-100.png?v=1608253521", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0030_Layer-84.png?v=1608253522", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0031_Layer-82.png?v=1608253522", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0039_Layer-50.png?v=1608253522", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-19.01_0038_Layer-51.png?v=1608253522"]},
{"productYear": "2018", "title": "Rolex GMT-Master Pepsi 126710 BLRO", "productPrice": null, "productDescription": ["The Rolex GMT-Master needs no introduction. It is perhaps the most iconic travel watch, allowing its wearer to simultaneously tell two time zones. Developed originally in the 1950s for PanAm pilots, who had then begun flying transatlantic route more frequently, this handy tool watch was vital in order to track home and local time. Over the decades, Rolex has continually tweaked and evolved the model and despite huge changes since the first reference 6542, it is still instantly recognisable as the iconic GMT-Master.", "The example you see here today is the Ref. 126710 BLRO and it is one of the newest and hottest GMT-Masters at the moment. Go into any AD and they will tell you of the years-long waitlist and what other less desirable Rolex you have to buy first to get a chance. It certainly is simply controlling the supply in order to prop up demand, but all of that aside, I really do see the appeal of this. ", "For the longest time, Rolex could not figure out how to have two colours in one bezel as it was made of ceramic and insanely difficult to do so. They managed to finally do it with the Batman and it was a huge success, but the black and blue bezel was much easier to produce as the tones of colour was much closer together. Without a doubt, the iconic colours of the GMT-Master is red and blue, or ‘Pepsi’ as collectors call it and since the introduction of the ceramic bezel in the 2000s, there had been no Pepsi- that is until Rolex teased us 2014. I still remember, everyone was so excited to finally have a Pepsi ceramic GMT and when it was released, they only did it in white gold! I was certainly on a budget back then and my Pepsi dreams went out the window in a flash. ", "Furthermore, the new GMT-Master, to everyone’s surprise, came with a jubilee bracelet. I suppose it was to differentiate it to the white gold model and while some people didn’t like it very much, after handling and wearing this example, I must say that I am a huge fan.", "I really do feel that the GMT function is the most practical complication to have on the wrist, even today. All it takes is one look at the wrist and you will be able to tell the time at your selected timezone. For someone like me, or I am sure many of you, who travels a lot or even conducts business on the other side of the world, a GMT-Master is without a doubt, a welcome tool. It certainly is faster than fumbling around with your iPhone to find out the time. "], "productCr": "This Rolex GMT-Master II 126710 BLRO is in mint condition. It has no scratches and has been worn very carefully. It is in full working order and comes as a full set with its inner and outer box, sleeve, warranty card and manual.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-GMT-Master-II-126710BLNR-2_0003_Layer-57.png?v=1592302063", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-GMT-Master-II-126710BLNR-2_0001_Layer-107.png?v=1592302063", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-GMT-Master-II-126710BLNR-2_0002_Layer-59.png?v=1592302063", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-GMT-Master-II-126710BLNR-2_0001_Layer-60.png?v=1592302063", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-GMT-Master-II-126710BLNR-2_0004_Layer-58.png?v=1592302036", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-GMT-Master-II-126710BLNR-2_0005_Layer-56.png?v=1592302036"]},
{"productYear": "2019", "title": "Ming 17.06 Copper", "productPrice": null, "productDescription": ["Bursting onto the scene in 2017, Ming has become one of the hottest watch brands in the world. Founded and fully funded by a group of 6 enthusiasts, Ming has built its business model on limited production ‘drops’ whereby it has quickly become the case that their watches sell out almost instantly. With such incredible and unique designs, and a story that all watch enthusiasts can get behind, it is no surprise that Ming finds themselves in the position they do.", "Here I have a Ming 17.06 Copper from 2019 when the model was released. With “clean and restrained modern forms” as Ming puts it, the entire watch is built around the visual experience created by its dial. With numerous dial textures, layers, and rather intelligent use of Super LumiNova, the 17.06 Copper is aesthetic mastery. The 17.06’s warm etched copper dial creates a gorgeous visual juxtaposition between the polished 316L stainless steel case and satin-finished crown. As the several textures and finishes play off one another, the 17.06 comes into its own as a watch that was conceived to make use of light in ways we rarely see in horology.", "Beyond its beautiful design, the 17.06 is technically impressive too. Waterproof to 100m, the Ming is a rather capable dress watch. Powered by the quintessential workhorse movement, the ETA 2824-2, Ming has modified the movement to have two crown positions and regulated it in five positions. As such, the 17.06 is more than adequately equipped to keep time than a lot of other watches that use the very same movement. It is interesting to note that even as an independent watchmaker, Ming still takes the utmost care in ensuring what they produce is of incredible value and can stand up to brands that are priced far beyond what Ming prices their watches at.", "Furthermore, the 17.06 Copper managed to win the Horological Revelation Prize at the GPHG in 2019, a watch industry award that is akin to the Grammys. It was an amazing feat that truly solidified the MING brand as a true success and one that is here to last."], "productCr": "This Ming 17.06 Copper is in excellent condition. It comes as a full set with its box and card, and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Copper_0001_Layer-117.png?v=1606466356", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Copper_0031_Layer-42.png?v=1606466358", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Copper_0003_Layer-115.png?v=1606466363", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Copper_0034_Layer-33.png?v=1606466359", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Copper_0005_Layer-113.png?v=1606466361", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Copper_0032_Layer-39.png?v=1606466366", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Copper_0002_Layer-116.png?v=1606466365", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Copper_0004_Layer-114.png?v=1606466375", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Copper_0033_Layer-36.png?v=1606466371", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Copper_0006_Layer-112.png?v=1606466369", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Copper_0007_Layer-111.png?v=1606466373"]},
{"productYear": "2018", "title": "Ming 17.03 GMT Blue", "productPrice": null, "productDescription": ["Being an independent watch brand is no easy feat. Taking on the Swiss juggernauts in a time when the market is saturated with different watches and having the odds stacked against you is something most would run away from. I mean, it is clear- just look at the number of independent brands over the years that have come and gone, who just couldn’t make it and either sold out to a bigger brand, or just vanish completely. ", "That being said, if there was a shining light, a name that has defied the odds, through truly original thinking and an unwavering desire for quality, it would have to be MING. ", "Established in 2017 in Kuala Lumpur, Malaysia, Ming Thein founded his eponymous brand with the intention to create a watch that satiated his obsessive desire for perfection while maintaining a price point that was fair and accessible. Being associated with the watch industry for many years through both his passion and his profession as a commercial photographer, he managed to build up a vast knowledge of watchmaking and design, culminating with the release of the 17.01 in 2017. ", "The example you see here today, is what followed in the ’17’ series- the 17.03. Released in 2018, the 17.03 features a useful GMT function that is adjustable through the first position of the crown. Easy and quick to use, it is exactly what a travel watch should be.", "Sized in a 38mm Grade-2 Titanium case, this design has now become the signature look of MING. With flared lugs and a curved bar strap, the completely brushed case really combines with the blue of the dial to create a seriously photogenic watch.", "The dial is a three-part construction that includes the central sunburst pattern with its GMT indicator, an outer peripheral ring with concentric rings, and the now-famous sapphire donut rings that are filled with luminoiva and displays the numerals atop it all. With these combined, the dial has an amazing depth that varies in color depending on the lighting, and the tones of blues vary also based on the different finishing. ", "The beauty of MING is that somehow, they have managed to transcend a ‘pricing-based’ class system that has always been around in the watch industry. From an obscure, new brand on the block in 2017, today MING commands a huge legion of fans, from ultra-high-end collectors to your average guy who is just starting out. In fact, not only do MING watches sell for a premium in the used market (something that is pretty much unheard of with something like this), the last few releases have seen them sold out in record time, with the last 27.01 Ultra Slim selling out in under 10 minutes. ", "Furthermore, the 17.06 Copper managed to win the Horological Revelation Prize at the GPHG in 2019, a watch industry award that is akin to the Grammys. It was an amazing feat that truly solidified the MING brand as a true success and one that is here to last."], "productCr": "This Ming 17.03 GMT Blue is in excellent condition. It comes as a full set with its box and card and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Blue_0015_Layer-24.png?v=1596700537", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue_0034_Layer-65.png?v=1596700537", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue_0032_Layer-70.png?v=1596700537", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Blue_0014_Layer-26.png?v=1596700537", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue_0031_Layer-71.png?v=1596700537", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Blue_0012_Layer-29.png?v=1596700537", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Blue_0009_Layer-25.png?v=1596700537", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue_0033_Layer-68.png?v=1596700537", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue_0035_Layer-75.png?v=1596700537", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Blue_0011_Layer-30.png?v=1596700537", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Blue_0010_Layer-31.png?v=1596700537", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Blue_0013_Layer-27.png?v=1596700537"]},
{"productYear": "2003", "title": "Omega Museum Collection 1945 Chronograph", "productPrice": null, "productDescription": ["It is fair to say that Omega has been one of the pioneers of honoring their heritage and historical importance as a brand. While it is quite common and trendy these days for brands to dig into their archives to produce reissues, Omega has been doing this for a long time now. In fact, Omega has one of the easiest archival systems to access, with extracts easy to order, detailing information for all the watches (yes including vintage) ever produced. ", "The Omega Museum, in fact, opened in 1984 and is one of the oldest and largest watch museums dedicated to a single company with over 4000 pieces in the collection. As a result of their respect to their past, the Museum Series has long been a tradition, beginning in 2001 where each year Omega chooses an iconic model to pay homage and reissue. The one condition is that it has to be older than 50 years old.", "Sized at a respectable 37.5mm, it has no doubt vintage aesthetics to it. From its thick hour bezel with beautiful stylized fonts to the characteristically busy dial that features tachometer, telemeter, and pulsometer, it is quintessentially 40’s in its styling, fitted into a case with a more modern sizing. Multi-scale watches were in vogue during the era, with gilt black dials such as this being the norm. ", " This Omega Museum Collection 1945 Chronograph is a respectable tribute to a great watch and is in itself a collectible piece that is fantastic to wear."], "productCr": "This Omega Museum Collection 1945 Chronograph is in excellent condition. It comes without its original warranty card and hang tag and no box. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-1945-Museum-Collection-Front-Shot_0082_Layer-1.png?v=1596699909", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Collection-1945-Chronograph_0019_Layer-89.png?v=1596699909", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Collection-1945-Chronograph_0018_Layer-91.png?v=1596699909", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Chronograph-1945_0006_Layer-3.png?v=1596699909", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Collection-1945-Chronograph_0017_Layer-93.png?v=1596699909", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Chronograph-1945_0004_Layer-5.png?v=1596699909", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Collection-1945-Chronograph_0016_Layer-96.png?v=1596699909", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Chronograph-1945_0008_Layer-2.png?v=1596699909", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Chronograph-1945_0005_Layer-4.png?v=1596699909", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Chronograph-1945_0003_Layer-6.png?v=1596699909", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Chronograph-1945_0002_Layer-7.png?v=1596699909", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Chronograph-1945_0001_Layer-8.png?v=1596699909"]},
{"productYear": "2010", "title": "Cartier Tank CPCP Dual Time 2917", "productPrice": null, "productDescription": ["The name Cartier needs no introduction. As one of the most influential and celebrated jewelry and watch brands of the last 100 years, it has always stood as a mark of luxury and desirability. Without taking away from its historical significance, I would say that when it comes to watches, Cartier has always been predominantly known as a ‘design’ brand rather than a pure watchmaking one, with stunningly iconic models such as the Tank, the Crash, and the Santos- all seen as important due to how it looks. In fact, to this day, it is the beautiful and unconventional designs that attract collectors and a unique position in the watch brand hierarchy that no other possesses. ", "As I have mentioned many times, the ’90s was an unconventional and murky time for watch brands, having just come out of the quartz crisis that decimated most of the industry. Brands were either experimenting like crazy or strictly conservative, wary of the fact they just survived the equivalent of a nuclear bomb. The industry was slowly coming back, with consumers beginning to take an interest in mechanical watches, and with this in mind, Cartier decided that it was time to improve its image as a true watchmaking brand. ", "The result was the Collection Privé Cartier Paris division, referred to simply as the CPCP. The intention of the CPCP was to be the premier mechanical watchmaking division of Cartier and looking back on it today, it was one of the best decisions they ever made. The philosophy was simple, the CPCP took iconic models that were already loved by many, and reproduced them with high-grade movements, working with bonafide watch manufactures such as Piaget, Jaeger-LeCoultre, Frédéric Piguet, Girard-Perregaux, and more. ", "The easiest way to differentiate a CPCP watch was by the dial, with all but one model (Tank Cintrée) featuring a ‘Cartier Paris’ inscription- an ode to its heritage. The dials were always crafted from solid gold and often featured a strong hand-turned guilloche pattern with Cartier’s signature ‘rosette’ in the middle of the dial beneath the handset. ", "The example you see here today is an extremely rare Tank Two Time Zone Ref. 2917. It is a manually wound timepiece with a Piaget derived movement and features one of the more unusual layouts for a watch. With two clocks stacked together, the first position of the crown allows the user to independently jump the hour hand of the bottom clock, while the second position forwards the two clocks simultaneously. This is one of the easiest dual time watches as setting your local time only takes a few seconds. The 18k solid gold dial is classically Cartier with a beautiful guilloche pattern and not one but, two rosettes in underneath each handset! ", "The Tank is one of the most important watches in Cartier’s lineup and is named as such because, well, it looks like a tank from above. It was created in 1917 during World War I and the name was inspired by the new Renault tanks at the time. Since then, there have been countless iterations of the Tank, from sizes and complications, with the 2917 being one of the more unique ones. Whatever it may be though, the Tank will always be known as both a beautifully elegant and timeless watch and a piece of design that is historically important.", "The CPCP collection ran for 10 years between 1998 and 2008 and I can confidently say it is one of the most significant periods in Cartier’s history. It’s beautiful to see that Cartier was doing ‘reissues’ before it was even a thing and doing it the right way- respecting the past while producing something that is modern. Not only this, but the CPCP models were produced in truly limited numbers, with many having a designated run of 50 to 100 pieces. For those in the Collection Privé that weren’t strictly ‘limited’, it is estimated that only 250-300 pieces were made for each reference making any CPCP watch out there truly special. ", "Collectors are finally taking notice of this, and Cartier in general as a brand worth collecting. With more knowledge available now, the demand for Cartier has been huge and I only see it getting larger, especially for important references such as those from the CPCP line. "], "productCr": "The Cartier CPCP Tank Two Time Zone 2917 is in excellent condition. It comes as a full set with its original 18k white gold deployant clasp, correct Collection Privé red Cartier box, outer cardboard box, manual and guarantee certificate. It also comes with Japanese service papers from 2020. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-CPCP-Collection-Prive-Dual-Time-2917-2_0001_Layer-87.png?v=1606464223", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Dual-Time-CPCP-Collection-Prive-2917-2_0006_Layer-58.png?v=1606464226", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-CPCP-Collection-Prive-Dual-Time-2917-2_0003_Layer-85.png?v=1606464230", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Dual-Time-CPCP-Collection-Prive-2917-2_0007_Layer-56.png?v=1606464232", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Dual-Time-CPCP-Collection-Prive-2917-2_0005_Layer-59.png?v=1606464233", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-CPCP-Collection-Prive-Dual-Time-2917-2_0006_Layer-82.png?v=1606464235", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Dual-Time-CPCP-Collection-Prive-2917-2_0009_Layer-54.png?v=1606464237", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-CPCP-Collection-Prive-Dual-Time-2917-2_0004_Layer-84.png?v=1606464239", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-CPCP-Collection-Prive-Dual-Time-2917-2_0007_Layer-81.png?v=1606464241", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-CPCP-Collection-Prive-Dual-Time-2917-2_0002_Layer-86.png?v=1606464247", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Dual-Time-CPCP-Collection-Prive-2917-2_0008_Layer-55.png?v=1606464245", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-CPCP-Collection-Prive-Dual-Time-2917-2_0008_Layer-80.png?v=1606464244", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-CPCP-Collection-Prive-Dual-Time-2917-2_0005_Layer-83.png?v=1606464249", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Dual-Time-CPCP-Collection-Prive-2917-2_0001_Layer-63.png?v=1606464250", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Dual-Time-CPCP-Collection-Prive-2917-2_0002_Layer-62.png?v=1606464252", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Dual-Time-CPCP-Collection-Prive-2917-2_0003_Layer-61.png?v=1606464253", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Dual-Time-CPCP-Collection-Prive-2917-2_0004_Layer-60.png?v=1606464255", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Dual-Time-CPCP-Collection-Prive-2917-2_0010_Layer-52.png?v=1606464257", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Dual-Time-CPCP-Collection-Prive-2917-2_0011_Layer-51.png?v=1606464258"]},
{"productYear": "2017", "title": "F.P. Journe Centigraphe Souverain", "productPrice": null, "productDescription": ["Where to begin with F.P. Journe. Started by the man himself in 1999, Journe had previously spent quite a few years restoring and producing movements and also made a couple of pocket watches during that time. It took quite a few years before his brand went from something only a hardcore collector could appreciate to being appreciated by a more mainstream audience and today, he is considered by many as one of the most successful and important independent brands to have emerged.", "In my opinion, F.P. Journe has hit the sweet spot, producing around 900 pieces a year only. This ensures that they are exclusive enough that people consider any Journe a rare piece, but not so rare that it becomes esoteric. There are brands like Roger Smith and Philippe Dufour, both of who are considered godfathers of high horology, but they make so few pieces a year that the average watch collector would not know about them. Mention F.P. Journe though, and you’ll have collectors jumping with joy. ", "What you see here today is one of Journe’s most iconic models- the Centigraphe. Designed to time 1/100th of a second, you can already imagine how complicated this is going to get. There are pushers on the top right-hand side of the case to activate the chronograph, prompting the 10 o’clock sub-dial to start running. Watching this is something very special as you see the foudroyant (flying seconds) run and when you stop the chronograph it can stop anywhere on the sub-dial, allowing the user to record exactly to 1/100th of a second. The other two sub-dials act as a 20 second and 10 minute counter.", "Housed in a 40mm platinum case, there is definitely a nice heft to the watch. I think one of the main reasons why collectors love Journe is because of his signature case. It sits so thin and flat on the wrist and finishes off with lugs that step down and hugs your wrist. Once you strap it on, you’ll understand.", "F.P. Journe has carved a very interesting niche in the independent watch world where he has managed to blend traditional watchmaking and design cues with modern technology and an unmistakably Journe aesthetic. Despite using very traditional elements like his serif’d Arabic numerals, a knurled winding crown and a standard round case, the way it has been laid out combines to create a look that is F.P. Journe through and through. ", "The purists really love Journe because of his motto ‘Invenit et Fecit’, which translates from Latin to Invent and Create. To this day, F.P. Journe has stuck to this mantra, where he continues to invent his own in-house movements. Furthermore, everything else is also in-house, even to the point of owning his own case-maker and dial-maker. For a small brand that makes less than 1000 pieces a year, it is really impressive.", "Now, of course, timing to 1/100th of a second is not something we need in our lives, but just like art, it is the complexity and the ingenuity that we appreciate. After all, isn’t the wristwatch in itself an archaic tool? So why not, just go all out? It is for that reason, I think that the Centigraphe is one of the greatest watches that has come out of this century."], "productCr": "This F.P. Journe Centigraphe Souverain is in mint condition. It is in full working order and comes as a full set with its inner and outer box and warranty card. The chronograph is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-2_0053_Layer-120.png?v=1605170287", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-2_0056_Layer-6.png?v=1605170290", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-2_0049_Layer-123.png?v=1605170292", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-2_0060_Layer-2.png?v=1605170295", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-2_0050_Layer-122.png?v=1605170296", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-2_0061_Layer-1.png?v=1605170298", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-2_0051_Layer-121.png?v=1605170301", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-2_0052_Layer-118.png?v=1605170303", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-2_0054_Layer-119.png?v=1605170304", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-2_0058_Layer-4.png?v=1605170307", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-2_0057_Layer-5.png?v=1605170310", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-2_0059_Layer-3.png?v=1605170313"]},
{"productYear": "2017", "title": "Ming 17.01 Anthracite", "productPrice": null, "productDescription": ["Being an independent watch brand is no easy feat. Taking on the Swiss juggernauts in a time when the market is saturated with different watches and having the odds stacked against you is something most would run away from. I mean, it is clear- just look at the number of independent brands over the years that have come and gone, who just couldn’t make it and either sold out to a bigger brand or just vanish completely. ", "Established in 2017 in Kuala Lumpur, Malaysia, Ming Thein founded his eponymous brand with the intention to create a watch that satiated his obsessive desire for perfection while maintaining a price point that was fair and accessible. Being associated with the watch industry for many years through both his passion and his profession as a commercial photographer, he managed to build up a vast knowledge of watchmaking and design, culminating with what you see here today- the 17.01.", "The 17.01 was released in 2017 in anthracite and blue, with both having a limited run of 150 pieces. Sized in a 38mm Grade-5 Titanium case, this design has now become the signature look of MING. With short, outward curving lugs and a curved bar strap, the top of the case is polished while the sides are brushed, adding a nice depth to the overall look. ", "The dial, is a three-part construction that includes the central guilloché-like pattern, the outer, circular brushed periphery, and the now-famous sapphire donut rings that displays the numerals atop it all. With these combined, the dial has an amazing depth that varies in color depending on the lighting, displaying shades of grey all the way to a deep black. ", "The case is solidly constructed, offering a 100m water resistance with triple crown gaskets and is nitrogen-filled in order to slow down the deterioration of lubricants, enhancing reliability and longevity. The manually wound SW210-1 caliber is no slouch either. MING put it through a 250-hour testing program, adjust to 5 positions. ", "The beauty of MING is that somehow, they have managed to transcend a ‘pricing-based’ class system that has always been around in the watch industry. From an obscure, new brand on the block in 2017, today MING commands a huge legion of fans, from ultra-high-end collectors to your average guy who is just starting out. In fact, not only do MING watches sell for a premium in the used market (something that is pretty much unheard of with something like this), the last few releases have seen them sold out in record time, with the last 27.01 Ultra Slim selling out in under 10 minutes. ", "Furthermore, the 17.06 Copper managed to win the Horological Revelation Prize at the GPHG in 2019, a watch industry award that is akin to the Grammys. It was an amazing feat that truly solidified the MING brand as a true success and with this 17.01 Anthracite, it is worth mentioning that this bears the serial No. 3, making it the third watch ever made by the brand. It is a rare opportunity to purchase a collectible and unique watch, and also a true piece of MING history. "], "productCr": "This Ming 17.01 Anthracite is in excellent condition. It comes as a full set with its box and card, and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Anthracite-2-Front_0001_Layer-103.png?v=1606469873", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Anthracite-2_0019_Layer-47.png?v=1606469873", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Anthracite-2_0003_Layer-101.png?v=1606469873", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Anthracite-2_0021_Layer-43.png?v=1606469873", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Anthracite-2_0002_Layer-102.png?v=1606469873", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Anthracite-2_0022_Layer-38.png?v=1606469873", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Anthracite-2_0005_Layer-99.png?v=1606469873", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Anthracite-2_0006_Layer-98.png?v=1606469873", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Anthracite-2_0020_Layer-45.png?v=1606469873", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Anthracite-2_0023_Layer-37.png?v=1606469873", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Anthracite-2_0007_Layer-97.png?v=1606469873", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Anthracite-2_0018_Layer-49.png?v=1606469873", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.01-Anthracite-2_0004_Layer-100.png?v=1606469873"]},
{"productYear": "2020", "title": "Kurono Mori Hajime Asaoka", "productPrice": null, "productDescription": ["Founded in 2018 as a way for legendary Japanese watchmaker Hajime Asaoka to create serial production pieces, Kurono Tokyo stands as one of the most exciting microbrands in the market today. With his reputation as an exceptional watchmaker, Hajime Asaoka was famed for designing one-off timepieces in close collaboration with his clients. With demand growing, he decided to launch his own brand and create timepieces that would cater to those that wanted affordable watches that shared design language with his other once-off pieces.", "Following a year of operations, Kurono Tokyo released the Mori, an anniversary model, to celebrate. Originally limited to 50 units, the Mori sold out within a span of 5 minutes thanks to Kurono’s ever-growing popularity. Prompted by the almost-immediate sell-out, Kurono decided to keep the Mori online for another 10 minutes and generated another 238 units sold, for a total of 288. ", "Returning the brand to “a state of contemplation and restfulness”, as the brand says, the Mori avoids complexities and takes refuge in its stunningly understated dial. Furthermore, it features a 37mm high-polished case and domed sapphire crystal, mimicking vintage design and adding another layer of dimension to the dial. ", "Existing as a wonderfully unique and rare timepiece, the Mori is not a watch that appears for sale often and one that I am incredibly proud to have for sale. "], "productCr": "This Kurono Mori is in unworn condition. It comes as a full set with its box and papers.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Kurono-Mori_0030_Layer-115.png?v=1614326322", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Kurono-Mori_0042_Layer-24.png?v=1614326322", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Kurono-Mori_0044_Layer-20.png?v=1614326365", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Kurono-Mori_0047_Layer-14.png?v=1614326365", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Kurono-Mori_0029_Layer-117.png?v=1614326365", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Kurono-Mori_0028_Layer-118.png?v=1614326365", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Kurono-Mori_0045_Layer-19.png?v=1614326365", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Kurono-Mori_0043_Layer-23.png?v=1614326365", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Kurono-Mori_0046_Layer-17.png?v=1614326365", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Kurono-Mori_0031_Layer-116.png?v=1614326365", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Kurono-Mori_0033_Layer-113.png?v=1614326365", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Kurono-Mori_0032_Layer-114.png?v=1614326365"]},
{"productYear": "2005", "title": "Cartier Tortue Monopoussoir CPCP RG", "productPrice": null, "productDescription": ["The name Cartier needs no introduction. As one of the most influential and celebrated jewellery and watch brands of the last 100 years, it has always stood as a mark of luxury and desirability. Without taking away from its historical significance, I would say that when it comes to watches, Cartier has always been predominantly known as a ‘design’ brand rather than a pure watchmaking one, with stunningly iconic models such as the Tank, the Crash and the Santos all seen as important due to how it looks. In fact, to this day, it is the beautiful and unconventional designs that attract collectors and a unique position in the watch brand hierarchy that no other possesses. ", "As I have mentioned many times, the ’90s was an unconventional and murky time for watch brands, having just come out of the quartz crisis that decimated most of the industry. Brands were either experimenting like crazy or strictly conservative, wary of the fact they just survived the equivalent of a nuclear bomb. The industry was slowly coming back, with consumers beginning to take an interest in mechanical watches and with this in mind, Cartier decided that I was time to improve its image as a true watchmaking brand. ", "The result was the Collection Privé Cartier Paris division, referred to simply as the CPCP. The intention of the CPCP was to be the premier mechanical watchmaking division of Cartier and looking back on it today, it was one of the best decisions they ever made. The philosophy was simple, the CPCP took iconic models that were already loved by many, and reproduced them with high-grade movements, working with bonafide watch manufactures such as Piaget, Jaeger-LeCoultre, Frédéric Piguet, Girard-Perregaux and more. ", "The easiest way to differentiate a CPCP watch was by the dial, with all but one model (Tank Cintrée) featuring a ‘Cartier Paris’ inscription- an ode to its heritage. The dials were always crafted from solid gold and often featured a strong hand-turned guilloche pattern.", "The CPCP collection ran for 10 years between 1998 and 2008 and I can confidently say it is one of the most significant periods in Cartier’s history. It’s beautiful to see that Cartier was doing ‘reissues’ before it was even a thing and doing it the right way- respecting the past while producing something that is modern. Not only this, but the CPCP models were produced in truly limited numbers, with many having a designated run of 50 to 100 pieces. For those in the Collection Privé that weren’t strictly ‘limited’, it is estimated that only 250-300 pieces were made for each reference making any CPCP watch out there truly special. ", "Collectors are finally taking notice of this, and Cartier in general as a brand worth collecting. With more knowledge available now, the demand for Cartier has been huge and I only see it getting larger, especially for important references such as those from the CPCP line. "], "productCr": "This Cartier Tortue Monopoussoir is in excellent condition. It comes as a full set with its box, papers and original receipt. This watch is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-XL-CPCP-RG_0033_Layer-14.png?v=1612149200", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-XL-CPCP-Collection-Prive-RG_0009_Layer-44.png?v=1612149202", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-XL-CPCP-Collection-Prive-RG_0013_Layer-36.png?v=1612149204", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-XL-CPCP-RG_0032_Layer-16.png?v=1612149206", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-XL-CPCP-Collection-Prive-RG_0012_Layer-38.png?v=1612149207", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-XL-CPCP-RG_0030_Layer-18.png?v=1612149209", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-XL-CPCP-RG_0029_Layer-19.png?v=1612149211", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-XL-CPCP-RG_0028_Layer-20.png?v=1612149213", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-XL-CPCP-Collection-Prive-RG_0014_Layer-35.png?v=1612149214", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-XL-CPCP-Collection-Prive-RG_0015_Layer-33.png?v=1612149216", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-XL-CPCP-RG_0034_Layer-15.png?v=1612149218", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-XL-CPCP-Collection-Prive-RG_0008_Layer-45.png?v=1612149220", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-XL-CPCP-Collection-Prive-RG_0010_Layer-42.png?v=1612149221", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-XL-CPCP-Collection-Prive-RG_0011_Layer-41.png?v=1612149223", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-XL-CPCP-RG_0031_Layer-17.png?v=1612149225"]},
{"productYear": "1997", "title": "Cartier Tank Americaine Hong Kong LE 97", "productPrice": null, "productDescription": ["The name Cartier needs no introduction. As one of the most influential and celebrated jewelry and watch brands of the last 100 years, it has always stood as a mark of luxury and desirability. Without taking away from its historical significance, I would say that when it comes to watches, Cartier has always been predominantly known as a ‘design’ brand rather than a pure watchmaking one, with stunningly iconic models such as the Tank, the Crash, and the Santos all seen as important due to how it looks. In fact, to this day, it is the beautiful and unconventional designs that attract collectors and a unique position in the watch brand hierarchy that no other possesses. ", "While many of Cartier’s design dates back to the early 20th century, the Tank Americaine is a relatively new creation. Released in 1989 and intended to be a more accessible and masculine version of the flagship Tank Cintree, it was released as a normal and unspectacular quartz watch. The dimensions of the Tank Americaine were enlarged, swapping the Cintree’s elongated case for a thicker and wider watch with more presence. ", "It wasn’t until 1993 that Cartier released a mechanical version of the Americaine, and since then, this model has been a mainstay in the company’s model lineup. Many variations of the Cartier Tank Americaine has been released since then, with different sizes and dials, but one of the most peculiar and collectible versions is the example you see here today- the Cartier Tank Americaine Hong Kong Limited Edition, released in 1997 to celebrate Hong Kong’s handover from the British to China. ", "Cartier is famously known for being a design powerhouse and its enduring appeal is down to one reason. As Pierre Rainero, the Director of Image, Style & Heritage for Cartier said, it is because of their strong design fundamentals and their capacity to evolve and provide a sense of continuity. What started as a simple Tank watch has evolved to a multitude of equally iconic designs, from the Tank Basculante and the Tank Obus to the Tank Cintree and the Tank Americaine to name a few, Cartier has managed to transpose its original designs into a family of icons. While the Americaine is late to the party, it certainly has its place in Cartier’s rich heritage.", "With only 97 pieces produced, this Cartier Tank Americaine Hong Kong Limited Edition is extremely rare. With the recent resurgence of Cartier, collectors are increasingly looking to find rare references, with this watch being the perfect example. "], "productCr": "This Cartier Tank Americaine Hong Kong Limited Edition is in excellent condition. It comes as a watch only and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Salmon-Hong-Kong-Limited-Edition_0006_Layer-1.png?v=1612148858", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Salmon-Hong-Kong-Anniversary-97_0040_Layer-6.png?v=1612148860", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Salmon-Hong-Kong-Anniversary-97_0044_Layer-2.png?v=1612148861", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Salmon-Hong-Kong-Limited-Edition_0004_Layer-3.png?v=1612148863", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Salmon-Hong-Kong-Limited-Edition_0003_Layer-4.png?v=1612148873", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Salmon-Hong-Kong-Limited-Edition_0005_Layer-2.png?v=1612148875", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Salmon-Hong-Kong-Anniversary-97_0039_Layer-7.png?v=1612148877", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Salmon-Hong-Kong-Limited-Edition_0002_Layer-5.png?v=1612148879", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Salmon-Hong-Kong-Limited-Edition_0001_Layer-6.png?v=1612148881", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Salmon-Hong-Kong-Anniversary-97_0041_Layer-5.png?v=1612148882", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Salmon-Hog-Kong-97_0001_Layer-71.png?v=1612148884", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Salmon-Hong-Kong-Anniversary-97_0042_Layer-4.png?v=1612148886", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Salmon-Hong-Kong-Anniversary-97_0043_Layer-3.png?v=1612148887", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Salmon-Hong-Kong-Anniversary-97_0045_Layer-1.png?v=1612148889"]},
{"productYear": "2018", "title": "Ming 17.03 GMT Blue", "productPrice": null, "productDescription": ["Being an independent watch brand is no easy feat. Taking on the Swiss juggernauts in a time when the market is saturated with different watches and having the odds stacked against you is something most would run away from. I mean, it is clear- just look at the number of independent brands over the years that have come and gone, who just couldn’t make it and either sold out to a bigger brand, or just vanish completely. ", "That being said, if there was a shining light, a name that has defied the odds, through truly original thinking and an unwavering desire for quality, it would have to be MING. ", "Established in 2017 in Kuala Lumpur, Malaysia, Ming Thein founded his eponymous brand with the intention to create a watch that satiated his obsessive desire for perfection while maintaining a price point that was fair and accessible. Being associated with the watch industry for many years through both his passion and his profession as a commercial photographer, he managed to build up a vast knowledge of watchmaking and design, culminating with the release of the 17.01 in 2017. ", "The example you see here today, is what followed in the ’17’ series- the 17.03. Released in 2018, the 17.03 features a useful GMT function that is adjustable through the first position of the crown. Easy and quick to use, it is exactly what a travel watch should be.", "Sized in a 38mm Grade-2 Titanium case, this design has now become the signature look of MING. With flared lugs and a curved bar strap, the completely brushed case really combines with the blue of the dial to create a seriously photogenic watch.", "The dial is a three-part construction that includes the central sunburst pattern with its GMT indicator, an outer peripheral ring with concentric rings, and the now-famous sapphire donut rings that are filled with luminoiva and display the numerals atop it all. With these combined, the dial has an amazing depth that varies in color depending on the lighting, and the tones of blues vary also based on the different finishing. ", "The beauty of MING is that somehow, they have managed to transcend a ‘pricing-based’ class system that has always been around in the watch industry. From an obscure, new brand on the block in 2017, today MING commands a huge legion of fans, from ultra-high-end collectors to your average guy who is just starting out. In fact, not only do MING watches sell for a premium in the used market (something that is pretty much unheard of with something like this), the last few releases have seen them sold out in record time, with the last 27.01 Ultra Slim selling out in under 10 minutes. ", "Furthermore, the 17.06 Copper managed to win the Horological Revelation Prize at the GPHG in 2019, a watch industry award that is akin to the Grammys. It was an amazing feat that truly solidified the MING brand as a true success and one that is here to last."], "productCr": "This Ming 17.03 GMT Blue is in excellent condition. It comes as a full set with its box and card and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue-2_0008_Layer-110.png?v=1606466605", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue-2_0029_Layer-35.png?v=1606466607", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue-2_0025_Layer-46.png?v=1606466609", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue-2_0026_Layer-44.png?v=1606466612", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue-2_0012_Layer-106.png?v=1606466614", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue-2_0028_Layer-40.png?v=1606466616", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue-2_0024_Layer-48.png?v=1606466619", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue-2_0009_Layer-109.png?v=1606466623", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue-2_0027_Layer-41.png?v=1606466621", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue-2_0011_Layer-107.png?v=1606466628", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue-2_0010_Layer-108.png?v=1606466611", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue-2_0013_Layer-105.png?v=1606466625", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue-2_0014_Layer-104.png?v=1606466627", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-GMT-Blue-2_0030_Layer-34.png?v=1606466630"]},
{"productYear": "2021", "title": "Omega Speedmaster Silver Snoopy Award 50th Anniversary", "productPrice": null, "productDescription": ["Initially released in 1957 as a race timing tool watch, the Omega Speedmaster is one of the most iconic modern chronograph timepieces ever made- not thanks to what it was made for but instead because of its historically important use in space and on the moon. ", "Three years before the Speedmaster's eventual qualification for spaceflight, numerous brands submitted their best watches to NASA in 1962, including the eventual contract winners - Omega. Following a long list of gruelling tests, the Speedmaster was selected in 1965 to be NASA's standard-issue space-faring timepiece and the rest, as they say, is history.", "Omega has always had a relationship with space and also with the Snoopy character. While these Snoopy pieces have always been popular, with two iterations before the current example you see, not many know the historical context that underpins these iconic watches. ", "With Snoopy being a longtime mascot for NASA, the Silver Snoopy Award is a special honour given to individuals in and associated with NASA for outstanding achievements in space flight. ", " ", "Paying homage to the illustrious award with Snoopy in its 9 o'clock subdial, the 50th Anniversary Snoopy Speedmaster is perhaps the most distinctive of the three-anniversary models. With a dial made of silver, in reference to the Snoopy award, the hands and indices create a stark contrast to the dial thanks to their intense blue PVD coating. Continuing with this blue and silver theme, the subdials, bezel and nylon fabric are also the same blue colour as the hands and indices. While the watch looks stunning from the front, the real surprise comes when you flip the watch over.", "It features a depiction of the Moon, Earth, and a white Command and Service Module (CSM) with Snoopy riding along inside. With Snoopy's CSM moving across the case back when the chronograph is engaged, Omega's innovative attention to detail is refreshing. Travelling around the far side of the Moon, Omega makes a direct reference to the trip the Apollo 13 astronauts were forced to take all those years ago. In addition to this, the Earth itself spins once per minute as it is connected to the seconds hand subdial, providing a nice subtle visual touch.", "Powered by the modern moon watch movement, the manual-wind cal. 3861, this timepiece comes housed in an incredible Apollo 13 presentation box. A slimmed-down version of the large Moonwatch box, it features a Snoopy patch on top and an image of Snoopy on his dog house within. Supplied with a loupe, a pouch, and a soft cloth, this is as full a set as a timepiece can be.", "Today, while the Silver Snoopy Award 50th Anniversary Speedmaster is not a limited edition, it is produced in extremely low numbers that rival the Rolex Daytona and is perhaps the most in-demand piece from Omega today. Only existing clients with a sizeable previous purchase are entitled to be allocated a piece."], "productCr": "This Omega Speedmaster Silver Snoopy Award 50th Anniversary is brand new with stickers still attached. It is in full working order and still under Omega’s warranty.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Silver-Snoopy-Award-50th-Anniversary_0020_Layer-73.png?v=1620645533", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Silver-Snoopy-Award-50th-Anniversary_0003_Layer-15.png?v=1620645533", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Silver-Snoopy-Award-50th-Anniversary_0005_Layer-8.png?v=1620645533", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Silver-Snoopy-Award-50th-Anniversary_0021_Layer-74.png?v=1620645533", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Silver-Snoopy-Award-50th-Anniversary_0086_Layer-17.png?v=1620645533", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Silver-Snoopy-Award-50th-Anniversary_0006_Layer-7.png?v=1620645533", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Silver-Snoopy-Award-50th-Anniversary_0001_Layer-18.png?v=1620645533", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Silver-Snoopy-Award-50th-Anniversary_0023_Layer-71.png?v=1620645533", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Silver-Snoopy-Award-50th-Anniversary_0022_Layer-72.png?v=1620645533", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Silver-Snoopy-Award-50th-Anniversary_0019_Layer-75.png?v=1620645533", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Silver-Snoopy-Award-50th-Anniversary_0018_Layer-76.png?v=1620645533", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Silver-Snoopy-Award-50th-Anniversary_0017_Layer-77.png?v=1620645533", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Silver-Snoopy-Award-50th-Anniversary_0004_Layer-12.png?v=1620645533"]},
{"productYear": "1998", "title": "Roger Dubuis Sympathie 34", "productPrice": null, "productDescription": ["For a long time, the Roger Dubuis name was thought to be over and irrelevant to collectors. With Dubuis watches of today having garish designs and proportions that are all wrong, it is no wonder why. The truth is, Roger Dubuis, the man, left the company in 2005 and while he was undoubtedly a brilliant watchmaker, he lacked business expertise.", "It is this, and not his watchmaking skills, that caused the brand to be what it is today- devoid of emotion and controlled by business executives with no passion. You see, underneath this sheath of failure lies some of the most beautiful watches ever made. Early Roger Dubuis watches are nothing like what they are today- elegant in their design and finished to the highest standards, these watches rivaled and even bettered contemporaries such as Patek Philippe and Audemars Piguet. In fact, collectors have finally started to realize this and as a result, prices have been skyrocketing. ", "An independent brand with aspiration, I have no doubt that today’s indies have Dubuis and other pioneers of his time to thank for laying out the groundwork. Roger Dubuis formed his eponymous brand in 1995 after two decades at Patek Philippe and at the time, it not only took huge courage to start an independent brand but Dubuis had to also operate in an area that wasn’t as mainstream as it is today.", "There were two main lines that Dubuis produced- the Homage series, which were more traditional round cased watches, and what you see here today- the Sympathie series. Featuring a more experimental case design, this is the most iconic Dubuis shape with an amorphous and angular shape.", "Constructed of 18kt rose gold, the Sympathie’s 34mm case is a feast for the eyes. Featuring a vertical satin grain on the caseband and lug profiles with a contrasting high polish on the bezel, thick fixing screws, and lug hoods, the Sympathie is a finely executed timepiece with appreciable attention to detail. ", "Aside from its case, the Sympathie’s dial also stands out as a unique piece of design. This variant is one of the rarest examples of Sympathie dials and it features exploding Arabic numerals atop a black glossy dial. ", "Powered by the automatic Roger Dubuis Cal. RD57, the Sympathie is as elegantly equipped within its case, as it is visually appealing from the outside. On display behind its sapphire crystal caseback, the RD57 is a finely finished piece of horology including black polished screws and swan's neck regulator, gorgeous côtes de Geneve motif, and mirrored chamfering throughout. As referenced by the dial signature \"Bulletin D'Observatoire\", a Besançon Observatory chronometer certificate from the French capital of watchmaking certifies the accuracy of this movement and goes to substantiate the level of quality on display by these early Roger Dubuis timepieces."], "productCr": "This Roger Dubuis Sympathie 34 is in excellent condition. It comes as a full set with its original box and guarantee papers, a second solid gold case back, and also its Geneva Seal papers and Besancon Observatory Certificate. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-34-Black_0021_Layer-27.png?v=1612150546", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-34-RG-Time-Only_0002_Layer-40.png?v=1612150596", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-34-RG-Time-Only_0003_Layer-39.png?v=1612150596", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-34-RG-Time-Only_0001_Layer-46.png?v=1612150596", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-34-RG-Time-Only_0007_Layer-31.png?v=1612150596", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-34-Black_0025_Layer-23.png?v=1612150596", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-34-RG-Time-Only_0006_Layer-32.png?v=1612150596", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-34-Black_0023_Layer-25.png?v=1612150596", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-34-RG-Time-Only_0005_Layer-34.png?v=1612150596", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-34-Black_0022_Layer-26.png?v=1612150596", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-34-Black_0024_Layer-24.png?v=1612150596", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-34-RG-Time-Only_0004_Layer-37.png?v=1612150596", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-34-Black_0026_Layer-22.png?v=1612150596", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-34-Black_0027_Layer-21.png?v=1612150596"]},
{"productYear": "2018", "title": "Ming 17.03 GMT Ultra Blue LE 25", "productPrice": null, "productDescription": ["Being an independent watch brand is no easy feat. Taking on the Swiss juggernauts in a time when the market is saturated with different watches and having the odds stacked against you is something most would run away from. I mean, it is clear- just look at the number of independent brands over the years that have come and gone, who just couldn’t make it and either sold out to a bigger brand or just vanish completely. ", "That being said, if there was a shining light, a name that has defied the odds, through truly original thinking and an unwavering desire for quality, it would have to be MING. ", "Established in 2017 in Kuala Lumpur, Malaysia, Ming Thein founded his eponymous brand with the intention to create a watch that satiated his obsessive desire for perfection while maintaining a price point that was fair and accessible. Being associated with the watch industry for many years through both his passion and his profession as a commercial photographer, he managed to build up a vast knowledge on watchmaking and design, culminating with the release of the 17.01 in 2017. ", "The 17.03 was released in 2018 following the 17.01 and features a useful GMT function that is adjustable through the first position of the crown. Easy and quick to use, it is exactly what a travel watch should be.", "While all Ming’s are hugely collectible today, this 17.03 is particularly special as it was produced in a limited edition of 25 pieces to celebrate the anniversary of the brand. Named the ‘Ultra Blue’ for obvious reasons, each case was individually heat blued in-house by the brand’s founder, Ming Thein.", "As a result, the case is beautifully enigmatic, throwing off tones of purple, cyan, and a multitude of other blues, depending on the lighting. ", "Moving on, the dial is a three part construction that includes the central sunburst pattern with its GMT indicator, an outer peripheral ring with concentric rings, and the now-famous sapphire donut rings that are filled with luminova and display the numerals atop it all. ", "The heat blued case and that beautiful deep blue dial combine perfectly to create a very special and unique watch. It is a fitting tribute to a young brand that has become incredibly popular and continues to grow. "], "productCr": "This Ming 17.03 GMT Ultra Blue is in excellent condition. It comes as a full set with its box and card, and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-GMT-Ultra-Blue-1_0060_Layer-122.png?v=1608253545", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Ultra-Blue_0046_Layer-45.png?v=1608253474", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Ultra-Blue_0042_Layer-81.png?v=1608253474", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Ultra-Blue_0028_Layer-118.png?v=1608253474", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Ultra-Blue_0045_Layer-46.png?v=1608253474", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Ultra-Blue_0041_Layer-83.png?v=1608253474", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Ultra-Blue_0025_Layer-121.png?v=1608253474", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Ultra-Blue_0026_Layer-120.png?v=1608253474", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Ultra-Blue_0044_Layer-47.png?v=1608253474", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Ultra-Blue_0027_Layer-119.png?v=1608253474", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Ultra-Blue_0048_Layer-43.png?v=1608253474", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Ultra-Blue_0029_Layer-117.png?v=1608253474", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Ultra-Blue_0030_Layer-116.png?v=1608253474", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Ultra-Blue_0043_Layer-79.png?v=1608253474", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.03-Ultra-Blue_0047_Layer-44.png?v=1608253474"]},
{"productYear": "2019", "title": "Audemars Piguet Royal Oak 15500 Rose Gold", "productPrice": null, "productDescription": ["Watch collectors often squabble about who the best watchmaker is and what the best looking watch is – its only natural. While both of these questions are rather subjective in their nature, there is one watch from a particular brand that demands the respect of every watch enthusiast out there, whether they like it or not. That watch is none other than the Audemars Piguet Royal Oak. Released in 1972, during the height of the Quartz Crisis, the Royal Oak was Audemars Piguet's Hail Mary attempt to save themselves from financial destitution. ", "With sales plummeting and brands falling to their knees, the writing was on the wall for Audemars Piguet, famed for their ultra-luxurious dress watches. Not content to go down fighting, however, AP executives enlisted the help of watch designer Gerald Genta to create a luxury steel sports watch, a first of its kind, in response to some market research AP had carried out in Italy. There was a slight problem; however, the launch of this watch was going ahead the next day.", "Sparing no time, Genta designed the Royal Oak after finding inspiration from an antique divers helmet and completed the sketch by the following morning. The Royal Oak, characterized by its octagonal bezel, exposed screws, unusual integrated bracelet, and exposed rubber gasket wasn't the immediate sales hit AP had hoped for. ", "The modern Royal Oak, the ref. 15500, was released in 2019 to replace the outgoing ref. 15400. Weighing in at a contemporary 41mm, the ref. 15500 balances Genta's famous design choices with everything a watch needs to be in today's day and age; sizeable yet elegant, thin yet robust, and above all else – extremely well made. Offered in 5 variants, here I have the pink gold variant mounted onto a black alligator leather strap held closed by a pink gold deployant clasp. The warm hue of the pink gold is ever so elegantly enhanced by the black Grande Tapisserie dial for which AP is famous for. While it enhances the metal, the dial is also successful in toning down the ref. 15500's footprint and maintaining its true luxury aesthetic. "], "productCr": "This Audemars Piguet Royal Oak 15500OR is brand new and unused. It remains wrapped in plastic and comes as a full set with its inner and outer box, guarantee card and manual folder. This watch is in full working order and is still under AP’s warranty.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15500OR_0034_Layer-96.png?v=1605169691", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15500OR_0022_Layer-40.png?v=1605169694", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15500OR_0035_Layer-95.png?v=1605169698", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15500OR_0016_Layer-53.png?v=1605169706", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15500OR_0038_Layer-92.png?v=1605169708", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15500OR_0023_Layer-39.png?v=1605169710", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15500OR_0017_Layer-50.png?v=1605169713", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15500OR_0036_Layer-94.png?v=1605169717", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15500OR_0039_Layer-91.png?v=1605169719", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15500OR_0021_Layer-41.png?v=1605169721", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15500OR_0040_Layer-90.png?v=1605169723", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15500OR_0020_Layer-42.png?v=1605169726", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15500OR_0037_Layer-93.png?v=1605169728", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15500OR_0018_Layer-49.png?v=1605169730", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15500OR_0019_Layer-43.png?v=1605169732"]},
{"productYear": "2020", "title": "De Bethune DB25 Starry Varius", "productPrice": null, "productDescription": [], "productCr": "This De Bethune DB25 Starry Varius is brand new and unusued. It comes as a full set and is still under its factory warranty.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/De-Bethune-DB25-Starry-Varius_0006_Layer-47.png?v=1619764789", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/DeBethune-DB25-Starryvarius_0018_Layer-42.png?v=1619764790", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/DeBethune-DB25-Starryvarius_0016_Layer-44.png?v=1619764792", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/DeBethune-DB25-Starryvarius_0011_Layer-55.png?v=1619764794", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/DeBethune-DB25-Starryvarius_0014_Layer-49.png?v=1619764795", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/DeBethune-DB25-Starryvarius_0019_Layer-41.png?v=1619764797", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/De-Bethune-DB25-Starry-Varius_0004_Layer-49.png?v=1619764799", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/De-Bethune-DB25-Starry-Varius_0005_Layer-50.png?v=1619764801", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/DeBethune-DB25-Starryvarius_0013_Layer-50.png?v=1619764803", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/De-Bethune-DB25-Starry-Varius_0007_Layer-48.png?v=1619764805", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/DeBethune-DB25-Starryvarius_0017_Layer-43.png?v=1619764806", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/De-Bethune-DB25-Starry-Varius_0002_Layer-52.png?v=1619764808", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/De-Bethune-DB25-Starry-Varius_0001_Layer-53.png?v=1619764810", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/DeBethune-DB25-Starryvarius_0020_Layer-40.png?v=1619764812", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/DeBethune-DB25-Starryvarius_0010_Layer-56.png?v=1619764813", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/DeBethune-DB25-Starryvarius_0015_Layer-45.png?v=1619764815", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/DeBethune-DB25-Starryvarius_0012_Layer-51.png?v=1619764817", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/De-Bethune-DB25-Starry-Varius_0003_Layer-51.png?v=1619764820"]},
{"productYear": "2020", "title": "Rolex Oyster Perpetual 36 126000 Blue", "productPrice": null, "productDescription": ["Providing the foundation upon which every other sports Rolex watch is built, the Oyster Perpetual collection has evolved from a relatively obscure offering to one of the most popular collections on the market today. Dating back to 1931, the Oyster Perpetual's history is filled with the epic feats of its wearers, like conquering Everest and setting land speed records. No doubt an iconic timepiece, when Rolex revitalized the collection in September of 2020, the Oyster Perpetual burst back onto the scene and joined the ranks of Rolex's other sports models as some of the most in-demand timepieces imaginable.", "Here I have a 36mm Oyster Perpetual ref. 126000 hailing from the latest version of the collection. Featuring Rolex's tried and tested bright blue dial, this ref. 126000 features all of the necessary design motifs to excel in today's market. With its iconic oyster bracelet, domed stainless steel bezel, and clean time only design, the ref. 126000 with this electric blue dial exists as the perfect unisex option with its sporty design and unrivaled wearability and comfort on the wrist.", "Amongst the changes from the previous collection, the latest Oyster Perpetuals feature an upgraded movement with an improved 70-hour power reserve. The automatic cal. 3230 movement offers COSC and Rolex's own in-house Superlative Chronometer testing, which enables it to run at +/- 2 seconds per day. While the Oyster Perpetual might be marketed as an entry-level collection, its internals cut no corners, just like its iconic design and incredible history. Furthermore, I’d say that while the Submariner and GMT-Master have somewhat gone on to become more of a luxury statement, the Oyster Perpetual remains true to Rolex’s roots as a ‘tool watch’ with no superfluousness above all else."], "productCr": "This Rolex Oyster Perpetual 36 126000 is in mint condition. It comes with stickers still attached to its sides and back and comes as a full set with its box and warranty. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Oyster-Perpetual-36-126000-Blue_0015_Layer-78.png?v=1620642141", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Oyster-Perpetual-36-126000-Blue_0004_Layer-29.png?v=1620642143", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Oyster-Perpetual-36-126000-Blue_0001_Layer-37.png?v=1620642145", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Oyster-Perpetual-36-126000-Blue_0014_Layer-80.png?v=1620642147", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Oyster-Perpetual-36-126000-Blue_0002_Layer-34.png?v=1620642149", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Oyster-Perpetual-36-126000-Blue_0012_Layer-82.png?v=1620642151", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Oyster-Perpetual-36-126000-Blue_0003_Layer-31.png?v=1620642152", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Oyster-Perpetual-36-126000-Blue_0016_Layer-79.png?v=1620642154", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Oyster-Perpetual-36-126000-Blue_0013_Layer-81.png?v=1620642156", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Oyster-Perpetual-36-126000-Blue_0011_Layer-83.png?v=1620642158", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Oyster-Perpetual-36-126000-Blue_0010_Layer-84.png?v=1620642160"]},
{"productYear": "2020", "title": "Ulysse Nardin Freak Out Blue", "productPrice": null, "productDescription": ["In an industry that hasn’t changed a whole lot in the last 100 years, originality has always been the elephant in the room when it comes to wristwatch design. I mean, after all, how different can a watch be, with such confined parameters? Well World, meet the Freak. "], "productCr": "This Ulysse Nardin Freak Out Blue is in unused condition. It comes as a full set with its box and papers and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ulysse-Nardin-Freak-Out-Blue_0005_Layer-8.png?v=1619762216", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ulysse-Nardin-Freak-Out-Blue_0003_Layer-54.png?v=1619762226", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ulysse-Nardin-Freak-Out-Blue_0008_Layer-39.png?v=1619762228", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ulysse-Nardin-Freak-Out-Blue_0003_Layer-10.png?v=1619762230", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ulysse-Nardin-Freak-Out-Blue_0001_Layer-58.png?v=1619762231", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ulysse-Nardin-Freak-Out-Blue_0006_Layer-47.png?v=1619762233", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ulysse-Nardin-Freak-Out-Blue_0004_Layer-9.png?v=1619762235", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ulysse-Nardin-Freak-Out-Blue_0009_Layer-52.png?v=1619762236", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ulysse-Nardin-Freak-Out-Blue_0004_Layer-53.png?v=1619762238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ulysse-Nardin-Freak-Out-Blue_0006_Layer-31.png?v=1619762239", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ulysse-Nardin-Freak-Out-Blue_0007_Layer-46.png?v=1619762241", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ulysse-Nardin-Freak-Out-Blue_0001_Layer-12.png?v=1619762243", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ulysse-Nardin-Freak-Out-Blue_0002_Layer-11.png?v=1619762245", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ulysse-Nardin-Freak-Out-Blue_0005_Layer-48.png?v=1619762246", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ulysse-Nardin-Freak-Out-Blue_0002_Layer-57.png?v=1619762248"]}
]