[
{"productYear": "2006", "title": "Patek Philippe Aquanaut 5065A", "productPrice": null, "productDescription": ["The Patek Philippe Aquanaut needs no introduction. Despite being an entry-level sports model, it is one of the most desired and hardest to get watch from the Patek Philippe boutique today. While the current, time-only Ref. 5167A is the Aquanaut that we all know and love, discerning collectors are quietly looking back to the ’90s to buy the original Aquanaut- the 5065A. ", "Launched in 1997 to attract a younger crowd, the 5065A was priced as an entry-level Patek Philippe made in stainless steel and equipped with a rubber strap. Marketed as a luxury sport watch and as a younger sibling to the Nautilus, it was not exactly loved when it was first released as it was seen as blasphemous to the identity of Patek Philippe. With that being said, any big change always comes with its opposition, and the 5065A being the first-ever Patek to sport a rubber strap, it was no different.", "Well, we all know how this story plays out. With an appreciation for sports watches, today the Aquanaut is seen much differently, with the original 5065, in particular, being one of the must-haves for any discerning Patek collector. This is because, with any historically important watch, the genesis is always seen as a reference point and something worth collecting. ", "The Patek Philippe 5065A is a simple watch, sized at 38mm, it wears much more like a vintage piece than the current version and sports the newly nicknamed ‘grenade’ dial due to its distinct large-sized guilloche at the center of the dial. This motif carries on through to the strap, with its rectangular embossing complementing the overall design identity.", "This Aquanaut comes fitted on an army green rubber strap that really adds to its vintage sports look. Furthermore, this particular example comes as a true full set, with all of its boxes and accessories. The 5065A is without a doubt a huge milestone in the history of Patek Philippe and one that will always be collectible."], "productCr": "This Patek Philippe Aquanaut 5065A is in excellent condition. It comes as a full set with its inner and outer box, leather folder with its original papers, brochure and manual. It is in full working order and comes fitted on a brand new, uncut green rubber strap.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5065A-Aquanaut-Full-Set_0013_Layer-40.png?v=1600090574", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5065A_0056_Layer-77.png?v=1600090577", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5065A-Aquanaut-Full-Set_0012_Layer-42.png?v=1600090579", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5065A_0057_Layer-76.png?v=1600090581", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5065A_0055_Layer-78.png?v=1600090584", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5065A_0060_Layer-73.png?v=1600090587", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5065A-Aquanaut-Full-Set_0014_Layer-41.png?v=1600090590", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5065A-Aquanaut-Full-Set_0010_Layer-44.png?v=1600090592", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5065A_0054_Layer-79.png?v=1600090595", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5065A_0059_Layer-74.png?v=1600090597", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5065A_0058_Layer-75.png?v=1600090599", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5065A-Aquanaut-Full-Set_0011_Layer-43.png?v=1600090601"]},
{"productYear": "2000's", "title": "A. Lange & Sohne Lange 1 Moon 109.021", "productPrice": null, "productDescription": ["When thinking of the real heavyweights in haute horlogerie, only a few big names come to mind- Patek Philippe, Vacheron Constantin, Audemars Piguet and of course, the Germans next door, A. Lange & Sohne. While many see Swiss watches as the pinnacle of watchmaking, Lange serves as a reminder that this isn’t always the case. In fact, one can say that in some areas, Lange is considered much better than its Swiss counterparts. ", "The Lange 1 would certainly have to be the brand’s most iconic model. Made famous by its unusual dial layout, the Lange one is immediately recognizable by its signature large date aperture, along with the clock often aligned to the left and within a sub-dial. Made since the brand’s rebirth, the Lange 1 has seen many iterations with different complications but always maintaining the same unmistakable aesthetic. The example here you see is an early Lange 1 that features an added moon phase. ", "This Lange 1 Moon is powered by an in-house manually wound caliber L905.1 and is another trademark of the Lange 1 family. With its movement made out of German Silver, the three quarter plate design is iconic to the Lange 1 and is perfectly finished off with a hand-engraved balance cock. ", "The seemingly white dial actually has a more straw-colored tone to it. It is very subtle but when combined with the yellow gold case, it really blends together well and gives off excellent warm tones. This is contrasted with the bright blue moon phase and overall this Lange 1 Moon could be the platonic ideal of what a dress watch should be. ALS really gets details right and with this watch, it is no exception. "], "productCr": "This A. Lange & Sohne Lange 1 Moon 109.021 is in excellent condition. It is in full working order and comes as a watch only, fitted on an original ALS brown crocodile strap and matching yellow gold tang buckle.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Lange-1-38mm-Yellow-Gold_0010_Layer-54.png?v=1592300454", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Lange-1-Moon-YG_0006_Layer-77.png?v=1592300491", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Lange-1-Moon-YG_0007_Layer-74.png?v=1592300491", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Lange-1-38mm-Yellow-Gold_0012_Layer-52.png?v=1592300491", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Lange-1-38mm-Yellow-Gold_0014_Layer-50.png?v=1592300491", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Lange-1-Moon-YG_0000s_0000_Layer-75.png?v=1592300491", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Lange-1-38mm-Yellow-Gold_0011_Layer-53.png?v=1592300491", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Lange-1-Moon-YG_0008_Layer-73.png?v=1592300491", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Lange-1-38mm-Yellow-Gold_0015_Layer-49.png?v=1592300491", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Lange-1-Moon-YG_0010_Layer-71.png?v=1592300491", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Lange-1-38mm-Yellow-Gold_0016_Layer-48.png?v=1592300491", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Lange-1-38mm-Yellow-Gold_0013_Layer-51.png?v=1592300491", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Lange-1-38mm-Yellow-Gold_0017_Layer-47.png?v=1592300490", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Lange-1-Moon-YG_0009_Layer-72.png?v=1592300490", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Lange-1-Moon-YG_0011_Layer-76.png?v=1592300455"]},
{"productYear": "2009", "title": "Audemars Piguet Royal Oak Offshore Diver 15703", "productPrice": null, "productDescription": ["The brand name Audemars Piguet and the model name Royal Oak go hand in hand and without a doubt, the Royal Oak has been AP’s most popular watch. With its masculine octagonal case, exposed screws and integrated bracelet is one of the most distinctive watches in the market today. It is imposing and recognizable, and in my opinion, one of the best statement watches money can buy. ", "The Royal Oak is not only famous for what it looks like, but also how it was introduced. First released in the ’70s, the original Ref. 5402 was a bold stainless steel watch designed by Gerald Genta that created shockwaves because it was priced the same as a solid gold watch. People just could not accept that a pedestrian material such as steel could be priced so exorbitantly and consequently, it was not very popular. It was only after time that the public saw this as something genuinely original and avant-garde- fast forward to the 21st century, and the Royal Oak is an icon. ", "Riding on this wave, the Royal Oak reincarnated in 1993 as Audemars Piguet introduced a whole new variant of the model- the Royal Oak Offshore. Nicknamed ‘The Beast’ is was basically a Royal Oak on steroids and with watch sizing getting larger and larger, it was an instant hit. ", "Since then, there have been many iterations of the Offshores and while most of them were equipped with chronographs, in 2010, Audemars Piguet finally released a time-only Offshore, dubbed the Diver. The Ref. 15703 was in some sense long-awaited, as the purity of a time only dive watch with a countdown inner rotating bezel made sense. "], "productCr": "This Audemars Piguet Royal Oak Offshore Diver 15703 is in good used condition. It has some scratches from previous use that is visible in the photography. It comes as a full set with its inner and outer box, guarantee and instruction manual.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakDiver15703ST_0016_Layer33.jpg?v=1585057781", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakOffshoreDiver15407Creratives_0025_Layer5.jpg?v=1585057809", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakDiver15703ST_0018_Layer31.jpg?v=1585057809", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakOffshoreDiver15407Creratives_0023_Layer7.jpg?v=1585057809", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakOffshoreDiver15407Creratives_0026_Layer4.jpg?v=1585057809", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakDiver15703ST_0019_Layer30.jpg?v=1585057809", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakOffshoreDiver15407Creratives_0024_Layer6.jpg?v=1585057809", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakDiver15703ST_0021_Layer28.jpg?v=1585057809", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakDiver15703ST_0020_Layer29.jpg?v=1585057809", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/AudemarsPiguetRoyalOakDiver15703ST_0017_Layer32.jpg?v=1585057781"]},
{"productYear": "2019", "title": "Tudor Black Bay Harrods Edition", "productPrice": null, "productDescription": ["The Tudor Black Bay is an iconic model for Tudor. It was the line that revived the Tudor name when it was first released back in 2012. When it was released and ever since then, it has struck a chord with collectors and it has consistently been seen as one of the best value watches in the market. The Black Bay was a reinterpretation of Tudor’s rich dive watch history and the brand drew upon design cues from their early Submariners in the 20th century, including the iconic ‘Snowflake’ hands, the ‘Big Crown’ no crown guard stainless steel case and the stainless steel riveted bracelet. With its vintage roots and that famous Rolex quality at such an attractive price point, it is hard not to love the Black Bay. ", "After quite a few years of production, there is now a whole range of Black Bays varying in colours and case material. That being said, my favourite would certainly have to be this version. This Black Bay was made in collaboration with the famous British department store, Harrods and is sold exclusively through the Harrods Fine Watch Room. While I am always sceptical of brands releasing new models with colour changes as the only difference, this one would have to be the exception for me. The Harrods Black Bay comes with a never before seen green bezel, which is the same iconic green that has represented Harrods ever since its inception and green accents in its depth rating and the tip of the seconds hand. The chapter ring, logo and chronometer rating is all in gilt alongside the gold hour marker surrounds, which is also a nice nod to the gold font of the Harrods logo. Another nice touch is the reversal of the depth rating, where Tudor put the feet first (660ft/200m) as a tribute to the ‘Britishness’ of Harrods. ", "While this is not strictly a limited edition as Tudor doesn’t do limiteds, there is a huge waitlist and Tudor aren’t making many of these. I have heard of clients waiting well over a year for their piece and the demand is out there. The green bezel is reminiscent of the Rolex ‘Kermit’ Submariner with its similar green bezel and I would certainly consider this the ‘Baby Kermit’. ", "For a long time, Tudor has been seen as the ‘Poor Man’s Rolex’ as when they were first created, their philosophy was to use Rolex cases and outsourced movements to save on cost. The old Tudor Submariners used ETA movements and for awhile the Black Bay did too. Now though, this Black Bay is powered by an in-house self-winding calibre MT5602, housed in a 41mm stainless steel bevelled case and takes on its own design cues without having to follow its big brother. Today, Tudor is seen as a brand that stands on its own two feet and has cemented itself as a powerful brand in its own right. "], "productCr": "This Tudor Black Bay Harrods Edition is brand new, unsized and with side stickers in tact. It comes as a full set, with its inner and outer box, guarantee booklet, dated international guarantee card, instruction manual, a full length stainless steel Tudor bracelet and a spare NATO strap.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Harrods-3_0020_Layer-39.png?v=1600073712", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Harrods-Black-Bay-3_0015_Layer-90.png?v=1600073712", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Harrods-3_0018_Layer-40.png?v=1600073712", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Harrods-Black-Bay-3_0014_Layer-88.png?v=1600073712", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Harrods-3_0017_Layer-41.png?v=1600073712", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Harrods-Black-Bay-3_0013_Layer-92.png?v=1600073712", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Harrods-Black-Bay-3_0010_Layer-97.png?v=1600073735", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Harrods-Black-Bay-3_0012_Layer-94.png?v=1600073735", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Harrods-3_0019_Layer-58.png?v=1600073735", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Harrods-Black-Bay-3_0011_Layer-95.png?v=1600073735", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Harrods-3_0016_Layer-42.png?v=1600073735", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Harrods-3_0015_Layer-43.png?v=1600073735"]},
{"productYear": "2017", "title": "A. Lange & Sohne 1815 Chronograph Boutique Edition", "productPrice": null, "productDescription": ["When thinking of the real heavyweights in Haute Horlogerie, only a few big names come to mind- Patek Philippe, Vacheron Constantin, Audemars Piguet and of course, the Germans next door, A. Lange & Sohne. While many see Swiss watches as the pinnacle of watchmaking, Lange serves as a reminder that this isn’t the case. In fact, one can say that in some areas, Lange is considered much better than its Swiss counterparts. "], "productCr": "This A. Lange & Sohne 1815 Chronograph Boutique Edition come as a full set. It has its inner and outer box, guarantee and service booklet along with an instructions manual in a leather folder. It is in full working order and the chronograph and flyback operates smoothly. The strap has been used but it is in good condition. It comes with its original 18k white gold tang buckle.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.Lange-_-Sohne-1815-Chronograph-Boutique-Front-Shot.jpg?v=1544688425", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Chronograph-Boutique-Edition-Creative.jpg?v=1544688425", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Chronograph-Boutique-Edition-Wrist-Shot.jpg?v=1544688425", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Chronograph-Boutique-Edition-Creative-2.jpg?v=1544688425", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Chronograph-Boutique-Edition-Creative-3.jpg?v=1544688425", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Chronograph-Boutique-Edition-Creative-1.jpg?v=1544688425", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.Lange-_-Sohne-1815-Chronograph-Boutique-AR-Shot.jpg?v=1544688425", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.Lange-_-Sohne-1815-Chronograph-Boutique-AL-shot.jpg?v=1544688425", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.Lange-_-Sohne-1815-Chronograph-Boutique-Movement-Shot-1.jpg?v=1544688425", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.Lange-_-Sohne-1815-Chronograph-Boutique-Movement-Shot-2.jpg?v=1544688425", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.Lange-_-Sohne-1815-Chronograph-Boutique-Side-Shot.jpg?v=1544688425", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Chronograph-Boutique-Buckle-Shot.jpg?v=1544688425"]},
{"productYear": "1997", "title": "Rolex Datejust 16233 Two-Tone", "productPrice": null, "productDescription": ["Strangely, while the Daytona and Submariner, GMT Master and Explorer are the most desired Rolexes today, it is the humble Rolex two-tone Datejust that graces the wrist of most Rolex owners around the world. Somewhere in-between the utility of steel models and the over the top nature of full-gold models, the two-tone Datejust is perhaps Rolexes best selling model. ", "I think it was perhaps seen as a respectable balance of doing well in life, but remaining humble, especially here in Asia, most men my father’s age have or had, at some point, a Rolex two-tone Datejust. As a result of this, this reference is often seen as the daggy, out of fashion model and maybe it shouldn’t be. With two-tone making a resurgence lately, the Datejust 16233 presents excellent value and still wears the crown proudly on its dial. Especially with an example like this- unpolished with its original sticker on its case back and oxidization occurring on the gold, I’m still a fan."], "productCr": "This Rolex Datejust 16233 is in excellent condition. It has been used sparingly with minor hairlines throughout from storage mostly. The case is unpolished and as it left the factory with its original case back sticker still on. It comes as a watch only.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Datejust-16623-Two-Tone_0001_Layer-16.png?v=1585910132", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Datejust-16623-Two-Tone_0031_Layer-92.png?v=1585910132", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Datejust-16623-Two-Tone_0033_Layer-87.png?v=1585910132", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Datejust-16623-Two-Tone_0003_Layer-14.png?v=1585910132", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Datejust-16623-Two-Tone_0005_Layer-12.png?v=1585910132", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Datejust-16623-Two-Tone_0032_Layer-91.png?v=1585910132", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Datejust-16623-Two-Tone_0002_Layer-15.png?v=1585910132", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Datejust-16623-Two-Tone_0030_Layer-94.png?v=1585910132", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Datejust-16623-Two-Tone_0006_Layer-11.png?v=1585910132", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Datejust-16623-Two-Tone_0004_Layer-13.png?v=1585910132", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Datejust-16623-Two-Tone_0007_Layer-10.png?v=1585910132"]},
{"productYear": null, "title": null, "productPrice": null, "productDescription": [], "productCr": null, "images": []},
{"productYear": "1990s", "title": "Patek Philippe 5040G Perpetual Calendar", "productPrice": null, "productDescription": ["The Patek Philippe Perpetual Calendar 5040 shares a lot of history with the more popular 3940 due to the fact that it has the same movement and complication as the latter. As some of you may know, the 3940 is one of my favorite watches of all time and the 5040 isn’t far behind. To read a more in-depth description of the 240Q movement in general and the significance it had on Patek Philippe’s history, ", "Released in 1992, the Patek Philippe 5040 came after the 3940 and featured a pebble-shaped tonneau case. While most would opt for the more traditional round case, this shape sits amazingly well on the wrist and the profile and lugs work proportionately well. ", "This example is an early white gold version, with its age denoted by the fact that the hallmarks are stamped on the side of the case as supposed to the back. The G suffix of the reference denotes white gold and it is significantly rarer and more desirable than the yellow gold version. It has a deep black dial with Arabic numerals and three sub-dials laid out in white. The moon phase is also uniquely white as supposed to gold which features on the other models. ", "Each sub-dial provides two sets of information, with the 3 o’clock sub-dial showing the leap year indicator and the day of the week, the 6 o’clock sub-dial showing the moon phase and the day of the month, and finally the 9 o’clock sub-dial showing the 24-hour clock and the month. The sub-dials are systemized within concentric circles and in an obvious hierarchy, with the day, month and date on the outer track of the sub-dial, with the less important leap year indicator, moon phase and 24-hour clock inside it.", "Powered by the legendary 240Q movement, it is an instantaneous perpetual calendar, taking into account the days of each month, including February and the leap year.", "While the 3940 is surely underrated, the 5040 is even more so and a great value proposition for those looking to enter the Patek Philippe Grand Complication club. It is a fantastically elegant piece and one of Patek’s all-time classics. "], "productCr": "This Patek Philippe 5040G is in good condition. It has very minor scratches and scuffs from previous use but nothing significant. The hallmarks on the side of the case remain sharp.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5040G-Perpetual-Calendar-Front-Shot.jpg?v=1570001357", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5040G-Perpetual-Calendar-Creative-3.jpg?v=1570001357", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5040G-Perpetual-Calendar-AR-Shot.jpg?v=1570001357", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5040G-Perpetual-Calendar-Wrist-Shot.jpg?v=1570001357", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5040G-Perpetual-Calendar-AL-Shot.jpg?v=1570001357", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5040G-Perpetual-Calendar-Movement-Shot-2.jpg?v=1570001357", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5040G-Perpetual-Calendar-Paper-Shot.jpg?v=1570001357", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5040G-Perpetual-Calendar-Side-Shot.jpg?v=1570001357", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5040G-Perpetual-Calendar-Movement-Shot.jpg?v=1570001357", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5040G-Perpetual-Calendar-Creative-2.jpg?v=1570001357", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5040G-Perpetual-Calendar-Creative-Shot.jpg?v=1570001349", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5040G-Perpetual-Calendar-Buckle-Shot.jpg?v=1570001349", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5040G-Perpetual-Calendar-Buckle-Shot-2.jpg?v=1570001349", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5040G-Perpetual-Calendar-Box-Shot.jpg?v=1570001349"]},
{"productYear": "2013", "title": "Speake Marin Spirit II", "productPrice": null, "productDescription": ["Speak-Marin is a brand that was founded by the eponymous watchmaker in 2002, producing exclusive watches in low quantities. One of the most well known independent watchmakers, Peter Speake-Marin has also collaborated with other big names such as Daniel Roth, Christopher Claret, Harry Winston, MB & F, Roger Dubuis and Maitres du Temps.", "This watch is powered by the TT738 self-winding movement and it incorporates twin barrels offering a very generous 120 hours of power reserve."], "productCr": "This Speak Marin Spirit II comes as a full set with its outer box, inner leather case and undated guarantee and certificate of origin signed by Peter Speake Marin. It is in mint condition and in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Speake-Marin-Spirit-II-Front-Shot.jpg?v=1544692710", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Speake-Marin-Spirit-II-Creative-1.jpg?v=1544692710", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Speake-Marin-Spirit-II-Wrist-Shot.jpg?v=1544692710", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Speake-Marin-Spirit-II-AL-Shot.jpg?v=1544692710", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Speake-Marin-Spirit-II-Creative.jpg?v=1544692710", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Speake-Marin-Spirit-II-AR-Shot.jpg?v=1544692710", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Speake-Marin-Spirit-II-Creative-2.jpg?v=1544692710", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Speake-Marin-Spirit-II-Caseback-Shot.jpg?v=1544692710", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Speake-Marin-Spirit-II-Side-Shot.jpg?v=1544692710", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Speake-Marin-Spirit-II-Buckle-Shot.jpg?v=1544692710"]},
{"productYear": "2019", "title": "Ming 17.06 Monolith", "productPrice": "$4,500.00", "productDescription": ["Bursting onto the scene in 2017, Ming has become one of the hottest watch brands in the world. Founded and fully funded by a group of 6 enthusiasts, Ming has built their business model on limited production ‘drops’ whereby it has quickly become the case that their watches sell out almost instantly. With such incredible and unique designs, and a story that all watch enthusiasts can get behind, it is no surprise that Ming finds themselves in the position they do.", "Here I have a Ming 17.06 Monolith from 2019 when the model was released. With “clean and restrained modern forms” as Ming puts it, the 17.06 Monolith acts in a stark juxtaposition to its 17.06 Copper sibling. Where the latter used textures and colors to bring out light in the dial, the aptly named Monolith is housed in an anthracite DLC bead-blasted case and a smooth matching black dial. All that is left in the darkness is the Luminova ring and markers, floating and glowing, resulting in a watch that moves the attention to MING’s heavy emphasis on lume. ", "Beyond its beautiful design, the 17.06 is technically impressive too. Waterproof to 100m, the Ming is a rather capable dress watch. Powered by the quintessential workhorse movement, the ETA 2824-2, Ming has modified the movement to have two crown positions and regulated it in five positions. As such, the 17.06 is more than adequately equipped to keep time than a lot of other watches that use the very same movement. It is interesting to note that even as an independent watchmaker, Ming still takes the utmost care in ensuring what they produce is of incredible value and can stand up to brands that are priced far beyond what Ming prices their watches at.", "The Ming 17.06 Monolith was made in small numbers, with only 125 pieces produced. "], "productCr": "This Ming 17.06 Monolith is in excellent condition. It comes as a full set with its box and card, and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Monolith_0012_Layer-27.png?v=1611301633", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Monolith-_0052_Layer-2.png?v=1611301635", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Monolith-_0048_Layer-10.png?v=1611301638", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Monolith-_0050_Layer-6.png?v=1611301640", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Monolith_0009_Layer-31.png?v=1611301641", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Monolith-_0051_Layer-4.png?v=1611301643", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Monolith_0010_Layer-30.png?v=1611301645", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Monolith-_0049_Layer-7.png?v=1611301647", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Monolith_0008_Layer-32.png?v=1611301651", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Monolith_0013_Layer-28.png?v=1611301653", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Monolith_0007_Layer-33.png?v=1611301648", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Monolith_0011_Layer-29.png?v=1611301655", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Monolith-_0047_Layer-11.png?v=1611301662"]},
{"productYear": "2019", "title": "Ming 17.06 Slate", "productPrice": null, "productDescription": ["Bursting onto the scene in 2017, Ming has become one of the hottest watch brands in the world. Founded and fully funded by a group of 6 enthusiasts, Ming has built their business model on limited production ‘drops’ whereby it has quickly become the case that their watches sell out almost instantly. With such incredible and unique designs, and a story that all watch enthusiasts can get behind, it is no surprise that Ming finds themselves in the position they do.", "Here I have a Ming 17.06 Slate from 2019 when the model was released. With “clean and restrained modern forms” as Ming puts it, the entire watch is built around the visual experience created by its dial. With numerous dial textures, layers, and rather intelligent use of Super LumiNova, the 17.06 Slate is aesthetic mastery. The 17.06’s slate-colored dial creates a gorgeous visual juxtaposition between the polished 316L stainless steel case and satin-finished crown. As the several textures and finishes play off one another, the 17.06 comes into its own as the watch that was conceived to make use of light in ways we rarely see in horology. As supposed to the brighter and more famous ‘Copper’, the Slate is cooler in its tones and more low-key. ", "Beyond its beautiful design, the 17.06 is technically impressive too. Waterproof to 100m, the Ming is a rather capable dress watch. Powered by the quintessential workhorse movement, the ETA 2824-2, Ming has modified the movement to have two crown positions and regulated it in five positions. As such, the 17.06 is more than adequately equipped to keep time than a lot of other watches that use the very same movement. It is interesting to note that even as an independent watchmaker, Ming still takes the utmost care in ensuring what they produce is of incredible value and can stand up to brands that are priced far beyond what Ming prices their watches at.", "Furthermore, it is worth mentioning that the 17.06 Copper, which was released at the same period, managed to win the Horological Revelation Prize at the GPHG in 2019, a watch industry award that is akin to the Grammys. They are both 17.06s with different colorways and dials but it was an amazing feat that truly solidified the entire MING brand as a true success and one that is here to last.", "200 pieces of the Ming 17.06 Slate was produced."], "productCr": "This Ming 17.06 Slate is in excellent condition. It comes as a full set with its box and card, and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Slate_0019_Layer-34.png?v=1611303658", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Slate_0057_Layer-3.png?v=1611303660", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Slate_0054_Layer-9.png?v=1611303664", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Slate_0017_Layer-36.png?v=1611303667", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Slate_0016_Layer-37.png?v=1611303669", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Slate_0056_Layer-5.png?v=1611303670", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Slate_0053_Layer-12.png?v=1611303672", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Slate_0055_Layer-8.png?v=1611303674", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Slate_0020_Layer-35.png?v=1611303676", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Slate_0058_Layer-1.png?v=1611303678", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Slate_0014_Layer-40.png?v=1611303680", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Slate_0015_Layer-39.png?v=1611303681", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-17.06-Slate_0018_Layer-38.png?v=1611303683"]},
{"productYear": "2013", "title": "F.P. Journe Octa Sport Aluminium", "productPrice": null, "productDescription": ["Where to begin with F.P. Journe. Started by the man himself in 1999, Journe had previously spent quite a few years restoring and producing movements and also made a couple of pocket watches during that time. It took quite a few years before his brand went from something only a hardcore collector could appreciate to being appreciated by a more mainstream audience and today, he is considered by many as one of the most successful and important independent brands to have emerged.", "In my opinion, F.P. Journe has hit the sweet spot, producing around 900 pieces a year only. This ensures that they are exclusive enough that people consider any Journe a rare piece, but not so rare that it becomes esoteric. There are brands like Roger Smith and Philippe Dufour, both who are considered godfathers of high horology, but they make so few pieces a year that the average watch collector would not know about them. Mention F.P. Journe though, and you’ll have collectors jumping with joy. ", "The Octa Sport line is definitely one of the more unusual offerings from F.P. Journe. Known more for dress watches, Journe surprised everyone when he released a sport line in 2012, with this Octa Sport being one of them. Weighing at only around 30 grams without the strap, the aluminium case is insanely light. Furthermore, this example is discontinued, with titanium taking over the line after only a few years.", "Powering this watch is the classic Octa calibre 1300.3 that you find in the other Octa models, except the entire movement is also produced in aluminium. The case itself sits very nicely on the wrist with its integrated rubber strap and deployment buckle fitting the look well. 120 hours of power reserve, a two-wheel date aperture, a power reserve and day/night indicator finishes off the Octa Sport aesthetic atop a matte grey dial. "], "productCr": "This F.P. Journe Octa Sport is in mint condition. It is in full working order and comes as a full set with its inner and outer box, manual and warranty card.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaSportSAluminium_0029_Layer27.jpg?v=1585058815", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaSportAlunminiumCreatives_0027_Layer34.jpg?v=1585058856", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaSportAlunminiumCreatives_0028_Layer33.jpg?v=1585058856", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaSportAlunminiumCreatives_0030_Layer31.jpg?v=1585058856", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaSportSAluminium_0024_Layer24.jpg?v=1585058856", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaSportSAluminium_0026_Layer22.jpg?v=1585058856", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaSportSAluminium_0025_Layer23.jpg?v=1585058856", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaSportSAluminium_0028_Layer20.jpg?v=1585058856", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaSportSAluminium_0027_Layer21.jpg?v=1585058856", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaSportSAluminium_0022_Layer26.jpg?v=1585058856", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaSportSAluminium_0023_Layer25.jpg?v=1585058856", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.JourneOctaSportAlunminiumCreatives_0029_Layer32.jpg?v=1585058848"]},
{"productYear": "2017", "title": "A. Lange & Sohne 1815 Annual Calendar", "productPrice": null, "productDescription": ["When thinking of the real heavyweights in haute horlogerie, only a few big names come to mind- Patek Philippe, Vacheron Constantin, Audemars Piguet and of course, the Germans next door, A. Lange & Sohne. While many see Swiss watches as the pinnacle of watchmaking, Lange serves as a reminder that this isn’t the case. In fact, one can say that in some areas, Lange is considered much better than its Swiss counterparts. ", "What makes this Annual Calendar a bit different and even more usable, is the placement of a large pusher at 2 o’clock. While most calendar watches requires you to set the watch via mini pushers, the Lange provides one extra step. This 1815 Annual Calendar has your traditional mini pushers, but once that is set, you can use the large pusher to move all of it at the same time, which means if you forget to wind your watch for a few days, you can easily bring the calendar back to the correct day, date and month with a few pushes.", "This Lange is powered by the in-house manual-winding Caliber L051.3. As with all Lange’s, this movement is beautiful both in its architectural design and its finishing. Made from German silver, you get a nice yellow patina on the three quarter plate that gives good contrast to the overall aesthetic. It has a power reserve of 72 hours and of course, features a beautifully hand-engraved balance cock. ", "This A. Lange & Sohne 1815 Annual Calendar is a serious watch and is really up there with some of the best. You get a complicated watch that is both practical and beautifully designed, finished to the highest level."], "productCr": "This A. Lange & Sohne 1815 Annual Calendar is in mint condition. It comes as a full set with its inner and outer box, leather folder, manual and guarantee book.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0001_Layer-2.png?v=1587116879", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0014_Layer-96.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0006_Layer-104.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0008_Layer-5.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0013_Layer-97.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0002_Layer-3.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0015_Layer-95.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0007_Layer-6.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0003_Layer-10.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0008_Layer-102.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0004_Layer-9.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0005_Layer-8.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0007_Layer-103.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0009_Layer-4.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0009_Layer-101.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0010_Layer-100.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0011_Layer-99.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0012_Layer-98.png?v=1587116915", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-1815-Annual-Calendar_0006_Layer-7.png?v=1587116915"]},
{"productYear": "2017", "title": "F.P. Journe Chronometre Bleu", "productPrice": null, "productDescription": ["Where to begin with F.P. Journe. Started by the man himself in 1999, Journe had previously spent quite a few years restoring and producing movements and also made a couple of pocket watches during that time. It took quite a few years before his brand went from something only a hardcore collector could appreciate to being appreciated by a more mainstream audience and today, he is considered by many as one of the most successful and important independent brands to have emerged.", "In my opinion, F.P. Journe has hit the sweet spot, producing around 900 pieces a year only. This ensures that they are exclusive enough that people consider any Journe a rare piece, but not so rare that it becomes esoteric. There are brands like Roger Smith and Philippe Dufour, both of who are considered godfathers of high horology, but they make so few pieces a year that the average watch collector would not know about them. Mention F.P. Journe though, and you’ll have collectors jumping with joy. ", "Of all the watches F.P. Journe has ever made, none has caught the public attention more than the Chronometre Bleu. While there are certainly more complicated, rare and special timepieces from FPJ, the Chronometre Bleu is the watch that really made the brand into a household name, into the mainstream. Released in 2009, it was made largely as a response to the 2008 crisis that threatened many businesses around the world. In order to stay afloat, the Chronometre Bleu was priced as an entry-level watch to keep sales going.", "There are several things unique about this watch, most significantly, of course, being the fact that it is made completely out of tantalum, a very unusual material for watches. It is a material that is rarer than gold and it is extremely hard to both mine and machine, making it very expensive to produce. The result is a material that has dark blue and silver tones and something you do not see very often. It is a beautiful look that sits stealthily on the wrist and throws off different hues depending on the light source. On top of this, not only is the Chronometre Bleu is the only watch in the F.P. Journe line-up that is made from Tantalum, but also from a 39mm case. ", "Moving on to the dial, it certainly would have to be one of the most impressive dials out there. The chrome blue dial is super reflective and it is achieved through multiple layers of blue lacquer that is hand applied and polished multiple times. It is very well known that the Chronometre Bleu dial is the most complicated and expensive dial that Journe produces with a high failure rate. The result though is a beautifully enigmatic dial that can look from a deep blue/black to a super-light electric blue.", "It is for all of these reasons that F.P. Journe decided to cut production of the Chronometre Bleu. It was just too expensive for an ‘entry-level’ piece and as a result, demand for this watch has surged even more. I think for once it is nice that the market has priced this higher than retail because collectors recognize that for years Journe was underpricing the Chronometre Bleu. I would say that this could be the most significant ‘independent’ watch ever produced as it really put the spotlight on artisanal, independent watchmaking. Today it is very normal to collect independents, but before the Chronometre Bleu, that realm was only reserved for the most hardcore of watch collectors."], "productCr": "This F.P. Journe Chronometre Bleu is in excellent condition. They are minor hairlines from previous use but overall remains in an excellent state. It is in full working order and comes as a full set with its inner and outer box, warranty/guarantee card and instruction manual USB stick.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0001_Layer-30.png?v=1587117798", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0010_Layer-116.png?v=1587117881", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0007_Layer-32.png?v=1587117881", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0006_Layer-33.png?v=1587117881", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0001_Layer-126.png?v=1587117881", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0002_Layer-31.png?v=1587117881", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0002_Layer-125.png?v=1587117881", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0003_Layer-124.png?v=1587117881", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0004_Layer-123.png?v=1587117881", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0009_Layer-117.png?v=1587117881", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0005_Layer-34.png?v=1587117881", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0003_Layer-36.png?v=1587117881", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0004_Layer-35.png?v=1587117881", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0006_Layer-121.png?v=1587117881", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0007_Layer-120.png?v=1587117881", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0008_Layer-119.png?v=1587117881", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Bleu_0005_Layer-122.png?v=1587117881"]},
{"productYear": "2011", "title": "Patek Philippe Annual Calendar 5205G", "productPrice": null, "productDescription": ["I would first begin by saying that in my opinion, the Patek Philippe 5205G Annual Calendar is perhaps the perfect embodiment of what a modern Patek should be. Sure, it is not the rarest or most complicated watch that the brand makes, but I feel that the sum of its parts, from the dial to the case and movement, really makes this a contender for the definitive Patek Philippe of the 21st century so far.", "Introduced in 2010, the 5205 marked a new generation of Annual Calendars from Patek Philippe and featured a distinctive 3 aperture layout at 10, 12 and 2 o’clock that displayed the day, date and month respectively. This was an aesthetic that was truly something new and it is no surprise that this became one of the brand’s best sellers. ", "Rewinding back slightly, the annual calendar complication was invented and patented by Patek Philippe in 1996 as they realised that there was a gap between a simple calendar watch and the highly complicated perpetual calendar complication. While a simple calendar must be adjusted every month, and a perpetual calendar never needs to be adjusted, even on leap years, an annual calendar sits in the middle, where the user only has to adjust the watch once a year in February, while the mechanism takes care of the 30 and 31 days of the rest of the year. The highly expensive perpetual calendar was too inaccessible and the annual calendar provided the perfect balance between practicality and cost.", "Patek Philippe has been trying to modernize their brand for a long time, in an attempt to attract a younger crowd and while in recent times they’ve had some hit and misses, they really knocked this one out of the park."], "productCr": "This Patek Philippe 5205 is in excellent condition and comes as a full set, including its inner and outer box, Patek Philippe leather folder, Certificate of Origin, manual and hangtag. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G_0010_Layer-45.png?v=1587118717", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G_0001_Layer-109.png?v=1587118717", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G_0002_Layer-108.png?v=1587118717", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G_0003_Layer-107.png?v=1587118717", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G_0004_Layer-106.png?v=1587118717", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G_0005_Layer-105.png?v=1587118717", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G_0016_Layer-46.png?v=1587118717", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G_0015_Layer-47.png?v=1587118717", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G_0013_Layer-49.png?v=1587118717", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G_0011_Layer-51.png?v=1587118717", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G_0012_Layer-50.png?v=1587118717", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Annual-Calendar-5205G_0014_Layer-48.png?v=1587118716"]},
{"productYear": "2019", "title": "Patek Philippe Aquanaut 5167A Unused", "productPrice": null, "productDescription": ["The Patek Philippe Aquanaut needs no introduction. Launched in 1997 to attract a younger crowd, it was priced as an entry-level Patek Philippe made in stainless steel and equipped with a rubber strap. Marketed as a luxury sports watch and as a younger sibling to the Nautilus, it was not exactly loved when it was first released and it was seen as blasphemous to the identity of Patek Philippe. Fast forward to today and it is one of the hottest offerings from the manufacture. ", "I am sure all of you would know by now, that perhaps after the Nautilus, the Aquanaut is the hardest model to buy at retail with crazy waitlists. It is no secret that you have to buy many pieces from Patek before that will even let you onto the waitlist. This example you see here is a 5167A, succeeding the original 506X series making it the second generation time-only Aquanaut. ", "I can’t deny that it is a fantastic watch on the wrist. Sized at 40mm and sitting with a super-thin 8.3mm thickness, it sits comfortably well and flat. On top of this, you get the classic world-class Patek case finishing with a satin-brushed bezel and sides and polished edges. The gradient grey dial has an embossed checkerboard pattern and lume filled Arabic numeral and markers, making it extremely legible. The integrated rubber strap follows the dials pattern and looks very well together. ", "Powering this watch is the in-house self-winding caliber 324 S C, which is also found on the Nautilus. It has a 21k solid gold central rotor and excellent finishing throughout. This Aquanaut 5167A has a power reserve of 45 hours.", "This particular Aquanaut is rarer as it is a late 2019 model and in unused condition. What distinguishes the 2019 models from the earlier ones is that Patek moved to use completely white luminous material whereas previously it had a green tinge. It is quite obvious in the flesh and a nice differentiating factor.", "I am sure you didn’t need to read the above for you to decide whether you love this piece or not. It is one of the most in-demand watches produced today and the perfect do-anything watch in my opinion."], "productCr": "This Patek Philippe Aquanaut 5167A is brand new and unused. It comes uncut and with all accessories.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-2020_0001_Layer-67.png?v=1587118970", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5167A-BNIB-2020_0013_Layer-76.png?v=1587118970", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5167A-BNIB-2020_0014_Layer-75.png?v=1587118970", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-2020_0006_Layer-69.png?v=1587118970", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-2020_0005_Layer-71.png?v=1587118970", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5167A-BNIB-2020_0012_Layer-77.png?v=1587118970", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-2020_0002_Layer-68.png?v=1587118970", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-2020_0003_Layer-73.png?v=1587118970", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-2020_0004_Layer-72.png?v=1587118970", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-2020_0007_Layer-70.png?v=1587118933"]},
{"productYear": "2019", "title": "Patek Philippe Aquanaut Chronograph 5968A", "productPrice": null, "productDescription": ["The Patek Philippe Aquanaut needs no introduction. Launched in 1997 to attract a younger crowd, it was priced as an entry-level Patek Philippe made in stainless steel and equipped with a rubber strap. Marketed as a luxury sport watch and as a younger sibling to the Nautilus, it was not exactly loved when it was first released and it was seen as blasphemous to the identity of Patek Philippe. Well, that didn’t last very long. Fast forward to today and it is, without a doubt, one of the hottest offerings from the manufacture. ", "I am sure all of you would know by now, that perhaps after the Nautilus, the Aquanaut is the hardest model to buy at retail with crazy waitlists. It is no secret that you have to buy many pieces from Patek before they will even let you onto the waitlist. What you may not know though, is that the example you see here today is even scarcer and more in-demand than some of the Nautilus models out there.", "Introduced only in 2018, Patek Philippe unveiled the 5968A- an Aquanaut with a chronograph function. It was only a matter of time before Patek did this and it was certainly long-awaited. Using the same CH 28-250 C movement as the Nautilus chronograph, this is a serious watch and as a result, can no longer be considered the ‘younger sibling’ of the Nautilus. Furthermore, as it is incredibly difficult to be allocated a piece, and with currently only a 2-year production run so far, there are far fewer examples of these on the market than other sought after Pateks.", "On the wrist, it’s 42mm case sits nicely and has some nice weight and heft to it. The most distinctive feature of this watch, of course, is the use of orange both on the strap and the accents on the dial. The Aquanaut was always meant to be a sporty and young watch, and somehow, Patek has managed to make this piece work with the bright orange not coming off tacky at all. I can imagine wearing this on holiday, on the beach or just during the weekend at a barbecue. I’m really not one for bright colors but somehow, this watch has managed to convince me otherwise. What is nice as well, is if you do not feel like the orange, this watch also comes with an uncut, brand new black rubber strap to tone things down a bit when you need to, but for me- it has to be orange.", "The 5968A is just as versatile as any sports watch out there and perfectly encapsulates the term ‘luxury sport’ watch. I am sure you didn’t need to read the above for you to decide whether you love this piece or not. It is one of the most in-demand watches produced today and the perfect do-anything watch."], "productCr": "This Patek Philippe Aquanaut 5968A is in good condition. It has some minor hairlines from previous use. This watch comes as a full set with all of its accessories including its inner and outer box, papers, manual and an uncut brand new black rubber strap.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeAquanaut5968AOrange_0001_Layer73.jpg?v=1585059561", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeAquanautChronograph5968ACreatives_0006_Layer25.jpg?v=1585059561", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeAquanautChronograph5968ACreatives_0001_Layer30.jpg?v=1585059561", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeAquanautChronograph5968ACreatives_0003_Layer28.jpg?v=1585059561", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeAquanautChronograph5968ACreatives_0002_Layer29.jpg?v=1585059561", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeAquanaut5968AOrange_0003_Layer71.jpg?v=1585059561", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeAquanaut5968AOrange_0004_Layer70.jpg?v=1585059561", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeAquanautChronograph5968ACreatives_0005_Layer26.jpg?v=1585059561", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeAquanautChronograph5968ACreatives_0004_Layer27.jpg?v=1585059561", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeAquanaut5968AOrange_0008_Layer66.jpg?v=1585059561", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeAquanaut5968AOrange_0007_Layer67.jpg?v=1585059561", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeAquanaut5968AOrange_0006_Layer68.jpg?v=1585059561", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeAquanaut5968AOrange_0002_Layer72.jpg?v=1585059561", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeAquanaut5968AOrange_0005_Layer69.jpg?v=1585059561"]},
{"productYear": "2010", "title": "Patek Philippe Nautilus 5712A", "productPrice": null, "productDescription": ["I guess I have to begin by saying what everyone already knows: The Nautilus has to be the most popular watch of the last five years, especially in blue. Next to the 5711, I’d say the other reference that has certainly become a poster boy of this craze is the 5712A.", "Today, there are a myriad of Nautilus models with different complications. From chronographs to calendars to GMTs, there is a complication for everyone. This particular reference, the 5712A, features a calendar, moon phase, and a power reserve indicator, all laid out in a beautifully asymmetric layout. The dial follows the DNA of the original Nautilus, with its familiar ridged dial and colored a beautiful tone of blue. With a thickness of 8.52mm, it is only 0.2 mm thicker than the time only 5711 and remains an ultra-thin sports watch. ", "The Patek Philippe Nautilus is really the ultimate luxury sport watch, combining brutalist design elements with an elegant profile and sizing. It is just such a cool watch and while the 5711 is the true classic, the 5712 has become an icon in its own right. In my opinion, Patek will not increase production and the demand for these will not go away- everyone who sees one gets why."], "productCr": "This Patek Philippe Nautilus 5712 is in mint condition. It comes as a full set with all of its accessories including the certificate of origin, inner and outer box, pusher, leather folder and brochures.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilus5712A_0001_Layer48.jpg?v=1585059145", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5712-Creatives.jpg?v=1585059145", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilus5712A_0003_Layer46.jpg?v=1585059145", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilus5712A_0005_Layer44.jpg?v=1585059145", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilus5712A_0002_Layer47.jpg?v=1585059145", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilus5712A_0007_Layer42.jpg?v=1585059145", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilus5712A_0006_Layer43.jpg?v=1585059145", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilus5712A_0004_Layer45.jpg?v=1585059145"]},
{"productYear": "2018", "title": "Rolex Cosmograph Daytona 116509 White Gold", "productPrice": null, "productDescription": ["I really don’t think I need to go too much into the Daytona as pretty much everyone knows about this watch. It has always been the case that the ultimate Rolex is ironically not a solid gold President Day-Date, but the Cosmograph Daytona. With waitlists in the years to authorized dealers these days not even entertaining you unless you’ve bought another Rolex before, the Daytona is without a doubt the most desirable and hardest to get Rolex in the market today. ", "While we are certainly used to the stainless steel Daytona, the gold Daytona has always maintained a place in the Rolex lineup and one of my picks would be this 116509. Crafted in a 40mm 18k white gold case, it remains subtle and elegant and fitted with a stunning sunburst blue dial with red accents. With stainless steel models selling at big premiums, the 116509s remain priced around its retail tag, which gives me the impression that these are poised for a jump. In fact, earlier this year, this watch was featured on Hodinkee’s talking watches by none other than John Mayer, where he called the 116509 and the 116508 (yellow gold, green dial) as the best buys you can make at Rolex now. The 116508 with the green dial has jumped in value since then, while this example remains excellently priced. ", "The Rolex Daytona has and will always be the de facto flagship icon of Rolex, partly due to its rich history and association with famous individuals throughout history. On the wrist, with all of the hype and history aside, it is just a downright good looking watch. At 40mm, it sits perfectly and has a design language that sits amongst other legendary designs such as the 911 Porsche and Fender Stratocaster. This one is made even special with the unusual blue dial and white gold case. White gold is the stealth wealth metal of choice, as most people will just think it is stainless steel. That being said, when you strap it on your wrist, the sheer weight of the white gold case and bracelet will remind you every day exactly what it is. "], "productCr": "This Rolex Daytona Cosmograph 116500 Ceramic is in mint condition. It comes as a full set with all of its accessories, including its warranty, brochures and manuals, and inner and outer box. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116509_White_Gold_Blue_Dial_0102_Layer_2.jpg?v=1577431396", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116509_White_Gold_Blue_Dial_0096_Layer_55.jpg?v=1577431416", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116509_White_Gold_Blue_Dial_0100_Layer_4.jpg?v=1577431416", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116509_White_Gold_Blue_Dial_0099_Layer_5.jpg?v=1577431416", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116509_White_Gold_Blue_Dial_0101_Layer_3.jpg?v=1577431416", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116509_White_Gold_Blue_Dial_0098_Layer_6.jpg?v=1577431414", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116509_White_Gold_Blue_Dial_0097_Layer_7.jpg?v=1577431414"]},
{"productYear": "2017", "title": "F.P. Journe Centigraphe Souverain", "productPrice": null, "productDescription": ["Where to begin with F.P. Journe. Started by the man himself in 1999, Journe had previously spent quite a few years restoring and producing movements and also made a couple of pocket watches during that time. It took quite a few years before his brand went from something only a hardcore collector could appreciate to being appreciated by a more mainstream audience and today, he is considered by many as one of the most successful and important independent brands to have emerged.", "In my opinion, F.P. Journe has hit the sweet spot, producing around 900 pieces a year only. This ensures that they are exclusive enough that people consider any Journe a rare piece, but not so rare that it becomes esoteric. There are brands like Roger Smith and Philippe Dufour, both of who are considered godfathers of high horology, but they make so few pieces a year that the average watch collector would not know about them. Mention F.P. Journe though, and you’ll have collectors jumping with joy. ", "What you see here today is one of Journe’s most iconic models- the Centigraphe. Designed to time 1/100th of a second, you can already imagine how complicated this is going to get. There are pushers on the top right-hand side of the case to activate the chronograph, prompting the 10 o’clock sub-dial to start running. Watching this is something very special as you see the foudroyant (flying seconds) run and when you stop the chronograph it can stop anywhere on the sub-dial, allowing the user to record exactly to 1/100th of a second. The other two sub-dials act as a 20 second and 10 minute counter.", "Housed in a 40mm platinum case, there is definitely a nice heft to the watch. I think one of the main reasons why collectors love Journe is because of his signature case. It sits so thin and flat on the wrist and finishes off with lugs that step down and hugs your wrist. Once you strap it on, you’ll understand.", "F.P. Journe has carved a very interesting niche in the independent watch world where he has managed to blend traditional watchmaking and design cues with modern technology and an unmistakably Journe aesthetic. Despite using very traditional elements like his serif’d Arabic numerals, a knurled winding crown and a standard round case, the way it has been laid out combines to create a look that is F.P. Journe through and through. ", "The purists really love Journe because of his motto ‘Invenit et Fecit’, which translates from Latin to Invent and Create. To this day, F.P. Journe has stuck to this mantra, where he continues to invent his own in-house movements. Furthermore, everything else is also in-house, even to the point of owning his own case-maker and dial-maker. For a small brand that makes less than 1000 pieces a year, it is really impressive.", "Now, of course, timing to 1/100th of a second is not something we need in our lives, but just like art, it is the complexity and the ingenuity that we appreciate. After all, isn’t the wristwatch in itself an archaic tool? So why not, just go all out? It is for that reason, I think that the Centigraphe is one of the greatest watches that has come out of this century."], "productCr": "This F.P. Journe Centigraphe Souverain is in mint condition. It is in full working order and comes as a full set with its inner and outer box and warranty card. The chronograph is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Centigraphe_0014_Layer_38.jpg?v=1574421173", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Centigraphe_0015_Layer_12.jpg?v=1574421203", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Centigraphe_0016_Layer_36.jpg?v=1574421203", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Centigraphe_0016_Layer_11.jpg?v=1574421203", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Centigraphe_0015_Layer_37.jpg?v=1574421203", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Centigraphe_0017_Layer_35.jpg?v=1574421203", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Centigraphe_0017_Layer_10.jpg?v=1574421203", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Centigraphe_0018_Layer_34.jpg?v=1574421203", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Centigraphe_0021_Layer_31.jpg?v=1574421202", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Centigraphe_0020_Layer_32.jpg?v=1574421202", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Centigraphe_0019_Layer_33.jpg?v=1574421202"]},
{"productYear": "2015", "title": "Rolex Submariner 116610LV Hulk", "productPrice": null, "productDescription": ["The Rolex Submariner is one of the most recognizable and popular watches in the world, and like most Rolexes, needs no introduction. First created in the 1950s and with evolution rather than revolution in mind, the Submariner has endured until today with its design language still largely intact. ", "The Submariner 116610 was introduced in 2010 and replaced the 16610 which had been in production for nearly 2 decades. This was, a relatively huge change in the Submariner design language with a beefier brand new stainless steel case, maintaining its size at 40mm but with thicker lugs, a new bracelet and of course, the ceramic ‘Cerachrom’ bezel. While the classic black Submariner was introduced and somewhat expected, Rolex had a surprise up their sleeves, also introducing an ‘LV’ version, with a green bezel and dial. Of course, the world went nuts for it and till this day it remains one of the most desirable Rolex models. ", "Quickly nicknamed ‘The Hulk’ for obvious reasons, it was a direct successor to the previous 16610LV ‘Kermit’ which featured only a green bezel and a black dial. As it was an anniversary piece, no one expected Rolex to carry on with the green theme. The green certainly adds an edge over the standard black Submariner and allows for some variances in the otherwise sometimes mundane diver line up. ", "On the wrist, the 116610LV has a very muscular presence, with a nice overall heft. Despite this, I am very glad Rolex stuck to the 40mm sizing as anything above this would be, in my opinion, too much. The Submariner ‘Hulk’ is undoubtedly one of the Rolex classics and will certainly be an enduring icon. "], "productCr": "This Rolex Submariner 116610LV Hulk is in excellent condition. It comes as a full set with its box (inner, outer, sleeve), warranty card, green wallet, manual and brochure. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Submariner-116610LV-Hulk-Front-Shot.jpg?v=1577430684", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_116610LV_Hulk_0035_Layer_80.jpg?v=1577430684", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_116610LV_Hulk_0031_Layer_92.jpg?v=1577430684", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_116610LV_Hulk_0036_Layer_77.jpg?v=1577430684", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_116610LV_Hulk_0034_Layer_83.jpg?v=1577430684", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_116610LV_Hulk_0032_Layer_91.jpg?v=1577430684", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_116610LV_Hulk_0030_Layer_94.jpg?v=1577430684", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_116610LV_Hulk_0029_Layer_93.jpg?v=1577430684", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_116610LV_Hulk_0028_Layer_95.jpg?v=1577430684", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_116610LV_Hulk_0027_Layer_96.jpg?v=1577430682"]},
{"productYear": "2007", "title": "Rolex Submariner 16610LV Kermit", "productPrice": null, "productDescription": ["The Rolex Submariner is one of the most recognizable and popular watches in the world, and like most Rolexes, needs no introduction. First created in the 1950s and with evolution rather than revolution in mind, the Submariner has endured until today with its design language still largely intact. ", "The Submariner 11610 was introduced in the ’90s and was produced for over two decades. While the standard version featured the familiar black dial with black bezel, in 2003, Rolex surprised the world when it introduced the 11610LV. With ‘LV’ standing for Lunette Verde, the new Submariner featured a green bezel instead of the usual black and was made to celebrate the 50th Anniversary of the model line. You have to see this in context, as while other brands chop and change their models all the time, Rolex in general, does not. There is a reason why as mentioned, a Submariner from the 50s still looks similar to the one made today. ", "Nicknamed the ‘Kermit’ for its green bezel, the 11610LV was produced for 7 years only before it was discontinued. Furthermore, as the production of the Kermit had variances throughout its lifetime, there were several marks of the Kermit, all subtle, but exactly the recipe of making something collectible.", "This particular example is an M serial watch, meaning it’s one of the later Kermits to be produced. Most notably it features a rehaut ring that Rolex only introduced around 2007. While this piece is considered an ordinary Kermit, the early watches with the famed ‘Flat Four’ bezels are highly collectible, as are the B3 Lime inserts that featured a faded lime green, only produced in the mid-2000’s- you can imagine how deep just one reference can get. ", "I have very high hopes for the Kermit as not only a great looking and highly unusual Rolex, but also as a solid investment piece for the future. This is really the first time Rolex introduced color to its stainless steel Submariner and as an anniversary piece coupled with the variances and its relatively short production life, it is still a highly undervalued watch. "], "productCr": "This Rolex Submariner 11610LV Kermit is in great condition. The stainless steel case is shard and is free from any major damage or dents. The insert has a small scuff around the 30 mark and minor hairlines throughout. It is in full working order and comes as a watch and box only.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/RolexSubmariner11610LVKermitWatchOnly_0027_Layer43.jpg?v=1585721459", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/RolexSubmariner11610LVKermitWatchOnly_0007_Layer81.jpg?v=1585721459", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/RolexSubmariner11610LVKermitWatchOnly_0006_Layer82.jpg?v=1585721459", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/RolexSubmariner11610LVKermitWatchOnly_0025_Layer45.jpg?v=1585721459", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/RolexSubmariner11610LVKermitWatchOnly_0024_Layer46.jpg?v=1585721459", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/RolexSubmariner11610LVKermitWatchOnly_0005_Layer83.jpg?v=1585721459", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/RolexSubmariner11610LVKermitWatchOnly_0004_Layer101.jpg?v=1585721459", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/RolexSubmariner11610LVKermitWatchOnly_0026_Layer44.jpg?v=1585721459", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/RolexSubmariner11610LVKermitWatchOnly_0023_Layer47.jpg?v=1585721459", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/RolexSubmariner11610LVKermitWatchOnly_0022_Layer48.jpg?v=1585721459"]},
{"productYear": "2018", "title": "Rolex Cosmograph Daytona 116500 Panda", "productPrice": null, "productDescription": ["I really don’t think I need to go too much into the Daytona as pretty much everyone knows about this watch. It has always been the case that the ultimate Rolex is ironically not a solid gold President Day-Date, but the Cosmograph Daytona. With waitlists in the years to authorized dealers these days not even entertaining you unless you’ve bought another Rolex before, the Daytona is without a doubt the most desirable and hardest to get Rolex in the market today. ", "The Rolex Daytona has and will always be the de facto flagship icon of Rolex, partly due to its rich history and association with famous individuals throughout history. On the wrist, with all of the hype and history aside, it is just a downright good looking watch. At 40mm, it sits perfectly and has a design language that sits amongst other legendary designs such as the 911 Porsche and Fender Stratocaster. The panda dial layout, which is the more desirable variant, has a porcelain-like white that contrasts nicely with the matte black ceramic bezel.", "With that famous Rolex quality and history, the Daytona strikes a perfect balance between everyday usability and still giving you that feeling of having something special on your wrist."], "productCr": "This Rolex Daytona Cosmograph 116500 Ceramic is in mint condition. It comes as a full set with all of its accessories, including its warranty, brochures and manuals, and inner and outer box. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116500_Ceramic_Panda_0084_Layer_15.jpg?v=1577431516", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116500_Ceramic_Panda_0076_Layer_81.jpg?v=1577431558", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116500_Ceramic_Panda_0075_Layer_82.jpg?v=1577431558", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116500_Ceramic_Panda_0082_Layer_17.jpg?v=1577431558", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116500_Ceramic_Panda_0081_Layer_18.jpg?v=1577431558", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116500_Ceramic_Panda_0074_Layer_87.jpg?v=1577431558", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116500_Ceramic_Panda_0077_Layer_76.jpg?v=1577431558", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116500_Ceramic_Panda_0079_Layer_20.jpg?v=1577431558", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116500_Ceramic_Panda_0078_Layer_21.jpg?v=1577431558", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116500_Ceramic_Panda_0083_Layer_16.jpg?v=1577431558", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Cosmograph_Daytona_116500_Ceramic_Panda_0080_Layer_19.jpg?v=1577431558"]},
{"productYear": "2005", "title": "Rolex Submariner 16610LV Kermit B3 Lime", "productPrice": null, "productDescription": ["The Rolex Submariner is one of the most recognizable and popular watches in the world, and like most Rolexes, needs no introduction. First created in the 1950s and with evolution rather than revolution in mind, the Submariner has endured until today with its design language still largely intact. ", "The Submariner 11610 was introduced in the ’90s and was produced for over two decades. While the standard version featured the familiar black dial with black bezel, in 2003, Rolex surprised the world when it introduced the 11610LV. With ‘LV’ standing for Lunette Verde, the new Submariner featured a green bezel instead of the usual black and was made to celebrate the 50th Anniversary of the model line. You have to see this in context, as while other brands chop and change their models all the time, Rolex in general, does not. There is a reason why as mentioned, a Submariner from the 50’s still looks similar to the one made today. ", "Nicknamed the ‘Kermit’ for its green bezel, the 11610LV was produced for 7 years only before it was discontinued. Furthermore, as the production of the Kermit had variances throughout its lifetime, there were several marks of the Kermit, all subtle, but exactly the recipe of making something collectible.", "This particular example is a very special one that features the highly desirable B3 Lime Insert. Made only for a few years and correct only for F or D serials, the insert is the most distinctive in the whole Kermit’s production span as the shade of green is truly unique. I am not sure why this aging process occurred, but it must be to do with Rolex changing suppliers and as us, collectors know, any anomaly in Rolex’s usually stringent production is always worth taking note of. ", "I have very high hopes for the Kermit as not only a great looking and highly unusual Rolex, but also as a solid investment piece for the future. This is really the first time Rolex introduced color to its stainless steel Submariner and as an anniversary piece coupled with the variances and its relatively short production life, it is still a highly undervalued watch. "], "productCr": "This Rolex Submariner 11610LV Kermit is in excellent condition. There are minor hairlines and scuffs from use visible in the photograph but remains in an overall excellent state. It comes as a full set with its original box (inner, outer, sleeve), punches papers from 2005, booklet and manual.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610LV_Kermit_B3_Lime_0046_Layer_41.jpg?v=1577430135", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610LV_Kermit_B3_Lime_0038_Layer_79.jpg?v=1577430204", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610LV_Kermit_B3_Lime_0044_Layer_43.jpg?v=1577430204", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610LV_Kermit_B3_Lime_0037_Layer_89.jpg?v=1577430204", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610LV_Kermit_B3_Lime_0039_Layer_78.jpg?v=1577430204", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610LV_Kermit_B3_Lime_0043_Layer_44.jpg?v=1577430204", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610LV_Kermit_B3_Lime_0045_Layer_42.jpg?v=1577430204", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610LV_Kermit_B3_Lime_0041_Layer_46.jpg?v=1577430204", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610LV_Kermit_B3_Lime_0040_Layer_47.jpg?v=1577430204", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610LV_Kermit_B3_Lime_0042_Layer_45.jpg?v=1577430204"]},
{"productYear": "2000's", "title": "Vianney Halter Classic", "productPrice": null, "productDescription": ["It is not often the case we can call a watch entirely unique and original, but if someone were to get close, Vianney Halter would have to be in the conversation. One of the early pioneers of the independent movement, Vianney Halter existed before collecting independents a trend. Small scale and taking his time, he has become known today for his distinctive aesthetic. ", "This is the Vianney Halter Classic, one of his most iconic, next to the more complicated Antiqua. A time-only piece, it is housed in a 36mm 18k yellow gold case and features real rivets on the edge of the case along with a studded crown. Two nibs on the top and bottom of the case connect the lugs which hold the strap, rounding off this undoubtedly steampunk style watch. The case is finished with a circular brushing at the top and polished sides, adding a nice depth to the overall look. Wearing and winding the watch, I found it to be a very pleasant tactile experience, from the grip of the studded crown and touching the different surfaces of the watch. ", "The dial is incredibly beautiful on this Classic, with radial stylized Arabic numerals sitting atop a circular brushed silver surface. Towards the center of the dial, there is contrast with the graining and this is topped off with the delicately beautiful curved blued hands. ", "Powering this watch is a heavily modified Lemania 8810 with a mystery ‘sapphire’ rotor that allows the user to see the movement undisturbed. There are weights on the periphery of the rotor to allow effective oscillation and the movement looks simple but is nevertheless expertly finished with curved angles along the way. ", "At a first glance, the Vianney Halter Classic looks like a relatively simple and novel watch, but the more you look at it the more you realize how much attention to detail has gone into it- from the case design to the textures of the dial and finishing of the movement. Limited to 250 pieces and released in 2001, this is truly a rare and exclusive watch that looks completely unique to what is available in the market today. "], "productCr": "This Vianney Halter is in very good condition. It is unpolished and retains all of its original finishing. It comes as a full set with box and papers and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney_Halter_Classique_Rose_Gold_0022_Layer_65.jpg?v=1574419057", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney_Halter_Classique_Rose_Gold_Creative_0022_Layer_6.jpg?v=1574419057", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney_Halter_Classique_Rose_Gold_0025_Layer_62.jpg?v=1574419057", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney_Halter_Classique_Rose_Gold_0026_Layer_61.jpg?v=1574419057", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney_Halter_Classique_Rose_Gold_Creative_0023_Layer_5.jpg?v=1574419057", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney_Halter_Classique_Rose_Gold_0024_Layer_63.jpg?v=1574419057", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney_Halter_Classique_Rose_Gold_0023_Layer_64.jpg?v=1574419057", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney_Halter_Classique_Rose_Gold_0028_Layer_59.jpg?v=1574419057", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney_Halter_Classique_Rose_Gold_0027_Layer_60.jpg?v=1574419057"]},
{"productYear": "2018", "title": "IWC Pilot for The Rake and Revolution", "productPrice": null, "productDescription": ["Limited editions and collaborations are no new things these days, with one seeming to pop up nearly every time you look at the news and for this IWC Pilot for The Rake and Revolution is no different. Well, sort of. ", "It is often the case that collectors lament the disparity between what they are looking for and what brands ‘think’ they want, often resulting in watches that end up ultimately as failures. That being said, once in a while you do get pieces that really shine, and with this IWC Pilot, I’d have to say that it is certainly the case. ", "It’s quite simple really, of all the times new models have been successful, it has always come down to the attention to detail. When Wei Koh, the founder of The Rake and Revolution Magazine wanted to create a special piece from his brand, he worked with IWC to make sure that every detail was executed well. ", "IWC’s rich history producing military timepieces acted as the starting point, with this utilitarian aesthetic really forming the backbone of the brand’s design language today. Specifically, the Mk 11, issued to the British Royal Air Force in the late ’40s and early ’50s was the main inspiration behind this Pilot watch. The Mk 11 is perhaps the most iconic military watch that IWC has ever produced and despite a few re-editions, this specific model is the one to get. ", "The most amazing thing about this watch is that they chose to go against the market, and size it at 36mm, making it faithful to the original sizing of the Mk 11. Though it might seem small to some, the long lugs really add presence to the feel of the watch and wears larger overall. Without wanting it to be just another reissue, Wei and IWC decided to use a British Racing Green dial with a bronze case and I must say, the combined colors really work well.", "On top of this, they even went so far as to commission George Cleverly, one of England’s most esteemed shoemakers to produce the NATO straps. The material? Russian reindeer hide that was salvaged from a shipwreck in 1786. Yup, even the strap is special, and over 200 years old. ", "One nice thing about bronze watches is that it’ll develop a patina over time as it oxidizes. This oxidation can be removed easily, but it is part of the joy of a watch like this. Paired with the reindeer strap from George Cleverly, and you get a seriously rugged watch that is also special, with only 150 pieces made. I can confidently say that the team at IWC and the Rake/Revolution Magazine really knocked this one out of the park. "], "productCr": "This IWC Pilot for the Rake and Revolution is in mint condition. This piece has been hardly worn with its casebook sticker still in tact. The bronze case has oxidised slightly which is very normal and can be cleaned off if desired very easily. It comes as a full set with its box and papers, and the original George Cleverly Russian Reindeer strap.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Pilot_The_Rake_Revolution_0006_Layer_49.jpg?v=1575992996", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Pilot_s_The_Rake_Revolution_Creative__0021_Layer_7.jpg?v=1575993068", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Pilot_The_Rake_Revolution_0004_Layer_51.jpg?v=1575993068", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Pilot_s_The_Rake_Revolution_Creative__0019_Layer_9.jpg?v=1575993068", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Pilot_s_The_Rake_Revolution_Creative__0020_Layer_8.jpg?v=1575993068", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Pilot_s_The_Rake_Revolution_Creative__0018_Layer_16.jpg?v=1575993068", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Pilot_The_Rake_Revolution_0003_Layer_52.jpg?v=1575993068", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Pilot_The_Rake_Revolution_0005_Layer_50.jpg?v=1575993068", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Pilot_The_Rake_Revolution_0002_Layer_53.jpg?v=1575993066", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Pilot_The_Rake_Revolution_0001_Layer_54.jpg?v=1575993066"]},
{"productYear": "2013", "title": "Audemars Piguet Royal Oak 15202 Jumbo 'White'", "productPrice": null, "productDescription": ["The Royal Oak, with its masculine octagonal case, exposed screws and integrated bracelet is one of the most distinctive watches in the market today. It is imposing and recognisable, and in my opinion, one of the best statement watches money can buy. ", "The Royal Oak is not only famous for what it looks like, but also how it was introduced. First released in the ’70s, the original Ref. 5402 was a bold stainless steel watch designed by Gerald Genta that created shockwaves. It was designed as a luxury sports watch and the scandalous part was that it was priced accordingly- the same as an equivalent gold watch of its era. ", "While to most, every Royal Oak looks the same, to those who know- the reference 15202 sits above and beyond the rest both in aesthetics and demand. While Audemars Piguet has made many variants of time-only Royal Oaks, the 15202 is the one that is most faithful to the original Ref. 5402 and as such, shares the ‘Jumbo’ nickname. Sized at 39mm and using the same JLC derived Cal. 2121 as the original, this is the Royal Oak for the purists. Two hands, 8.1mm and a beautiful sapphire case back with a decorate rotor- it sits with perfect proportionality on the wrist. "], "productCr": "This Audemars Piguet Royal Oak 15202 is in very good condition. The case is unpolished retains its sharp angels. There are some minor scuffs on the bracelet from previous use. This example comes as a full set with its inner and outer box, manuals and guarantee. The watch comes with all of its links and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-White-Front-Shot.jpg?v=1571384099", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-Creative.jpg?v=1571384099", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-White-Wrist-Shot.jpg?v=1571384099", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-White-AR-Shot.jpg?v=1571384099", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-White-and-Blue.jpg?v=1571384099", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-White-Movement-Shot.jpg?v=1571384099", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-White-AL-Shot.jpg?v=1571384099", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-White-Side-Shot-1.jpg?v=1571384099", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-White-Side-Shot.jpg?v=1571384099", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-Box-Shot.jpg?v=1571384070"]},
{"productYear": "1990s", "title": "Patek Philippe 3940J Perpetual Calendar", "productPrice": null, "productDescription": ["The Patek Philippe Ref. 3940 is considered to be one of the most important pieces in Patek’s modern history, as it was the first highly complicated serially produced timepiece with a perpetual calendar alongside the perpetual calendar chronograph Ref. 3970. When looked at in context, the 3940 is significant in the sense that when it was released in 1985, Switzerland was in turmoil. An economic crisis in the Swiss watchmaking industry set upon by the Quartz crisis (or revolution depending on how you look at it), mechanical watches, a significant driver of the Swiss economy, had on paper become redundant. As an indicator of the drastic times and the effects felt, the number of people working in the Swiss watch industry dwindled from 90,000 to around 28,000 in the space of 18 years.", "During this time of uncertainty, Patek Philippe, then headed by Philippe Stern, surprisingly released the 3940 and 3970 as a pair. Big Swiss companies were not making complicated pieces at this time as the decline in the industry meant that there was no spare money for innovative investment but instead only enough to consolidate whatever market share they had left. To release a perpetual calendar and perpetual calendar chronograph at the same time, was certainly a bold move by Patek and the timing could not have been greater as the tide was slowly turning with people realizing the value of mechanical watches. This is partly because looking at a mechanical watch and its movement is a very relatable experience, where you can see how it works, how it is all connected, unlike a quartz watch that is powered by an incomprehensible chipboard. Perhaps it has something to do with a universal appreciation we have for craftsmanship as a whole, but whatever it was, this watch is a significant bedrock as to how far Patek has come today despite the adversities it faced. It is no coincidence that Philippe Stern himself, who despite being in the position to wear any and as many Patek Philippe watches he wished, chose to wear a 3940 every day.", "Stepping back from the contextual significance of the 3940, the watch in itself is a marvel both in its design and movement. Housing the fantastically finished in-house perpetual calendar caliber 240 Q, one of its defining aspects is the integrated off-center micro-rotor, allowing this incredibly complicated watch to come in at an unbelievably slim 9mm. In order to ensure that a rotor that small could power the watch, it was made in 22k gold, with the extra weight providing more force to wind the watch.", "Making a perpetual calendar is no easy task, with 275 different parts and as testament to this, at the time it was released, there were only two people in the manufacture allowed to make watches this complicated. Sure, a perpetual calendar does not enjoy the same status as a chronograph, despite being more difficult to manufacture, as it lacks the tactile experience. But for a watch to have a memory of 4 years, accounting for the days in every month including February and the leap year, involves a large measure of skill. Add a moon phase and 24-hour clock on top and you start to understand the complexity of this.", "The aesthetics of the watch is an exercise in restraint, a timeless design combining the need for legibility with a beautiful symmetry of subdials. It has a white opaline dial with yellow gold applied index markers and dauphine hands. Each sub-dial provides two sets of information, with the 3 o’clock sub-dial showing the leap year indicator and the day of the week, the 6 o’clock sub-dial showing the enamel moon phase and the day of the month, and finally the 9 o’clock sub-dial showing the 24-hour clock and the month. The sub-dials are systemized within concentric circles and in an obvious hierarchy, with the day, month and date on the outer track of the sub-dial, with the less important leap year indicator, moon phase and 24-hour clock inside it.  A cool little quirk of these 3940’s is in the 24-hour subsidiary dial. In what looks to be discoloration, the orange tint of the bottom half is actually a subtle indicator to show that it is night-time.", "The 36mm curved case sits proportionately elegant on the wrist and its ultra-slim profile completes what is perhaps one of the most understated and elegant timepieces. This watch comes with the angular tang buckle, which I much prefer than the more ornamental Calatrava deployant clasp.", "While it is true that the 3940 does not shout out, it is for this reason I love the watch so much. This idea that you can wear this watch with barely anyone noticing, but you yourself knowing you have something truly special on is very, very appealing to me. There is a real purity to the design where perfect symmetry was achieved, balancing both undeniable elegant aesthetics with a fantastic movement. It is no wonder this watch was in production from 1985-2006, one of the longest run in Patek’s history.", "(Several years ago, I wrote about the Patek Philippe 3940 here (", ") and it was one of my most personal articles due to the fact that I myself own a piece, which was passed down to me by my father. This written description is from that article and while the 5040 is a different watch, it holds a lot of the same principles as the 3940 as shares the same complication and movement as I feel it illustrates why this is such a fantastic watch very well.)"], "productCr": "This Patek Philippe 3940J is in excellent condition. It was worn carefully in the past and has little to no scratches. This example comes as a full set with its inner and outer box and certificate of origin. It is fully functional with the perpetual calendar working and the watch keeping time.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-3940J-Perpetual-Calendar-Front-Shot.jpg?v=1570001077", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-3940J-Perpetual-Calendar-Creative.jpg?v=1570001077", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-3940J-Perpetual-Calendar-Creative-1.jpg?v=1570001077", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-3940J-Perpetual-Calendar-AR-Shot.jpg?v=1570001077", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-3940J-Perpetual-Calendar-AL-Shot.jpg?v=1570001077", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-3940J-Perpetual-Calendar-Wrist-Shot.jpg?v=1570001077", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-3940J-Perpetual-Calendar-Movement-Shot.jpg?v=1585219328", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-3940J-Perpetual-Calendar-Side-Shot.jpg?v=1570001077", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-3940J-Perpetual-Calendar-Movement-Shot-2.jpg?v=1585213713", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-3940J-Perpetual-Calendar-Side-Shot-2.jpg?v=1570001077", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-3940J-Perpetual-Calendar-Creative-4.jpg?v=1570001077", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-3940J-Perpetual-Calendar-Creative-5.jpg?v=1570001077", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-3940J-Perpetual-Calendar-Creative-2.jpg?v=1570001068", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-3940J-Perpetual-Calendar-Buckle-Shot.jpg?v=1570001068", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-3940J-Perpetual-Calendar-Buckle-Shot-2.jpg?v=1570001068"]},
{"productYear": "1990's", "title": "Rolex Day-Date 18238", "productPrice": null, "productDescription": ["The Rolex Day-Date, without a doubt, has to be one of the most iconic watches ever produced. Even to those who don’t know about watches, the Day-Date is something that is instantly recognizable. First released in 1956, it has evolved over many references and the 18238 you see here today sits somewhere in the middle. ", "Many would consider the Ref. 18238 as the perfect balance between vintage looks and modern usability. On one hand, you get the perfect vintage case style and size while the newly improved (at the time) Cal. 3155 provides you with a double quickset function so you can easily set the day and date.", "One rule that has stuck to the Day-Date since day one is that it was only to be produced in precious metals, with yellow gold being the preferred choice. Also, interestingly, the Day-Date was the first watch ever produced that showed the day in full on the dial. ", "Quickly, with Rolex’s iconic branding and reputation for high quality, it became one of the most revered luxury watches and became know as ‘the President’. While the Day-Date was certainly a luxury watch, it was also built like a tank as per Rolex’s standards, most notably being housed in an Oyster case. ", "Rolex made many Day-Dates in all sorts of configurations with different precious metals and dial variants, opening up a whole wormhole of collecting today. Although, there is something to be said about the purity of the basic, clean Day-Date. Silver sunburst dial, 18k yellow gold case- no diamonds, no fancy stone dials. It’s loud without shouting, it’s gold without the bling. "], "productCr": "This Rolex Day Date 18238 is in good condition. It comes as a watch only and 100% original and all parts are correct. The case remains in good condition with thick even lugs. The casebook hallmarks remains deep and visible. There is very minor stretch to the bracelet and it remains in excellent condition with the Rolex logo at the clasp still sharp. This watch is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-18238-2_0042_Layer-85.jpg?v=1574420112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Day_Date_18238_2_Creative_0005_Layer_23.jpg?v=1574420112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Day_Date_18238_2_Creative_0004_Layer_24.jpg?v=1574420112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Day_Date_18238_2_0044_Layer_83.jpg?v=1574420112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Day_Date_18238_2_Creative_0006_Layer_22.jpg?v=1574420112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Day_Date_18238_2_0047_Layer_80.jpg?v=1574420112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Day_Date_18238_2_0049_Layer_78.jpg?v=1574420112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Day_Date_18238_2_0048_Layer_79.jpg?v=1574420106", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Day_Date_18238_2_0046_Layer_81.jpg?v=1574420106", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Day_Date_18238_2_0045_Layer_82.jpg?v=1574420106", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Day_Date_18238_2_0043_Layer_84.jpg?v=1574420106"]},
{"productYear": null, "title": null, "productPrice": null, "productDescription": [], "productCr": null, "images": []},
{"productYear": "2014", "title": "Jaeger-LeCoultre Geophysic 1958", "productPrice": null, "productDescription": ["The Jaeger-LeCoultre Geophysic was first released in 1958 and it had one goal in mind- to be as durable and precise as a wristwatch can be. Made for extreme conditions and exploration, it was produced both as a celebration of Jaeger-LeCoultre’s 125th anniversary and also the world’s first International Geophysical Year. This was a global effort by 67 countries to encourage scientific progress in exploration and experimentation relating to geophyiscs. The result was the Geophysic Chronometer Ref. E 168 and it was a highly precise watch powered by one of the greatest movements ever conceived,", "the in-house caliber P 478 BWSBr. It was a chronometer grade movement that featured anti-magnetic properties, Kif shock resistance, a Glucydur balance spring to keep it protected from temperature change and the now famous swan-neck regulator. As this was a super specialised watch, just over a thousand examples were produced and today the E 168 is considered one of the rarest and most desirable vintage watches in the world. "], "productCr": "This Jaeger-LeCoultre Geophysic 1958 comes as a full set with its inner and outer box, loupe, hangtag, dated guarantee certificate, operating instructions, and timepiece registration card. It is in very good condition with minor hairlines and is in full working order. It comes with its original black alligator strap and signed tang buckle.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-2_0026_Layer-32.png?v=1596701037", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-2_0001_Layer-106.png?v=1596701037", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-2_0025_Layer-34.png?v=1596701037", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-2_0002_Layer-105.png?v=1596701037", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-2_0023_Layer-36.png?v=1596701037", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-2_0003_Layer-104.png?v=1596701037", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-2_0005_Layer-98.png?v=1596701037", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-2_0024_Layer-35.png?v=1596701037", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-2_0004_Layer-102.png?v=1596701037", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-2_0027_Layer-33.png?v=1596701037", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-2_0022_Layer-37.png?v=1596701037", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-2_0021_Layer-38.png?v=1596701037"]},
{"productYear": "2018", "title": "Audemars Piguet Royal Oak 15202 Jumbo 'Blue'", "productPrice": null, "productDescription": ["The Royal Oak, with its masculine octagonal case, exposed screws and integrated bracelet is one of the most distinctive watches in the market today. It is imposing and recognizable, and in my opinion, one of the best statement watches money can buy. ", "While to most, every Royal Oak looks the same, to those who know- the reference 15202 sits above and beyond the rest both in aesthetics and demand. While Audemars Piguet has made many variants of time-only Royal Oaks, the 15202 is the one that is most faithful to the original Ref. 5402 and as such, shares the ‘Jumbo’ nickname. Sized at 39mm and using the same JLC derived Cal. 2121 as the original, this is the Royal Oak for the purists. Two hands, 8.1mm and a beautiful sapphire case back with a decorate rotor- it sits with perfect proportionality on the wrist. ", "In fact, many of you should know by now, that the blue dial Jumbo you see here today is probably the most desired and hardest to get Royal Oak from an authorized dealer. As a boutique exclusive, only existing clients that have bought many other APs are allocated one, with dealers only getting in a piece or two a year. As a result, there is a huge premium on the used market for examples like this. ", "I must say, I get why people are so in love with the blue Jumbo. The blue dial really shimmers in the light and throws off different shades of blue depending on the light source. While on my wrist, I often find myself just staring at the dial, not even knowing what time it is. "], "productCr": "This Audemars Piguet Royal Oak 15202 is in very good condition. The bezel and case are free from scratches and retains its original unpolished finish. There are some very minor scuffs on the bracelet from previous use.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-Blue-Front-Shot.jpg?v=1571384277", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-Blue-Creative.jpg?v=1571384277", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-Blue-Creative-1.jpg?v=1571384277", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-Blue-AR-Shot.jpg?v=1571384277", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-Blue-Wrist-Shot.jpg?v=1571384277", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-Blue-AL-Shot.jpg?v=1571384277", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-Blue-Movement-Shot.jpg?v=1571384277", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-Blue-Side-Shot.jpg?v=1571384277", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-White-and-Blue_e8677b43-6c76-48bf-9221-67b492609a9b.jpg?v=1571384277", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202-Jumbo-Blue-Side-Shot-1.jpg?v=1571384277"]},
{"productYear": "2019", "title": "Rolex GMT-Master Batman 116710 BLNR", "productPrice": null, "productDescription": ["The Rolex GMT-Master needs no introduction. It is perhaps the most iconic travel watch, allowing its wearer to simultaneously tell two time zones. Developed originally in the 1950s for PanAm pilots, who had then begun flying transatlantic route more frequently, this handy tool watch was vital in order to track home and local time. Over the decades, Rolex has continually tweaked and evolved the model and despite huge changes since the first reference 6542, it is still instantly recognisable as the iconic GMT-Master.", "The example you see here today is the Ref. 116710 BLNR and it is a modern classic. Any sports Rolex is currently hard to get, but the BLNR rose to be one of the hottest, before being discontinued this year. ", "For the longest time, Rolex could not figure out how to have two colours in one bezel as it was made of ceramic and insanely difficult to do so. They managed to finally do it with this Batman and it was a huge success and a welcome change to the more monotonous all-black bezel. It certainly adds a nice touch of colour in a subtle way. ", "I really do feel that the GMT function is the most practical complication to have on the wrist, even today. All it takes is one look at the wrist and you will be able to tell the time at your selected timezone. For someone like me, or I am sure many of you, who travels a lot or even conducts business on the other side of the world, a GMT-Master is without a doubt, a welcome tool. It certainly is faster than fumbling around with your iPhone to find out the time. "], "productCr": "This Rolex GMT-Master II 116710 BLNR is in mint condition. It has no scratches and has been worn very carefully. It is in full working order and comes as a full set with its inner and outer box, sleeve, warranty card and manual.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_GMT_Master_116710_BLNR_0050_Layer_77.jpg?v=1574419203", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_GMT_Master_116710_BLNR_0052_Layer_75.jpg?v=1574419231", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_GMT_Master_116710_BLNR_0053_Layer_73.jpg?v=1574419231", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_GMT_Master_116710_BLNR_0056_Layer_71.jpg?v=1574419231", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_GMT_Master_116710_BLNR_0055_Layer_72.jpg?v=1574419231", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_GMT_Master_116710_BLNR_0054_Layer_74.jpg?v=1574419231", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_GMT_Master_116710_BLNR_0051_Layer_76.jpg?v=1574419203"]},
{"productYear": "2018", "title": "Habring Erwin LAB 01 for Massena Lab", "productPrice": null, "productDescription": ["Habring is a relatively new brand that has been turning heads, largely due to their amazingly well-designed pieces and in-house, high-quality movements at very attractive price points. With vintage styling and unique complications, they are a darling amongst true watch collectors. ", "Massena Lab, on the other hand, was started by industry heavyweight and veteran, William Massena with the idea of collaborating with existing brands to produce pieces in series. When the two brands came together, we all knew it was going to be good. ", "The result is what you see here, the Erwin LAB01. Housed in a 38.5mm polished bronze case, this in itself is a highly unusual finish for bronze, giving off a feel more akin to yellow gold. The oxidization on the case will occur adding a vintage feel to the watch but rest assured, it can be cleaned off easily if you want to return to that high shine finish. Moving on to the dial, it is reminiscent of vintage Patek Philippe Ref. 96 sector dials and it is just stunning. With gold numerals and indexes recessed into the black dial, you do get a very vintage feel and depth that a-lot of modern watches miss out on. Flipping the watch over and you are greeted with the Habring in-house Cal. A11s movement. It is a dead beat movement, which makes sense together with the sector dial and it is a very pretty sight. ", "All in all 50 pieces of this Erwin LAB01 were made and as expected, it sold out in a flash. It is truly a limited edition timepiece (not in the hundreds or thousands) produced with passion and overall it is just a downright good looking watch. "], "productCr": "This Habring Erwin LAB01 for Massena Lab is in mint condition. There is some oxidation on the case which is inevitable for bronze watches and it can be cleaned off easily. The watch is in full working order and comes as a full set with its box and papers.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Habring_Massena_Lab_Erwin__0001_Layer_51.jpg?v=1574420438", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Habring_Massena_Lab_Erwin_Creative_0010_Layer_18.jpg?v=1574420438", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Habring_Massena_Lab_Erwin__0003_Layer_49.jpg?v=1574420438", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Habring_Massena_Lab_Erwin__0004_Layer_48.jpg?v=1574420438", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Habring_Massena_Lab_Erwin_Creative_0009_Layer_19.jpg?v=1574420438", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Habring_Massena_Lab_Erwin__0002_Layer_50.jpg?v=1574420438", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Habring_Massena_Lab_Erwin_Creative_0007_Layer_21.jpg?v=1574420438", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Habring_Massena_Lab_Erwin_Creative_0011_Layer_17.jpg?v=1574420437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Habring_Massena_Lab_Erwin_Creative_0008_Layer_20.jpg?v=1574420437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Habring_Massena_Lab_Erwin__0006_Layer_46.jpg?v=1574420437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Habring_Massena_Lab_Erwin__0005_Layer_47.jpg?v=1574420437"]},
{"productYear": "1987", "title": "Patek Philippe Nautilus 3800", "productPrice": null, "productDescription": ["I guess I have to begin by saying what everyone already knows: The Nautilus has to be the most popular watch of the last five years, especially in blue. With the modern 5711 trading at multiples of its retail and the vintage Jumbo 3700 trading for even more, most people were priced out of these examples. ", "Well, good thing Patek had a mid-size sibling to go along the Jumbo back in the day and as a result of these premiums, the prices of these have followed too. The 3800 was introduced at a time when the Nautilus was still seen as a brash, anti-Patek watch. Clients and critics alike were used to seeing elegant dress watches and were perhaps shocked to see that they followed in the footsteps of Audemars Piguet’s Royal Oak when they introduced the 3700 in the 70’s. Not to mention using the same designer in Gerald Genta! Furthermore, watch sizes of that era were much smaller, so to have a 42mm piece was considered hugely oversized. This is where the 3800 fits in, sized at 38mm and more acceptable to the general public. ", "The 3800 is every bit as good as its larger sibling and featuring the same mono bloc case with beautiful finishing throughout. Every surface is brushed and polished and when it reflects light it simply looks amazing. The blue dial with its horizontal stripes looks so good in the light and depending on the conditions reflects of different hues of blue, green, black and grey. It is no wonder blue dials are so hot right now. ", "It’s hard not to love the Nautilus, despite the mainstream craze as once you strap it onto your wrist, you begin to understand why. "], "productCr": "This Patek Philippe Nautilus 3800 is in excellent t condition and all original. The stainless steel case retains its correct brushed and polished surfaces and the bevels still remain in tact and sharp. It comes as a watch only along with an extract from the archives.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Front-Shot.jpg?v=1571383563", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Creative-2.jpg?v=1571383563", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-AL-Shot.jpg?v=1571383563", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Wrist-Shot.jpg?v=1571383563", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-AR-Shot.jpg?v=1571383563", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Creative.jpg?v=1571383563", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Side-Shot-1.jpg?v=1571383563", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Side-Shot.jpg?v=1571383563", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Clasp-Shot.jpg?v=1571383485", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Caseback-Shot.jpg?v=1571383485"]},
{"productYear": "2019", "title": "Rolex GMT-Master Pepsi 126710 BLRO", "productPrice": null, "productDescription": ["The Rolex GMT-Master needs no introduction. It is perhaps the most iconic travel watch, allowing its wearer to simultaneously tell two time zones. Developed originally in the 1950s for PanAm pilots, who had then begun flying transatlantic route more frequently, this handy tool watch was vital in order to track home and local time. Over the decades, Rolex has continually tweaked and evolved the model and despite huge changes since the first reference 6542, it is still instantly recognisable as the iconic GMT-Master.", "The example you see here today is the Ref. 126710 BLRO and it is one of the newest and hottest GMT-Masters at the moment. Go into any AD and they will tell you of the years-long waitlist and what other less desirable Rolex you have to buy first to get a chance. It certainly is simply controlling the supply in order to prop up demand, but all of that aside, I really do see the appeal of this. ", "For the longest time, Rolex could not figure out how to have two colours in one bezel as it was made of ceramic and insanely difficult to do so. They managed to finally do it with the Batman and it was a huge success, but the black and blue bezel was much easier to produce as the tones of colour was much closer together. Without a doubt, the iconic colours of the GMT-Master is red and blue, or ‘Pepsi’ as collectors call it and since the introduction of the ceramic bezel in the 2000s, there had been no Pepsi- that is until Rolex teased us 2014. I still remember, everyone was so excited to finally have a Pepsi ceramic GMT and when it was released, they only did it in white gold! I was certainly on a budget back then and my Pepsi dreams went out the window in a flash. ", "Furthermore, the new GMT-Master, to everyone’s surprise, came with a jubilee bracelet. I suppose it was to differentiate it to the white gold model and while some people didn’t like it very much, after handling and wearing this example, I must say that I am a huge fan.", "I really do feel that the GMT function is the most practical complication to have on the wrist, even today. All it takes is one look at the wrist and you will be able to tell the time at your selected timezone. For someone like me, or I am sure many of you, who travels a lot or even conducts business on the other side of the world, a GMT-Master is without a doubt, a welcome tool. It certainly is faster than fumbling around with your iPhone to find out the time. "], "productCr": "This Rolex GMT-Master II 126710 BLRO is in mint condition. It has no scratches and has been worn very carefully. It is in full working order and comes as a full set with its inner and outer box, sleeve, warranty card and manual.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_GMT_Master_126710_BLNR_0057_Layer_70.jpg?v=1574419411", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_GMT_Master_126210_BLRO_Pepsi_Creative_0001_Layer_30.jpg?v=1574419411", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_GMT_Master_126210_BLRO_Pepsi_Creative_0002_Layer_29.jpg?v=1574419411", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_GMT_Master_126210_BLRO_Pepsi_Creative_0003_Layer_28.jpg?v=1574419411", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_GMT_Master_126710_BLNR_0059_Layer_68.jpg?v=1574419411", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_GMT_Master_126710_BLNR_0061_Layer_67.jpg?v=1574419411", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_GMT_Master_126710_BLNR_0060_Layer_66.jpg?v=1574419411", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_GMT_Master_126710_BLNR_0058_Layer_69.jpg?v=1574419411"]},
{"productYear": "2013", "title": "Rolex Cosmograph Daytona 116520", "productPrice": null, "productDescription": ["I really don’t think I need to go too much into the Daytona as anyone who is anyone knows about this watch. It has always been the case that the ultimate Rolex is ironically not a solid gold President Day-Date, but the Cosmograph Daytona. With waitlists in the years to authorised dealers these days not even entertaining you unless you’ve bought another Rolex before, the Daytona is without a doubt the most desirable and hardest to get Rolex in the market today. ", "This example is the discontinued reference 116520 and the introduction of this reference marked a historical change for Rolex where in the year 2000, they moved away from using outsourced chronograph movements, to their new, in-house Calibre 4130. Prior to this in the 16520 model, Rolex used a Zenith El Primero movement and prior to that, Valjoux ebauches on the 62XX series.", "Part of the allure of the Daytona certainly has to be its look, with its sleek stainless steel case and glossy black dial, on the wrist it just works amazingly well. As this reference has been succeeded by the newer 116500, I know that the 116520 will soon become more and more sought after and collectable. "], "productCr": "This Rolex Cosmograph Daytona is in mint condition. It is from 2013 and features blue Chrmoalight lume. The watch is in full working order and it comes as a full set with its inner and outer box, and warranty card.   ", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116520-Front-Shot.jpg?v=1568354669", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116520-AR-Shot.jpg?v=1568354669", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116520-AL-Shot.jpg?v=1568354669", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116520-Caseback-Shot.jpg?v=1568354669", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116520-Side-Shot-1.jpg?v=1568354669", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116520-Side-Shot.jpg?v=1568354669", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116520-Bracelet-Shot.jpg?v=1568354669"]},
{"productYear": "1991", "title": "Rolex Day-Date 18238 Full Set", "productPrice": null, "productDescription": ["The Rolex Day-Date, without a doubt, has to be one of the most iconic watches ever produced. Even to those who don’t know about watches, the Day-Date is something that is instantly recognizable. First released in 1956, it has evolved over many references and the 18238 you see here today sits somewhere in the middle. ", "Many would consider the Ref. 18238 as the perfect balance between vintage looks and modern usability. On one hand, you get the perfect vintage case style and sizing while the newly improved (at the time) Cal. 3155 provides you with a double quickset function so you can easily set the day and date.", "One rule that has stuck to the Day-Date since day one is that it was only to be produced in precious metals, with yellow gold being the preferred choice. Also, interestingly, the Day-Date was the first watch ever produced that showed the day in full on the dial. ", "Quickly, with Rolex’s iconic branding and reputation for high quality, it became one of the most revered luxury watches and became know as ‘the President’. While the Day-Date was certainly a luxury watch, it was also built like a tank as per Rolex’s standards, most notably being housed in an Oyster case. "], "productCr": "This Rolex Day Date 18238 is in stunning condition. It has an unpolished case with a super sharp bracelet with minor stretch. The original finish and hallmarks remain on the case and the lugs are thick and even. The dial is flawless with no tarnishing and all luminous plots remain in tact.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-18238-Full-Set-Front-Shot_5d7d6311-ce9e-4050-b4ab-0bb6b28d21e0.jpg?v=1571383270", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-18238-Full-Set-Creative_1447c0c0-6931-48d2-853d-e0594fdb62fa.jpg?v=1571383270", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-18238-Full-Set-AR-Shot_94ce2edf-3270-4e0c-b9b6-4cd377a3befd.jpg?v=1571383270", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-18238-Full-Set-Wrist-Shot_1df54b6a-c0bf-44d1-be60-79b5b76a95cc.jpg?v=1571383270", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-18238-Full-Set-AL-Shot_40253884-30a3-43c2-a0fc-9650acb9812a.jpg?v=1571383270", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-18238-Full-Set-Side-Shot_91a6f55a-a662-4983-9873-c28af075bc99.jpg?v=1571383270", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-18238-Full-Set-Side-Shot-2_8bcdc97d-22d4-47f1-87c1-6d37d62d8f81.jpg?v=1571383270", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-18238-Full-Set-Caseback-Shot_747a5338-f502-4b34-ade4-1c06e2ccd2b9.jpg?v=1571383270", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-18238-Full-Set-Buckle-Shot_493abc20-4660-4072-8313-98d7da4dcfb7.jpg?v=1571383270", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-18238-Full-Set-Bracelet-Shot_4932a37d-517d-4fcd-911b-d6d9676b441c.jpg?v=1571383270"]},
{"productYear": null, "title": null, "productPrice": null, "productDescription": [], "productCr": null, "images": []},
{"productYear": "2017", "title": "Omega Speedmaster Racing 'Tin Tin'", "productPrice": null, "productDescription": ["While the Omega Speedmaster was created as a racing watch, with its chronograph function and tachymeter scale, today this has long been forgotten and instead has become more famous for its exploits in space. Known as the ‘Moonwatch’, the Omega Speedmaster Professional made history by being flight-qualified by NASA for all manned space flights and becoming the first watch worn on the moon when it was on the wrists of astronauts during the Apollo 11 mission in 1969. ", "The story was uncovered by the good guys at Fratello Watches, where they figured out that this Omega ‘Racing’ Speedmaster was actually supposed to be an official collaboration with Hergé the owners of Tin Tin. The red and white colours you see on the dial are representative of the similarly coloured rocket ship that Tin Tin used in the comic strips to land on the moon. Working together, Omega actually created this dial with a rocket ship on the subdial and a special caseback but towards the tail end, Hergé decided to pull out, leaving Omega with all of these dials. "], "productCr": "This Omega Speedmaster Tin Tin is in mint condition. It comes with an unused Omega Speedmaster bracelet with its stickers still attached. Furthermore, it comes complete as a full set with its inner and outer box, international warranty, pictogram card, operating instructions and hang tag.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Tin-Tin-Front-Shot.jpg?v=1552042498", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Tin-Tin-Creative-Shot.jpg?v=1552042498", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Tin-Tin-Wrist-Shot.jpg?v=1552042498", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Tin_Tin-AR-Shot.jpg?v=1552042498", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Tin_TIn-AL-Shot.jpg?v=1552042498", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Tin_Tin-Caseback-Shot.jpg?v=1552042498", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Tin-Tin-Side-Shot.jpg?v=1552042498"]},
{"productYear": "1990's", "title": "Omega Speedmaster Mk40", "productPrice": null, "productDescription": ["While the Omega Speedmaster is more famous today for being the watch that NASA used back in the ’60s and ’70s, it's important to remember that this model started out as a racing watch and with the Mk40 produced in the ’90s, its clear to see that Omega hasn't forgotten.", "The Mk40 is perhaps one of the more unusual looking Speedmasters, with a triple calendar function, day night indicator and a whole host of funky colours. Made as a kind of commemoration to Michael Schumacher, today it is most famous for being the most important watch the founder of Hodinkee, Ben Clymer has. Citing this watch as a gift from his grandfather and the inspiration that started Hodinkee, it has in recent times become one of the most recognisable Speedmaster variants. This piece is further cemented as a future collectable as Hodinkee worked with Omega last year to reissue the piece as part of their 10 year anniversary. "], "productCr": "This Omega Speedmaster Mk40 is in excellent condition. It comes with its inner and outer box, hang tag, instructions manual but it is missing its papers. It also comes with its original bracelet and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Mk-40-Front-Shot.jpg?v=1560938614", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Mk-40-Creative.jpg?v=1560938614", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Mk-40-Wrist-Shot.jpg?v=1560938614", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Mk-40-AR-Shot.jpg?v=1560938614", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Mk-40-AL-Shot.jpg?v=1560938614", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Mk-40-Caseback-Shot.jpg?v=1560938614"]},
{"productYear": null, "title": null, "productPrice": null, "productDescription": [], "productCr": null, "images": []},
{"productYear": "2018", "title": "Omega Speedmaster Hodinkee Edition", "productPrice": null, "productDescription": ["While the Omega Speedmaster was created as a racing watch, with its chronograph function and tachymeter scale, today this has long been forgotten and instead has become more famous for its exploits in space. Known as the ‘Moonwatch’, the Omega Speedmaster Professional made history by being flight-qualified by NASA for all manned space flights and becoming the first watch worn on the moon when it was on the wrists of astronauts during the Apollo 11 mission in 1969. ", "As a result, the Speedmaster has become a cult icon, and it's hard not to see why. Collectors can buy into such a great story and with a generation that grew up idolising space travel and astronauts, this watch would certainly have to be one of the most important wristwatches ever made. ", "Straightway you can see that the colour scheme has been maintained, with accents of blue and red. Though the triple calendar function was omitted, the spirit of the Mk 40 is very evident. Housed in a straight lug Speedmaster case as supposed to the more traditional lyre lug case, this was a nod to Ben’s vintage roots. ", "Made in an edition of 500, it quickly sold out and I have no doubt that this will be one of the more collectable limited edition Speedmasters in the years to come. "], "productCr": "This watch is brand new and has never been worn.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Hodinkee-Front-Shot.jpg?v=1552042341", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Hodinkee-Creative-Shot1.jpg?v=1552042341", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Hodinkee-Creative-Shot.jpg?v=1552042341", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Hodinkee-AR-Shot.jpg?v=1552042341", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Hodinkee-AL-Shot.jpg?v=1552042341", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Hodinkee-Caseback-Shot.jpg?v=1552042341", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Hodinkee-Side-Shot.jpg?v=1552042341"]},
{"productYear": "2011", "title": "Patek Philippe Aquanaut 5167A", "productPrice": null, "productDescription": ["The Patek Philippe Aquanaut needs no introduction. Launched in 1997 to attract a younger crowd, it was priced as an entry-level Patek Philippe made in stainless steel and equipped with a rubber strap. Marketed as a luxury sports watch and as a younger sibling to the Nautilus, it was not exactly loved when it was first released and it was seen as blasphemous to the identity of Patek Philippe. Fast forward to today and it is one of the hottest offerings from the manufacture. ", "Powering this watch is the in-house self-winding calibre 324 S C, which is also found on the Nautilus. It has a 21k solid gold central rotor and excellent finishing throughout. This Aquanaut 5167A has a power reserve of 45 hours.", "I am sure you didn’t need to read the above for you to decide whether you love this piece or not. It is one of the most in-demand watches produced today and the perfect do-anything watch in my opinion. "], "productCr": "This Patek Philippe Aquanaut is in excellent condition. It has a minor scuff on the bezel around 8 o’clock but other than that it is mint. It also comes with its inner and outer box, dated certificate of origin papers in its leather holder, an extra brand new uncut black Patek Philippe rubber strap and the labeled cardboard box it came sealed in. It is fully functional and keeping time.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-Front-Shot.jpg?v=1567416354", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-Creative.jpg?v=1567416354", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-AL-Shot.jpg?v=1567416354", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-Wrist-Shot.jpg?v=1567416354", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-AR-Shot.jpg?v=1567416354", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-Creative-3.jpg?v=1567416354", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-Side-Shot-2.jpg?v=1567416354", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-Side-Shot.jpg?v=1567416354", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-Creative-4.jpg?v=1567416354", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-movement-SHot.jpg?v=1567416354", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-5167A-Creative-2.jpg?v=1567416354"]},
{"productYear": "2017", "title": "Omega Speedmaster 60th Anniversary", "productPrice": null, "productDescription": ["While the Omega Speedmaster was created as a racing watch, with its chronograph function and tachymeter scale, today this has long been forgotten and instead has become more famous for its exploits in space. Known as the ‘Moonwatch’, the Omega Speedmaster Professional made history by being flight-qualified by NASA for all manned space flights and becoming the first watch worn on the moon when it was on the wrists of astronauts during the Apollo 11 mission in 1969. ", "As a result, the Speedmaster has become a cult icon, and it's hard not to see why. Collectors can buy into such a great story and with a generation that grew up idolising space travel and astronauts, this watch would certainly have to be one of the most important wristwatches ever made. The Speedmaster is not only an icon, but one of the most important watches ever created and 2017 marked 60 years since the first Speedmaster was introduced to the world. With that in mind, Omega wanted to create something special to commemorate this milestone, and the Speedmaster you see here is the result of that. ", "The first reference of Speedmaster ever released in 1957 was the CK2915-1 and it is by far the rarest and most desirable Speedmaster for collectors. The 60th anniversary Speedmaster is a faithful recreation of that model and with Omega so in touch with its vintage collectors of late, they really struck this one out of the park with the attention to details. ", "All in all, this was a huge success in my opinion and highly collectable. Made in a limited edition of 3,557 pieces, this is one of the best Speedmasters Omega have put out in a long, long time. "], "productCr": "This Omega Speedmaster 60th Anniversary is in mint condition. It comes with its Omega Flat Link Speedmaster Bracelet, Leather Strap and NATO strap. Furthermore, it comes complete as a full set with its inner and outer box, international warranty, pictogram card, operating instructions and hang tag.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-60-Anniversary-Front-Shot.jpg?v=1552042167", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-60-Anniversary-AR-Shot.jpg?v=1552042167", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-60-Anniversary-AL-Shot.jpg?v=1552042167", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-60-Anniversary-Movement-Shot.jpg?v=1552042167", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-60-Anniversary-Side-Shot.jpg?v=1552042167"]},
{"productYear": "2017", "title": "Rolex Sea Dweller 43 Ref. 126600", "productPrice": null, "productDescription": ["There are six iconic sport models that come out of the Crown in Geneva- the Daytona, the Submariner, the Explorer I & II, the GMT Master, the Milgauss and what you see here today, the Sea Dweller. While the Subs and GMTs are perennial favourites amongst anyone who ever gets into watches at some point, the Sea Dweller has always been leaning more on the professional side. With its unnecessarily deep depth rating and chunkier case, it was a true tool watch when it was released and remains so today.", "This is the Ref 126600 and it was released in 2017 celebrating the 50th anniversary of the Sea Dweller. Succeeding the Sea Dweller 4000, it received a couple of upgrades, most notably an upsize from 40 to 43mm. It remained 15mm thick with its helium valve on the left side of the case and overall, this is one hefty watch with huge presence. ", "One of the highlights of the Sea Dweller or any modern Rolex for that matter would have to be the bracelet. Rolex has always made the best bracelets and with this one, it is no different. As this is a dive watch, it features two expanding functions, one called the Glidelock, which allows you to extend the bracelet without any tools, and specific to diving, the Fliplock, which allows you to extend the bracelet even more for when wearing over wetsuits.", "Beating inside the Sea Dweller is a new and improved Cal. 3235, which features Rolex’s brand new Chronergy escapement, ensuring a much smoother flow of energy to power the watch. Furthermore, the power reserve has been upgraded from 48 to 70 hours. The 43mm case is made of the highest quality 904L steel has a ceramic bezel that is PVD coated in platinum for durability, is water resistant to 1220 meters and features Rolex’s own Chromalight lume, which glows blue and is the best in the industry.", "This Rolex Sea Dweller 43 is a true professional tool watch and is built like an absolute tank. The quality of any watch that comes out of Rolex is always unbelievable and it is all the little advancements that make Rolex who they are today. From constantly improving the bracelet to the Chronergy escapement, the pursuit of excellence in the Rolex HQ cannot be questioned. "], "productCr": "This Role Sea Dweller 126600 comes as a full set with its inner and outer box, plastic bezel protector, hang tag, guarantee manual, instructions manual, dated international guarantee card along with its green leather Rolex card holder. It comes with its full-length stainless steel Oyster Bracelet.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Sea-Dweller-43-Front-Shot.jpg?v=1544692440", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Sea-Dweller-43-126600-Creative-1.jpg?v=1544692440", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Sea-Dweller-43-126600-Wrist-Shot.jpg?v=1544692440", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Sea-Dweller-43-AR-Shot.jpg?v=1544692440", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Sea-Dweller-43-AL-Shot.jpg?v=1544692440", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Sea-Dweller-43-126600-Creative.jpg?v=1544692440", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Sea-Dweller-43-126600-Creative-2.jpg?v=1544692440", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Sea-Dweller-43-Caseback-Shot.jpg?v=1544692440", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Sea-Dweller-43-Side-Shot.jpg?v=1544692440", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Sea-Dweller-43-Clasp-Shot.jpg?v=1544692440"]},
{"productYear": "1990'S", "title": "Daniel Roth Small Seconds Salmon Dial", "productPrice": null, "productDescription": ["When we think of the big independents today, names such as Voutilainen, Dufour, Journe, and Smith come to mind. In fact, there is such a huge appreciation for independents today that is has become somewhat mainstream within collecting circles to own at least one watch from an independent brand. ", "Before all of this hype though, there was Daniel Roth. To be honest, in my opinion, the story of the Daniel Roth brand is a tragic one that could’ve worked out very differently. ", "To add some context, Daniel Roth was one of the most talented watchmakers of his generation and was responsible for many things you see today but do not realize. For one, he was a leading figure that established the design language of Breguet dress watches that you see today. In the ’60s and ’70s, Breguet had become a below-average watch brand with no future, until they were acquired by Chaumet, who in turn brought in Daniel Roth to lead the helm. The reference 3130, with its guilloche dial and its straight lugged case, set the tone for Breguet and was created by Daniel Roth. Moreover, he played a significant role in producing complicated movements for Lemania who may I remind you up until recently still provided the likes of Patek Philippe and Vacheron Constantin with chronograph calibers. ", "Looking closer, you will see the beautiful attention to detail on the watch, with a vertical guilloche dial reminiscent of his days in Breguet and a beautifully symmetrical design layout. The depth of the dial achieved through the recessed sub-dials is stunning and complemented by the elegant radial Roman numerals and blued steel hands. ", "I truly think that these Daniel Roth watches are hugely under-appreciated and it is a tragedy that the man himself does not get the recognition he deserves. Due to bad business decisions, several takeovers and just pure bad luck, the brand Daniel Roth eventually ended up with Bvlgari, who today absorbed his distinctive case shape and branded it under their own. Compared to the original Roth pieces, which were elegant, understated and beautiful, today’s reiteration by Bvlgari is a far cry from that- oversized and gaudy. It does make me sad to see such a great watch brand tarnished, but I am sure it will be a matter of time before his great work is appreciated again. ", "This early Daniel Roth in stainless steel and fitted with a salmon dial is extremely rare, with less than a handful of examples known to exist. "], "productCr": "This Daniel Roth Salmon Dial Small Seconds is in excellent condition. It comes as a full set with its inner and outer box and open papers, and original strap with its deployant clasp. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel_Roth_Salmon_Dial_0029_Layer_58.jpg?v=1574421427", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel_Roth_Salmon_Dial_Creative_0014_Layer_13.jpg?v=1574421427", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel_Roth_Salmon_Dial_0031_Layer_56.jpg?v=1574421427", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel_Roth_Salmon_Dial_Creative_0013_Layer_14.jpg?v=1574421427", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel_Roth_Salmon_Dial_Creative_0012_Layer_15.jpg?v=1574421427", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel_Roth_Salmon_Dial_0033_Layer_54.jpg?v=1574421427", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel_Roth_Salmon_Dial_0035_Layer_52.jpg?v=1574421427", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel_Roth_Salmon_Dial_0030_Layer_57.jpg?v=1574421427", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel_Roth_Salmon_Dial_0034_Layer_53.jpg?v=1574421427", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Daniel_Roth_Salmon_Dial_0032_Layer_55.jpg?v=1574421426"]},
{"productYear": "2017", "title": "Panerai Radiomir Oro Rosso PAM 379", "productPrice": null, "productDescription": ["Panerai as a brand is known for their large-sized tool watches that are instantly recognisable. With a very distinctive design language, they were extremely popular and gave birth to the name ‘Paneristi’, a term used by hardcore Panerai collectors to describe themselves. ", "The Calibre P.3000 is a very high-quality movement that has a power reserve of 3 days. The movement features bevelled edges on the bridges, polished screws and a fine machine brushing, topping off a beautifully finished calibre. A nice thing about this movement is that in the screw down crown’s first position, the hour hand can be set independently, making it very useful for travelling between time zones. "], "productCr": "This Panerai Radiomir 3 Days PAM 379 Oro Rosso comes as a full set with its inner and outer box, dated certificate of authenticity, dated guarantee certificate book, instruction manual, spare crystal and rubber bezel protector. It comes with its original dark brown alligator strap and 18k red gold tang buckle. It is in mint condition and in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Panerai-Radiomir-PAM-379-Oro-Rosso-Front-Shot.jpg?v=1544691808", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Panerai-Radiomir-3-Days-PAM-379-Oro-Rosso-Creative-1.jpg?v=1544691808", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Panerai-Radiomir-3-Days-PAM-379-Oro-Rosso-Creative.jpg?v=1544691808", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Panerai-Radiomir-3-Days-PAM-379-Oro-Rosso-Creative-2.jpg?v=1544691808", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Panerai-Radiomir-PAM-379-Oro-Rosso-AL-Shot.jpg?v=1544691808", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Panerai-Radiomir-PAM-379-Oro-Rosso-AR-Shot.jpg?v=1544691808", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Panerai-Radiomir-3-Days-PAM-379-Oro-Rosso-Wrist-Shot.jpg?v=1544691808", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Panerai-Radiomir-PAM-379-Oro-Rosso-Movement-Shot.jpg?v=1544691808", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Panerai-Radiomir-PAM-379-Oro-Rosso-Side-Shot.jpg?v=1544691808"]},
{"productYear": "2015", "title": "Grand Seiko Hi-Beat Special SBGH035", "productPrice": null, "productDescription": ["The recurring narrative in the watch world is that Grand Seiko is highly, highly under appreciated. Loved by those who truly understand mechanical watches and are unbiased geographically, the majority have historically turned their noses up at a brand that in their eyes, produces ‘cheap’ watches. Well, just like how Lexus in the automotive industry or Yamazaki and Hibiki in the whisky industry initially battled the same bias, Grand Seiko of late have become a real force to reckon with. The Japanese are famously known for their undying work ethic and dedication to quality and with Grand Seiko, it is certainly no different. "], "productCr": "This Grand Seiko Hi-Beat Special is in mint condition. It comes as a full set, with its inner and outer box, certificate of guarantee and its operating manual. Most importantly, it comes with a special Grand Seiko Special Inspection Certificate, reserved only for ‘Special’ GS watches. It is fitted on its original black alligator strap and Grand Seiko deployant clasp.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-Hi-Beat-Special-SBGH035-Front-Shot.jpg?v=1544689352", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-Hi-Beat-Special-SBGH035-Creative.jpg?v=1544689352", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-Hi-Beat-Special-SBGH035-Creative-3.jpg?v=1544689352", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-Hi-Beat-Special-SBGH035-Creative-1.jpg?v=1544689352", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-Hi-Beat-Special-SBGH035-AR-Shot.jpg?v=1544689352", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-Hi-Beat-Special-SBGH035-AL-Shot.jpg?v=1544689352", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-Hi-Beat-Special-SBGH035-Creative-2.jpg?v=1544689352", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-Hi-Beat-Special-SBGH035-Movement-Shot-1.jpg?v=1544689352", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-Hi-Beat-Special-SBGH035-Movement-Shot-2.jpg?v=1544689352", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-Hi-Beat-Special-SBGH035-Side-Shot.jpg?v=1544689352"]},
{"productYear": "2018", "title": "Grand Seiko SBGW 253", "productPrice": null, "productDescription": ["Grand Seiko is slowly but surely becoming a force to reckon with in the horological world. Partly due to stereotypes and prejudice, Seiko as a brand has often been shunned as inferior to Swiss watchmaking when they were actually making watches that were just as good if not better. The SBGW 253, released in 2017 as a celebration of the Grand Seiko name, is a testament to this. ", "Made in a limited edition of 1960 pieces, the SBGW253 is a reissue of the original Grand Seiko that was released in 1960. Though they have reissued this model before in 2011, the newer version features a larger 38mm case with the most desirable being this one, made in stainless steel. ", "What Grand Seiko does better than any of its competitors is its attention to detail and respect to its heritage. While we often see reissues these days from many brands, they always fall short on the details, with wrong proportions and corner-cutting. With the SBGW253, I don’t think I can fault anything about it. ", "The 38mm stainless steel case is perfectly proportionate and faithful to the original, despite the upsize. From its beveled lugs to the 11.2mm profile of the case, all of the details are spot on. Even the engraved gold Grand Seiko lion on the case back and the vintage-styled buckle are executed perfectly. The polar white dial is no different, adopting the old school style Grand Seiko logo font.", "The finishing as expected from Grand Seiko is perfectly done with their Zaratsu style of finishing on the case and hands. Derived from sword-making tradition, Zaratsu polishing is used by Grand Seiko to produce their signature distortion-free mirror finishing. ", "With the SBGW253, it is all about simplicity executed with perfection. Even the blued central seconds hand accentuates the whole watch. This is truly a faultless dress watch and I don’t think I can say that about too many pieces. "], "productCr": "This Grand Seiko SBGW253 is in good condition. It has minor hairline scratches from use but it is unpolished. It comes as a full set with its inner and outer boxes, certificate of guarantee and time testing certificate. It is in full working order and keeping time within expected standards.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGW253-Front-Shot.jpg?v=1570000499", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGW253-Creative-Shot.jpg?v=1570000499", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGW253-AR-Shot.jpg?v=1570000499", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGW253-Wrist-Shot.jpg?v=1570000499", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGW253-AL-Shot.jpg?v=1570000499", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGW253-Paper-Shot.jpg?v=1570000499", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGW253-Creative-Shot-1.jpg?v=1570000499", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGW253-Side-Shot.jpg?v=1570000499", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGW253-Side-Shot-2.jpg?v=1570000499", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGW253-Caseback-Shot.jpg?v=1570000495", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGW253-Buckle-Shot.jpg?v=1570000495"]},
{"productYear": "2003", "title": "Omega Speedmaster Snoopy Award", "productPrice": null, "productDescription": ["While the Omega Speedmaster was created as a racing watch, with its chronograph function and tachymeter scale, today this has long been forgotten and instead has become more famous for its exploits in space. Known as the ‘Moonwatch’, the Omega Speedmaster Professional made history by being flight-qualified by NASA for all manned space flights and becoming the first watch worn on the moon when it was on the wrists of astronauts during the Apollo 11 mission in 1969. ", "As a result, the Speedmaster has become a cult icon, and it's hard not to see why. Collectors can buy into such a great story and with a generation that grew up idolizing space travel and astronauts, this watch would certainly have to be one of the most important wristwatches ever made. ", "With racing and space being the central themes of the Speedmaster, you might be wondering why Omega released a ‘Snoopy’ limited edition and how it has a place in the Speedy lineup. Well, it actually has a lot to do with it, and specifically with space travel. In the ’60s, NASA chose the Snoopy character, created by Charles M. Schulz to be one of its icons. NASA employees even got sterling silver Snoopy pins as a gift from the company as a sign of appreciation back then and for whatever reason, Snoopy has always had an association with NASA.", "In 2003, Omega decided to commemorate this by creating the first limited edition Snoopy Speedmaster, which is what you see here today. With a cute cartoon of Astronaut Snoopy on the 9 o’clock sub-dial, and a beautifully animated case back, today these are one of the hottest limited edition Speedmasters out there. With a limited run of 5,441 pieces, I think a reason why collectors love this so much is part to do with the quirky story and also the fact that most collectors grew up with Snoopy as an icon.", "Regardless of why, I do think it is quite cool that you have, on one hand, quite a serious watch in the Speedmaster but on the other a lighter and more fun side to it with the snoopy cartoon on the dial. "], "productCr": "This watch is in mint condition and comes as a full set with its original inner and outer box, and also its special Snoopy edition guarantee certificate.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Professional-Snoopy-Award_0012_Layer-61.png?v=1587118435", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Professional-Snoopy-Award_0009_Layer-80.png?v=1587118435", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Professional-Snoopy-Award_0010_Layer-79.png?v=1587118435", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Professional-Snoopy-Award_0011_Layer-63.png?v=1587118435", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Professional-Snoopy-Award_0010_Layer-64.png?v=1587118435", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Professional-Snoopy-Award_0008_Layer-66.png?v=1587118435", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Professional-Snoopy-Award_0009_Layer-74.png?v=1587118435", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Professional-Snoopy-Award_0013_Layer-62.png?v=1587118435", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Professional-Snoopy-Award_0011_Layer-78.png?v=1587118435"]},
{"productYear": "2011", "title": "Jaeger-LeCoultre Memovox Tribute to Deep Sea", "productPrice": null, "productDescription": ["Right off the bat, I want to say that Jaeger-LeCoultre makes the best reissues hands down and was one of the first brands that started today’s trend of drawing upon vintage pieces to create a modern incarnation. Ranging from Reversos to the mighty Polaris, Jaeger-LeCoultre has done a whole range of reissues. It must be said though, most will agree that one of the best would be the Memovox Tribute to Deep Sea, released in 2011. "], "productCr": "This Jaeger-LeCoultre Memovox Tribute to Deep Sea comes with its inner and outer box, instruction manual, hang tag, community booklet and guarantee confirming the limited edition number of this watch. It does not come with its second guarantee that states the date of sale. It is in mint condition and comes with its JLC leather strap and stainless steel tang buckle. It is in full working order and the alarm works.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Memovox-Tribute-to-DeepSea-Front-Shot.jpg?v=1545374507", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Memovox-Tribute-to-Deep-Sea-Creative-1.jpg?v=1545374507", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Memovox-Tribute-to-Deep-Sea-Wrist-Shot.jpg?v=1545374507", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Memovox-Tribute-to-DeepSea-AL-Shot.jpg?v=1545374507", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Memovox-Tribute-to-DeepSea-AR-Shot.jpg?v=1545374507", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Memovox-Tribute-to-Deep-Sea-Creative.jpg?v=1545374507", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Memovox-Tribute-to-DeepSea-Caseback-Shot.jpg?v=1545374507", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Memovox-Tribute-to-DeepSea-Side-Shot.jpg?v=1545374507"]}
]