[
{"productYear": "2018", "title": "Omega Speedmaster Speedy Tuesday Ultraman", "productPrice": null, "productDescription": ["While the Omega Speedmaster was created as a racing watch, with its chronograph function and tachymeter scale, today this has long been forgotten and instead has become more famous for its exploits in space. Known as the ‘Moonwatch’, the Omega Speedmaster Professional made history by being flight-qualified by NASA for all manned space flights and becoming the first watch worn on the moon when it was on the wrists of astronauts during the Apollo 11 mission in 1969. ", "Fast forward to today and one of the most prevalent hashtags on Instagram for watches would certainly have to be #speedytuesday. Created by the influential blog Fratello Watches, it started as a series of articles, where they wrote about different variants of the Speedmaster every week. The hashtag over the years caught onto Instagram and today, every Speedmaster collector posts a #speedytuesday shot of their Speedmasters every Tuesday. ", "In fact, #speedytuesday got so big, that it even caught the attention of Omega themselves, the result of which is what you see here. This is the second in the series of collaborations between Omega and Fratello Watches. The first collaboration sold out quickly and became an instant legend, with big premiums in the second-hand market.", "Ultraman could only be in his superhero form for 3 minutes and Omega has signalled this by making the first three minutes of the minute counter at 3 o’clock in orange. Furthermore, as a tribute to Ultraman, a silhouette of his head is placed in the running seconds subdial at 9 o’clock and is only made visible when you shine a UV light, which Omega provides as a package.", "Just like all iconic designs, not much has changed with the Speedmaster for over 50 years. While the early Speedmasters had a different case, ever since Omega transitioned into their Speedmaster Professional line, it has consistently sported a black dial with rectangular luminous indexes, stick hour and minute hands with an arrow chronograph seconds hand and a 42mm asymmetrical stainless steel case with a black aluminium tachymeter bezel. Even with this limited edition featuring orange accents, it is still instantly recognizable. This Speedy Tuesday Ultraman is powered by the Calibre 1861, Omega’s in-house chronograph that is the descendent of the legendary 861 movement used in Speedmasters since 1969.", "All of these details combine to make up a really great limited edition, and the market agrees with me. Omega has always been great at doing special Speedmasters and collectors are pushing prices up for all kinds of limited editions. Some examples include the Alaska Project, the Apollo Soyuz Meteorite, the Japan Racing and the Snoopy Award. Down the line, while the Speedy Tuesday Ultraman is already selling for a premium, I have no doubt it will be one of the most collectable modern Speedmasters out there. "], "productCr": "The Omega Speedmaster Professional Speedy Tuesday ‘Ultraman’ is limited to 2,012 pieces and this example comes in a full set, including both of its straps, inner and outer Ultraman box, guarantee card and UV light. It is in unused condition.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Speedy-Tuesday-Ultraman-Front-Shot.jpg?v=1544691542", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Professional-Speedy-Tuesday-_Ultraman_-Creative.jpg?v=1544691542", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Speedy-Tuesday-Ultraman-AL-Shot.jpg?v=1544691542", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Speedy-Tuesday-Ultraman-AR-Shot.jpg?v=1544691542", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Speedy-Tuesday-Ultraman-Caseback-Shot.jpg?v=1544691542"]},
{"productYear": "2018", "title": "Rolex Yacht-Master 40 116655 Everose", "productPrice": null, "productDescription": ["When you think of Rolex, the immediate suspects always comes to mind. On the right, you have your classic dress pieces such as the Datejust and Day-Date and on the left the ever-popular sports models such as the Submariner, GMT-Master and Daytona. For a long time, the Rolex Yacht-Master was the unloved and unappreciated model of the Crown’s lineup, perhaps because they weren’t that attractive, to begin with. This was the case until 2015- when Rolex decided to revamp the model and introduce what you see here today- The Yacht-Master 116655. ", "This was one of the biggest announcements in BaselWorld 2015 and rightly so as it featured big changes in Rolex. As you may or may not know, Rolex is a hugely conservative brand and they have become known more for evolution rather than revolution, slowly tinkering and improving their watches over decades of research and development. In fact, for example, with all things considered, a Submariner today looks pretty damn similar to the first-ever Submariner released in the ’50s with its black bezel, black dial and stainless steel case. ", "Moving back onto the topic, the new Yacht-Master 116655 featured one thing that everyone was talking about- the Oysterflex. Using rubber bracelets was nothing new in the watch industry but when Rolex did it- people went nuts. This model was the first ever by Rolex to feature a rubber bracelet and with Rolex being Rolex, it was hugely over-engineered and the technology and quality behind it was truly impressive. ", "Rolex calls this a bracelet and not a strap because inside the rubber are titanium and nickel inserts with ridges moulded inside of the bracelet for a perfect fit. On the wrist, I’m not even surprised to say that this is the best rubber strap ever. Period. ", "On top of this, the 116655 featured a new design language, with an 18k Everose case, a black ceramic bezel instead of the usual platinum one and black maxi dial. It has a water resistance up to 100m and a matching 18k Everose clasp. ", "On the wrist, it really does feel like a luxury sports watch, with the Everose gold and black rubber bracelet juxtaposing to work amazingly well. It is one of the underdogs of Rolexes line up and slowly but surely, the Yachtmaster line is finally getting recognition. "], "productCr": "This Rolex Cosmograph Daytona is in mint condition. It is from 2013 and features blue Chrmoalight lume. The watch is in full working order and it comes as a full set with its inner and outer box, and warranty card.   ", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Yachtmaster-40-116655-Front-Shot.jpg?v=1570001563", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Yachtmaster-40-116655-AR-Shot.jpg?v=1570001563", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Yachtmaster-40-116655-AL-Shot.jpg?v=1570001563", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Yachtmaster-40-116655-Side-Shot.jpg?v=1570001563", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Yachtmaster-40-116655-Side-Shot-2.jpg?v=1570001562", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Yachtmaster-40-116655-Caseback-Shot.jpg?v=1570001562", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Yachtmaster-40-116655-Buckle-Shot.jpg?v=1570001562"]},
{"productYear": "1994", "title": "Rolex Submariner 16610 Full Set", "productPrice": null, "productDescription": ["The Rolex Submariner is one of the most recognisable and popular watches in the world, and like most Rolexes, needs no introduction. While there are certainly more expensive references out there, the reference 16610 lasted over 2 decades for a reason. Known for its reliability and everyday usability, the 16610 is perhaps the last Submariner reference that still had a ‘tool watch’ feel to it. You see, modern Rolexes are a lot shinier these days and allude more to a luxury audience than a professional one. I guess it’s what happens when your watches are so high quality and you brand your product so well. ", "Regardless, there is a reason why the Submariner is so popular. With its black aluminium bezel, its chunky oyster case and its matte black dial with large luminous plots, it has been the ultimate tool watch since its inception in the 50’s."], "productCr": "This Rolex Submariner 16610 is in excellent condition. The case is unpolished, thick and in features its original finish throughout. The dial is similarly flawless and it is in full working order. This example comes as full as it gets, with its inner and outer box, guarantee papers, calendar from 1994, hangtags and even its original receipt!", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610_Full_Set_0007_aaaa.jpg?v=1572856906", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Submariner-16610-Full-Set-Creative.jpg?v=1572856906", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610_Full_Set_0004_aaa.jpg?v=1572856906", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Submariner-16610-Full-Set-Wrist-Shot.jpg?v=1572856906", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610_Full_Set_0005_aaaa.jpg?v=1572856906", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610_Full_Set_0006_aaaa.jpg?v=1572856906", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610_Full_Set_0003_aaaaa.jpg?v=1572856892", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610_Full_Set_0002_aaaa.jpg?v=1572856892", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Submariner_16610_Full_Set_0001_Layer_26.jpg?v=1572856892"]},
{"productYear": "2018", "title": "Rolex Datejust 36mm Blue 116234", "productPrice": null, "productDescription": ["This could perhaps be the platonic ideal of an everyday watch that will suit every occasion and one that will last the rest of your life. The Rolex Datejust is the most well-known model from the most well-known brand in the world and since it’s inception has been one of the best sellers for the Crown. ", "It’s no surprise really, as the quality of the Datejust is second to none, priced very reasonably and carries the famed Rolex logo. Furthermore, from an aesthetic point of view, it is hugely versatile with its simple and proportionate design, suitable in the boardroom and the swimming pool. ", "This particular example comes with a sunburst blue dial, which is without a doubt the most desirable variant of the Datejust and is fitted on an Oyster bracelet. There is a reason why blue dialed watches are so hot right now as the visual impact of the sunburst reflecting light and different shades of blue really cannot compare to the ordinary black and white versions. Moreover, this Datejust comes in 36mm, which in my opinion is a perfect size. Though they make larger models, anything above 36mm loses the classic Datejust proportionality- there really is no need for larger.", "If I had to choose one watch to wear every day, for the rest of my life, this Datejust would certainly be a big contender. "], "productCr": "This Rolex Datejust 116234 is in good condition. It has some minor hairlines and scuffs on the polished centre links from use, which is very normal. It comes complete as a full set with its inner and outer box, warranty card and manual.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Datejust_116234_0040_aaaaa.jpg?v=1572857370", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Datejust-116234-Blue-Wrist-Shot.jpg?v=1572857370", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Datejust_116234_0038_aaaaa.jpg?v=1572857370", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Datejust-116234-Blue-Creative-2.jpg?v=1572857370", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Datejust-116234-Blue-Creative-1.jpg?v=1572857370", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Datejust_116234_0035_aaaa.jpg?v=1572857370", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Datejust_116234_0034_aaaaa.jpg?v=1572857370", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Datejust_116234_0033_aaaa.jpg?v=1572857370", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Datejust_116234_0039_aaaa.jpg?v=1572857370", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Datejust_116234_0037_aaaaa.jpg?v=1572857370", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex_Datejust_116234_0036_aaaaa.jpg?v=1572857370"]},
{"productYear": "2018", "title": "Vacheron Constantin Historiques Triple Calendrier 1942", "productPrice": null, "productDescription": ["As the name suggests, the Vacheron Constantin Historiques Triple Calendrier 1942 is a vintage-inspired piece. In fact, for long, Vacheron has drawn upon its rich history to create reissues and today their Historiques line has grown to quite a lineup. The Triple Calendrier is inspired by the Reference 4240 which was produced in 1942 and the recreation of this highly important reference is, in my opinion, very faithfully and tastefully done. ", "Housed in a 40mm stainless steel case, it has been upsized to suit modern tastes. That being said the overall aesthetic of the watch remains remarkably proportionate and elegant, despite the sizing and with the Triple Calendrier it is all about the little details that make this such a great piece. Fancy lugs have always been a thing for Vacheron and the teardrop lugs on this piece is no exception. This is complemented well by the ‘triple gadroon’ style case, a stepped bezel and a raised sapphire crystal that all point towards its vintage roots. ", "Furthermore, the dial is beautifully done with a two-tone effect comprising of an opaline dial with a white calendar ring. There are two apertures at the top of the dial displaying the day and the month while a third-hand points to the outer ring for the date. While everything is proportionate and very elegant, the cherry on the cake for me would have to be the highly stylized, Art Deco Arabic numerals. "], "productCr": "This Vacheron is in unused condition and comes as a full set, with inner and outer box and all associated papers and booklets. The back sticker remains attached to the watch.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Historiques-Calendrier-1942-Front-Shot.jpg?v=1552042947", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Historiques-Calendrier-1942-Creative-2.jpg?v=1552042947", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Historiques-Calendrier-1942-Creative-1.jpg?v=1552042947", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Historiques-Calendrier-1942-AL-Shot.jpg?v=1552042947", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Historiques-Calendrier-1942-AR-Shot.jpg?v=1552042947", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Historiques-Calendrier-1942-Movement-Shot.jpg?v=1552042947", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Historiques-Calendrier-1942-Side-Shot.jpg?v=1552042947"]},
{"productYear": "2014", "title": "Jaeger-LeCoultre Master Compressor Diving Alarm Navy SEALs", "productPrice": null, "productDescription": ["When it comes to alarm watches, Jaeger-LeCoultre would have to be, without a doubt the undisputed king. With one of their most iconic lines, the Memovox, being an integral part of the JLC collection, this version is perhaps the most hardcore alarm watch you will come across. "], "productCr": "This Jaeger-LeCoultre Master Compressor Diving Alarm Navy SEALs comes as a full set with its inner and outer box, operating instructions, certificate of origin and dated guarantee certificate. It is in full working order and in mint condition with a few minor scuffs.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Compressor-Diving-Alarm-Navy-Seals-Front-Shot.jpg?v=1544690432", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Compressor-Diving-Alarm-Navy-Seals-Creative-1.jpg?v=1544690432", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Compressor-Diving-Alarm-Navy-Seals-Wrist-Shot.jpg?v=1544690432", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Compressor-Diving-Alarm-Navy-Seals-AL-Shot.jpg?v=1544690432", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Compressor-Diving-Alarm-Navy-Seals-AR-Shot.jpg?v=1544690432", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Compressor-Diving-Alarm-Navy-Seals-Creative.jpg?v=1544690432", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Compressor-Diving-Alarm-Navy-Seals-Caseback-Shot.jpg?v=1544690432", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Compressor-Diving-Alarm-Navy-Seals-Side-Shot.jpg?v=1544690432", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Memovox-Tribute-to-DeepSea-Buckle-Shot.jpg?v=1545374532"]},
{"productYear": "2019", "title": "Tudor Black Bay Harrods Edition", "productPrice": null, "productDescription": ["The Tudor Black Bay is an iconic model for Tudor. It was the line that revived the Tudor name when it was first released back in 2012. When it was released and ever since then, it has struck a chord with collectors and it has consistently been seen as one of the best value watches in the market. The Black Bay was a reinterpretation of Tudor’s rich dive watch history and the brand drew upon design cues from their early Submariners in the 20th century, including the iconic ‘Snowflake’ hands, the ‘Big Crown’ no crown guard stainless steel case and the stainless steel riveted bracelet. With its vintage roots and that famous Rolex quality at such an attractive price point, it is hard not to love the Black Bay. ", "After quite a few years of production, there is now a whole range of Black Bays varying in colours and case material. That being said, my favourite would certainly have to be this version. This Black Bay was made in collaboration with the famous British department store, Harrods and is sold exclusively through the Harrods Fine Watch Room. While I am always sceptical of brands releasing new models with colour changes as the only difference, this one would have to be the exception for me. The Harrods Black Bay comes with a never before seen green bezel, which is the same iconic green that has represented Harrods ever since its inception and green accents in its depth rating and the tip of the seconds hand. The chapter ring, logo and chronometer rating is all in gilt alongside the gold hour marker surrounds, which is also a nice nod to the gold font of the Harrods logo. Another nice touch is the reversal of the depth rating, where Tudor put the feet first (660ft/200m) as a tribute to the ‘Britishness’ of Harrods. ", "While this is not strictly a limited edition as Tudor doesn’t do limiteds, there is a huge waitlist and Tudor aren’t making many of these. I have heard of clients waiting well over a year for their piece and the demand is out there. The green bezel is reminiscent of the Rolex ‘Kermit’ Submariner with its similar green bezel and I would certainly consider this the ‘Baby Kermit’. ", "For a long time, Tudor has been seen as the ‘Poor Man’s Rolex’ as when they were first created, their philosophy was to use Rolex cases and outsourced movements to save on cost. The old Tudor Submariners used ETA movements and for awhile the Black Bay did too. Now though, this Black Bay is powered by an in-house self-winding calibre MT5602, housed in a 41mm stainless steel bevelled case and takes on its own design cues without having to follow its big brother. Today, Tudor is seen as a brand that stands on its own two feet and has cemented itself as a powerful brand in its own right. "], "productCr": "This Tudor Black Bay Harrods Edition has not been used. Itcomes as a full set, with its inner and outer box, guarantee booklet, dated international guarantee card, instruction manual, a full length stainless steel Tudor bracelet and a spare NATO strap.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Harrods-Black-Bay-2-Front-Shot.jpg?v=1565167610", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Harrods-2-Creative.jpg?v=1565167610", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Harrods-Black-Bay-2-AR-Shot.jpg?v=1565167610", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Harrods-Black-Bay-2-AL-Shot.jpg?v=1565167610", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Harrods-Black-Bay-2-Caseback-Shot.jpg?v=1565167610", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Harrods-Black-Bay-2-Side-Shot.jpg?v=1565167610"]},
{"productYear": "1999", "title": "IWC Aquatimer 2000 Titanium", "productPrice": null, "productDescription": ["Recently I have taken an interest in neo-vintage IWC pieces. Beginning with collaborations alongside Porsche design culminating to this Aquatimer 2000, this era marks a stage of IWC that was true to its utilitarian roots and design language. Furthermore, IWCs from this era are relatively affordable and incredibly well made. ", "The IWC Aquatimer 3536 came in several variants, and this example is the -1, made in titanium with a black dial. It can be seen as a direct successor to the Porsche Design Ocean 2000, one of the IWC grails today. Being made of titanium is only weighs 120 grams, despite its muscular 42mm size. ", "The titanium used is a very high-quality variant that has been sandblasted and hardened to 2400 Vickers, making it nearly scratchproof. It’s depth rated to 2000 meters which is more than a Rolex Sea-Dweller- let that sink in!", "Aesthetically this is a true no-nonsense tool watch, with a matte black dial and luminous indexes and hands. Interestingly, IWC used a mixture of tritium and Luminova for the luminous material and a nice quirk of this reference is the yellow 12 o’clock marker. "], "productCr": "This IWC Aquatimer 2000 Ref. 3536 is in excellent condition. The titanium case remains in a well-preserved state together with the dial. The 12 o’clock marker has developed a nice patina which is characteristic of this reference. ", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Aquatimer-2000-Front-Shot.jpg?v=1571383891", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Aquatimer-2000-Creative-1.jpg?v=1571383891", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Aquatimer-2000-AR-Shot.jpg?v=1571383891", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Aquatimer-2000-Creative.jpg?v=1571383891", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Aquatimer-2000-AL-Shot.jpg?v=1571383891", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Aquatimer-2000-Wrist-Shot.jpg?v=1571383891", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Aquatimer-2000-Side-Shot.jpg?v=1571383891", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Aquatimer-2000-Caseback-Shot.jpg?v=1571383891"]},
{"productYear": "2019", "title": "Omega Speedmaster Apollo 11 50th Anniversary", "productPrice": null, "productDescription": ["While the Omega Speedmaster was created as a racing watch, with its chronograph function and tachymeter scale, today this has long been forgotten and instead has become more famous for its exploits in space. Known as the ‘Moonwatch’, the Omega Speedmaster Professional made history by being flight-qualified by NASA for all manned space flights and becoming the first watch worn on the moon when it was on the wrists of astronauts during the Apollo 11 mission in 1969. ", "As a result, the Speedmaster has become a cult icon, and it's hard not to see why. Collectors can buy into such a great story and with a generation that grew up idolizing space travel and astronauts, the Speedmaster was always destined for success. ", "2019 marks a milestone in space travel, and as a result for the Omega Speedmaster too as this year marks the 50th anniversary of the lunar landing. The watch you see here today is a commemoration of that feat 50 years ago, where Neil Armstrong, Buzz Aldrin, and the Apollo 11 crew won the race to the moon. ", "The Omega Speedmaster Apollo 11 50th Anniversary comes with the brand new caliber 3861, which succeeded the already legendary Cal. 1861. With notable upgrades such as a Co-Axial escapement, up to 15,000 gausses of magnetic resistance and an overall improvement in accuracy, it also marks a milestone and evolution for Omega. ", "On the outside, it comes on a classic 42mm lyre lug stainless steel case with a ceramic tachymeter bezel. The dial is beautifully finished with a two-tone grey-black layout and gold accents, finished off with an engraving of Buzz Aldrin stepping onto the moon at the 9 o’clock sub-dial. I love that they chose to fit the flat link bracelet onto this watch as it looks much more elegant and complements the case perfectly. ", "The watch does not come with a see-through case back but instead with a tribute to the moon landing with an engraving of the moon’s surface with an astronaut’s bootprint and Neil Armstrong’s legendary quote around the periphery. ", "To top things off, Omega didn’t stop at the watch with a beautiful presentation case that comes with a Velcro strap, two mission patches and the coolest part- a lunar module display stand which you can remove from the box and show off your watch. ", "I do think that Omega is getting more elaborate with their limited editions, and the attention to detail is fantastic. The Apollo 11 50th Anniversary comes in a limited edition of 6,969 pieces."], "productCr": "This Omega Speedmaster Professional Apollo 11 50th Anniversary comes in brand new condition and still with its stickers attached. It comes complete as a full set and with all of its accessories.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega_Speedmaster_Apollo_11_50th_Anniversary_0047_aaaa.jpg?v=1572857629", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Apollo-11-50th-Anniversary-Creative-3.jpg?v=1572857716", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega_Speedmaster_Apollo_11_50th_Anniversary_0045_aaaaa.jpg?v=1572857716", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Apollo-11-50th-Anniversary-Creative.jpg?v=1572857716", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Apollo-11-50th-Anniversary-Creative-2.jpg?v=1572857716", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega_Speedmaster_Apollo_11_50th_Anniversary_0043_aaaaa.jpg?v=1572857716", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Apollo-11-50th-Anniversary-Creative-4.jpg?v=1572857716", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega_Speedmaster_Apollo_11_50th_Anniversary_0046_aaaa.jpg?v=1572857716", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega_Speedmaster_Apollo_11_50th_Anniversary_0044_aaaaa.jpg?v=1572857716", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega_Speedmaster_Apollo_11_50th_Anniversary_0042_aaaaaa.jpg?v=1572857716", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega_Speedmaster_Apollo_11_50th_Anniversary_0041_aaaaa.jpg?v=1572857716"]},
{"productYear": "2013", "title": "Maitres du Temps Chapter Three Reveal Piece Unique", "productPrice": null, "productDescription": ["Maitres du Temps was formed in 2005, becoming famous for being an independent brand that produces highly complicated watches that incorporated rollers into their mechanisms. Made in extremely low quantities, it is what MB & F are doing today, as each model they produced was always in collaboration with important independent watchmakers. ", "Beginning with the basics first, the Chapter 3 is housed in a 42mm case made of 18k white gold. ", "With the straightforward aspects through, pressing the button set in the winding crown reveals that there are actually two apertures at 12 and 6 o’clock that open- and this is where the fun begins. As mentioned, rollers are a very important part of the Maitre du Temps design language and at the 12 o’clock aperture reveals a roller that acts as a day/night indicator and 6 o’clock reveals another roller that acts as the second time zone indicator.", "Opening the panels is a very tactile experience, as the panels that cover the apertures actually sit flush on the dial. Only when you depress the button, it slightly drops beneath the dial and opens up. The rollers are made of gold and have been relief engraved and hand painted. ", "At the 6 o’clock aperture, the home time is displayed and interestingly the movement uses two rollers despite only one being displayed at a time. Each roller holds 6 numbers and once again, when the first roller shifts and spins to the second one, you can feel the mechanism’s movement making for a very immersive, tactile experience.", "As it is a GMT Watch, there is a pusher at 9 o’clock that allows for the mechanism to uncouple and set each timezone independently. Furthermore, the crown has two settings. At its first setting, rotating clockwise sets the moon phase while rotating it anti-clockwise sets the calendar followed by the second setting which sets the time.", "While this is a special watch in its own right with only 50 pieces produced in white gold, this example is an even more special as it is a one-off piece unique made specially for a client. While it is mostly the same, the rollers contain a unique graphic in the day/night indicator as you will be able to see in the photography. The standard Chapter 3 Reveal features an ordinary moon and sun for the day/night indicator.", "While all of the watches Maitres du Temps has produced are technically impressive and innovative, this is perhaps my favourite of the three ‘Chapters’ so far. It is much more restrained and understated, making for a perfect dress watch that is both beautifully elegant and highly complicated.", "This watch is powered by the manually wound calibre SHC03. It has a power reserve of 36 hours."], "productCr": "This Maitres du Temps Chapter 3 reveal comes as a full set, with its inner and outer box, instructions manual, undated certificate of guarantee and a beautiful Maitre du Temps leather wallet made by Berluti. It comes on its original MDT dark blue strap with blue stitching and 18k white gold signed tang buckle. It is in full working order and in mint condition.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Maitres-Du-Temps-Chapter-Three-Reveal-Front-Shot-1.jpg?v=1544690757", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Maitres-Du-Temps-Chapter-Three-Reveal-Front-Shot-3.jpg?v=1544690757", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Maitres-Du-Temps-Chapter-Three-Reveal-Front-Shot-2.jpg?v=1544690757", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Maitres-Du-Temps-Chapter-Three-Reveal-Movement-Shot.jpg?v=1544690757", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Maitres-du-Temps-Chapter-3-Reveal-Piece-Unique-Creative.jpg?v=1544690757", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Maitres-du-Temps-Chapter-3-Reveal-Piece-Unique-Wrist-Shot.jpg?v=1544690757", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Maitres-Du-Temps-Chapter-Three-Reveal-AR-Shot.jpg?v=1544690757", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Maitres-du-Temps-Chapter-3-Reveal-Piece-Unique-Creative-1.jpg?v=1544690757", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Maitres-du-Temps-Chapter-3-Reveal-Piece-Unique-Creative-3.jpg?v=1544690757", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Maitres-Du-Temps-Chapter-Three-Reveal-AL-Shot.jpg?v=1544690757", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Maitres-Du-Temps-Chapter-Three-Reveal-Side-Shot-1.jpg?v=1544690757", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Maitres-Du-Temps-Chapter-Three-Reveal-Side-Shot-2.jpg?v=1544690757", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Maitres-Du-Temps-Chapter-Three-Reveal-Buckle-Shot.jpg?v=1544690757"]},
{"productYear": "2015", "title": "Jaeger-LeCoultre Master Ultra Thin Perpetual Calendar", "productPrice": null, "productDescription": ["The Jaeger-LeCoultre Master Ultra Thin Perpetual Calendar is a great lesson in classical, high-end watchmaking at an accessible price point. First of all, a perpetual calendar complication is the most high end and complicated calendar watch you can buy, as its mechanism takes into account, the days of the month including February, and leap years too so the user does not need to adjust his watch at the end of every month. This ingenious function is extremely complicated and expensive to produce, which is why the watch you see here today is such great value. ", "Sized in a 38.5mm stainless steel case, it sits very thin and flat on the wrist at 9.2mm and is a beautifully proportioned dress watch. It features a silver sunburst dial with three subdials that dimply the day, date and month, followed by a moon phase at 12 o’clock. On top of this, on the bottom left side of the dial is an aperture displaying the year, to take into account leap years and there is a further small aperture below the logo that tells the user not to set the calendar. This is because adjusting a perpetual calendar in between 10PM and 2AM can damage the watch’s mechanism as the calendar function is working at that time. This very handy aperture turns blue during these times so the user knows exactly when to set or not set the calendar. ", "In recent times, the perpetual calendar has taken a back seat to more tactile complications such as the chronograph, but I for one remain a huge fan. It is certainly a purist and very classical complication but brands have been featuring it more and more lately. The Jaeger-LeCoultre Master Ultra Thin Perpetual Calendar is a great piece with great proportions and an attractive price point. As a comparison, a Patek Philippe Perpetual Calendar will cost quadruple of this. Let that sink in. "], "productCr": "This Jaeger-LeCoultre Master Ultra Thin Perpetual Calendar is in good condition. It comes as a full set with its box, booklets and papers. There are a few minor hairline scratches from use.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Ultra-Thin-Perpetual-Calendar-Front-Shot.jpg?v=1552042015", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Ultra-Thin-Perpetual-Calendar-Creative-Shot.jpg?v=1552042015", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Ultra-Thin-Perpetual-Calendar-AR-Shot.jpg?v=1552042015", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Ultra-Thin-Perpetual-Calendar-Movement-Shot.jpg?v=1552042015", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Ultra-Thin-Perpetual-Calendar-AL-Shot.jpg?v=1552042015", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Ultra-Thin-Perpetual-Calendar-Movement-Shot-1.jpg?v=1552042015", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Ultra-Thin-Perpetual-Calendar-Side-Shot.jpg?v=1552042015"]},
{"productYear": "2016", "title": "Nomos Metro Chronometer for Hodinkee", "productPrice": null, "productDescription": ["In the last 5 years, a small company in Glashutte by the name of Nomos has become the darling of the watch world. Making their name as a completely in-house manufacture that delivers amazing value for money, Nomos has become the go-to watch for many from seasoned collectors who appreciate the philosophy of the brand to first-time buyers. If I had a penny for every time someone answered the question of ‘I’m on a budget, which watch should I buy? with the word ‘Nomos’, I would be a very rich man. "], "productCr": "This Nomos Metro Chronometer for Hodinkee is in unused, brand new condition. It comes as a complete set and was never worn by its original owner. Along with its wooden box and guarantee/warranty card, it comes with its chronometer certificate from the Thuringen and Saxon State Bureaus of Standards, its instruction manual, a hand written letter by Hodinkee to its original owner and an additional unused dark blue shell cordovan strap made by Hodinkee. This watch is fitted with a blue suede strap by Hodinkee.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Nomos-Metro-Chronometer-Hodinkee-Front-Shot.jpg?v=1544690973", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Nomos-Metro-Chronometer-Hodinkee-Creative.jpg?v=1544690973", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Nomos-Metro-Chronometer-Hodinkee-Creative-1.jpg?v=1544690973", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Nomos-Metro-Chronometer-Hodinkee-AL-Shot.jpg?v=1544690973", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Nomos-Metro-Chronometer-Hodinkee-AR-Shot.jpg?v=1544690973", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Nomos-Metro-Chronometer-Hodinkee-Wrist-Shot.jpg?v=1544690973", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Nomos-Metro-Chronometer-Hodinkee-Creative-2.jpg?v=1544690973", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Nomos-Metro-Chronometer-Hodinkee-Caseback-Shot.jpg?v=1544690973", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Nomos-Metro-Chronometer-Hodinkee-Side-Shot.jpg?v=1544690973"]},
{"productYear": "2018", "title": "Patek Philippe Calatrava Pilot Travel Time 5524G", "productPrice": null, "productDescription": ["The Patek Philippe Calatrava Pilot Travel Time 5524G is the watch no one expected in Baselworld 2015. Radically different in design to what we have come to expect from the de facto king of Swiss watches, this release signalled a shift in focus to younger consumers.", "The 42mm white gold case sits quite flat on the wrist with its relatively thin 11mm case profile and it comes equipped with a brown calfskin strap and white gold tang buckle. I have always said that a GMT function is the most useful complication for modern times and this takes it a step further with the easy setting of the hour hand. The Patek Philippe 5524G is the perfect travel companion. "], "productCr": "This Patek Philippe Travel Time 5524G is in mint condition. It has been used and the strap has some minor creasing. It comes as a full set with its box, papers and all accompanying accessories. ", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Pilot-Travel-Time-5524G-Front-Shot.jpg?v=1554111303", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Pilot-Travel-Time-5524G-Creative-Shot.jpg?v=1554111303", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Pilot-Travel-Time-5524G-Papers-Creative-Shot.jpg?v=1554111303", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Pilot-Travel-Time-5524G-Wrist-Shot.jpg?v=1554111303", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Pilot-Travel-Time-5524G-AL-Shot.jpg?v=1554111303", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Pilot-Travel-Time-5524G-AR-Shot.jpg?v=1554111303", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Pilot-Travel-Time-5524G-Caseback-Shot.jpg?v=1554111303", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Pilot-Travel-Time-5524G-Side-Shot.jpg?v=1554111303", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Pilot-Travel-Time-5524G-Movement-Shot-2.jpg?v=1554111303", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Pilot-Travel-Time-5524G-Movement-Shot-1.jpg?v=1554111303", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Pilot-Travel-Time-5524G-Buckle-Shot.jpg?v=1554111303"]},
{"productYear": "2008", "title": "Audemars Piguet Royal Oak Dual Time 26120ST", "productPrice": null, "productDescription": ["The Royal Oak, with its masculine octagonal case, exposed screws and integrated bracelet is one of the most distinctive watches in the market today. It is imposing and recognisable, and in my opinion, one of the best statement watches money can buy. ", "This Royal Oak you see today is from 2009 and sized at a perfect 39mm. While most Royal Oaks today is 41mm, I feel that this is way too big and it takes away the proportion. Not only that, but the original ‘Jumbo’ released in the ’70s was 39mm, and it is still the purest and most original sizing for a Royal Oak. ", "Featuring a black dial with Audemars Piguet’s signature engine turned tappiserie motif, the black and white colour layout is tastefully accented with notes of red. As with all Royal Oaks, a big part of the magic is in the case finishing and with this example, it is no different. The integrated bracelet is a must for any Royal Oak in my opinion and on the wrist, you will really see why. Hand finished to perfection, the bracelet is bevelled, polished and brushed. ", "The 26120ST is a complicated Royal Oak housing several complications with the main one being a dual time function. On top of the second time zone subdial at 6 o’clock, it has a power reserve indicator at 9 and 10 o’clock, a day/night indicator beneath this and a date subdial at 2 and 3 o’clock. All of this is laid out very methodically and despite the wealth of information on the dial, it remains legible. "], "productCr": "This Audemars Piguet Royal Oak 26120ST is in mint condition. It comes as a full set with box, papers and all associated booklets. The bracelet comes with all of its links.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Dual-Time-26120ST-Front-Shot.jpg?v=1552033544", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Dual-Time-26120ST-Creative-1.jpg?v=1552033544", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Dual-Time-26120ST-Wrist-Shot.jpg?v=1552033544", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Dual-Time-26120ST-Creative-2.jpg?v=1552033544", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Dual-Time-26120ST-Creative-3.jpg?v=1552033544", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Dual-Time-26120ST-AL-Shot.jpg?v=1552033544", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Dual-Time-26120ST-AR-Shot.jpg?v=1552033544", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Dual-Time-26120ST-Caseback-Shot.jpg?v=1552033544", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Dual-Time-26120ST-Side-Shot.jpg?v=1552033544"]},
{"productYear": "2008", "title": "Audemars Piguet Royal Oak Offshore 'Bumblebee'", "productPrice": null, "productDescription": ["The brand name Audemars Piguet and the model name Royal Oak go hand in hand and without a doubt, the Royal Oak has been AP’s most popular watch. With its masculine octagonal case, exposed screws and integrated bracelet is one of the most distinctive watches in the market today. It is imposing and recognisable, and in my opinion, one of the best statement watches money can buy. ", "The Royal Oak is not only famous for what it looks like, but also how it was introduced. First released in the ’70s, the original Ref. 5402 was a bold stainless steel watch designed by Gerald Genta that created shockwaves because it was priced the same as a solid gold watch. People just could not accept that a pedestrian material such as steel could be priced so exorbitantly and consequently, it was not very popular. It was only after time that the public saw this as something genuinely original and avant-garde- fast forward to the 21st century, and the Royal Oak is an icon. ", "Riding on this wave, the Royal Oak had a reincarnation in 1993 as Audemars Piguet introduced a whole new variant of the model- the Royal Oak Offshore. Nicknamed ‘The Beast’ is was basically a Royal Oak on steroids and with watch sizing getting larger and larger, it was an instant hit. ", "One of the most popular Offshores to this day, the Ref. 26176 was introduced in 2009 and quickly dubbed the ‘Bumblebee’ for its black dial and yellow highlights. Not only that, it was housed in an unconventional forged carbon case and a black ceramic octagonal bezel. With a stunning pattern from the forged carbon, it is not only beautiful to look at but extremely durable and scratch resistant.", "Without out a doubt, this is a loud, statement watch and for those looking for something like this, the Royal Oak Offshore Bumblebee ticks all of the above. "], "productCr": "This Audemars Piguet Royal Oak Offshore Bumble is in mint condition. It comes with a brand new unused Bumblebee strap and as a full set with its inner and outer box and papers.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Offshore-Bumblebee-Front-Shot.jpg?v=1557460193", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguer-Royal-Oak-Offshore-Bumblebee-Creative.jpg?v=1557460193", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguer-Royal-Oak-Offshore-Bumblebee-Wrist-Shot.jpg?v=1557460193", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Offshore-Bumblebee-AR-Shot.jpg?v=1557460193", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Offshore-Bumblebee-AL-Shot.jpg?v=1557460193", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Offshore-Bumblebee-Caseback-Shot.jpg?v=1557460193", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Offshore-Bumblebee-Side-Shot.jpg?v=1557460193", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Offshore-Bumblebee-Clasp-Shot.jpg?v=1557460193"]},
{"productYear": "2016", "title": "H.Moser & Cie Mayu Fumé Dial", "productPrice": null, "productDescription": ["H. Moser & Cie are an independent watch brand who has become known as the enfant terrible of the Swiss watchmaking industry. Quite a polarising brand, they made their name initially creating beautiful elegant timepieces but in the last few years, they have really become a force to reckon with introducing satire into their watchmaking, with pieces such as the one-off ‘Swiss Cheese’ watch and ‘Apple’ watch. I for one think this is refreshing that a brand is taking an active stand to criticise and create a commentary on the Swiss watch industry, especially as it comes from a brand with a very strong pedigree. ", "The H. Moser & Cie Mayu is one of the earlier creations from the manufacture and is a very nice, understated and elegant piece with a lot of details going for it. The 39mm case is crafted in rose gold and despite it looking like a traditional watch case, the construction of the lugs gives it a lot of extra depth and makes it far more interesting. The case design is done so that the softly bevelled lugs run off to the side of the case and slowly diminish, with its polished finish perfectly contrasted with the brushed finished in the background. The dial is seriously mesmerising as the brown fume finish really reflects light well and creates all sorts of tones. ", "It’s not all looks with the Moser Mayu as the watch is powered by a very impressive in-house calibre HMC 321.503. The manual winding movement is regulated by a Straumann double hairspring which is also produced in-house and the springs move in opposite directions, offsetting gravity errors. Not many manufactures can say they create their own hairsprings! Furthermore, there is a power reserve indicator on the movement and it has a whopping 80 hours of run time! The movement is beautifully finished and architecturally very pleasing to look at. ", "With only approximately 1200 pieces produced a year, H. Moser & Cie is truly an enigmatic independent brand that creates highly original timepieces. "], "productCr": "This H. Moser & Cie Mayu is in good condition. There are some minor hairline scratches from previous use. There is some wear to the strap from previous use. It comes as a full set with its inner and outer box, booklets and international guarantee.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/H.-Moser-_-Cie-Mayu-Front-SHot.jpg?v=1552041713", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/H.-Moser-_-Cie-Mayu-Creative-Shot.jpg?v=1552041713", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/H.-Moser-_-Cie-Mayu-Wrist-Shot.jpg?v=1552041713", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/H.-Moser-_-Cie-Mayu-AR-Shot.jpg?v=1552041713", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/H.-Moser-_-Cie-Mayu-Movement-Shot.jpg?v=1552041713", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/H.-Moser-_-Cie-Mayu-AL-Shot.jpg?v=1552041713", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/H.-Moser-_-Cie-Mayu-Movement-Shot2.jpg?v=1552041713", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/H.-Moser-_-Cie-Mayu-Side-Shot.jpg?v=1552041713", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/H.-Moser-_-Cie-Mayu-Buckle-Shot.jpg?v=1552041713"]},
{"productYear": "2016", "title": "Omega Speedmaster Apollo Soyuz Meteorite", "productPrice": null, "productDescription": ["While the Omega Speedmaster was created as a racing watch, with its chronograph function and tachymeter scale, today this has long been forgotten and instead has become more famous for its exploits in space. Known as the ‘Moonwatch’, the Omega Speedmaster Professional made history by being flight-qualified by NASA for all manned space flights and becoming the first watch worn on the moon when it was on the wrists of astronauts during the Apollo 11 mission in 1969. ", "This Apollo Soyuz Speedmaster Professional was made in a limited edition of 1975 pieces."], "productCr": "This Omega Speedmaster Professional Apollo Soyuz is in excellent condition. There is a ding on the left side of the case. It comes as a full set with its inner and outer box, hang tag, operating instructions, dated international warranty card, certificate of authenticity, limited series card, pictograms card, a leather Omega card holder and a full length stainless steel bracelet. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Apollo-Soyuz-Front-Shot.jpg?v=1544691208", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Professional-Apollo-Soyuz-Meteorite-Creative-1.jpg?v=1544691208", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Apollo-Soyuz-AR-Shot.jpg?v=1544691208", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Professional-Apollo-Soyuz-Meteorite-Creative-2.jpg?v=1544691208", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Apollo-Soyuz-AL-Shot.jpg?v=1544691208", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Professional-Apollo-Soyuz-Meteorite-Creative-3.jpg?v=1544691208", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Professional-Apollo-Soyuz-Meteorite-Creative.jpg?v=1544691208", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Professional-Apollo-Soyuz-Meteorite-Wrist-Shot.jpg?v=1544691208", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Apollo-Soyuz-Case-Back-Shot.jpg?v=1544691208", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Apollo-Soyuz-Side-Shot.jpg?v=1544691208"]},
{"productYear": "2018", "title": "Tudor Black Bay Harrods Edition", "productPrice": null, "productDescription": ["The Tudor Black Bay is an iconic model for Tudor. It was the line that revived the Tudor name when it was first released back in 2012. When it was released and ever since then, it has struck a chord with collectors and it has consistently been seen as one of the best value watches in the market. The Black Bay was a reinterpretation of Tudor’s rich dive watch history and the brand drew upon design cues from their early Submariners in the 20th century, including the iconic ‘Snowflake’ hands, the ‘Big Crown’ no crown guard stainless steel case and the stainless steel riveted bracelet. With its vintage roots and that famous Rolex quality at such an attractive price point, it is hard not to love the Black Bay. ", "After quite a few years of production, there is now a whole range of Black Bays varying in colours and case material. That being said, my favourite would certainly have to be this version. This Black Bay was made in collaboration with the famous British department store, Harrods and is sold exclusively through the Harrods Fine Watch Room. While I am always skeptical of brands releasing new models with colour changes as the only difference, this one would have to be the exception for me. The Harrods Black Bay comes with a never before seen green bezel, which is the same iconic green that has represented Harrods ever since its inception and green accents in its depth rating and the tip of the seconds hand. The chapter ring, logo and chronometer rating is all in gilt alongside the gold hour marker surrounds, which is also a nice nod to the gold font of the Harrods logo. Another nice touch is the reversal of the depth rating, where Tudor put the feet first (660ft/200m) as a tribute to the ‘Britishness’ of Harrods. ", "While this is not strictly a limited edition as Tudor doesn’t do limiteds, there is a huge wait list and Tudor aren’t making many of these. I have heard of clients waiting well over a year for their piece and the demand is out there. The green bezel is reminiscent of the Rolex ‘Kermit’ Submariner with its similar green bezel and I would certainly consider this the ‘Baby Kermit’. ", "For a long time, Tudor has been seen as the ‘Poor Man’s Rolex’ as when they were first created, their philosophy was to use Rolex cases and outsourced movements to save on cost. The old Tudor Submariners used ETA movements and for a while the Black Bay did too. Now though, this Black Bay is powered by an in-house self-winding calibre MT5602, housed in a 41mm stainless steel bevelled case and takes on its own design cues without having to follow its big brother. Today, Tudor is seen as a brand that stands on its own two feet and has cemented itself as a powerful brand in its own right. "], "productCr": "This Tudor Black Bay Harrods Edition comes as a full set, with its inner and outer box, guarantee booklet, dated international guarantee card, instruction manual, a full-length stainless steel Tudor bracelet and a spare NATO strap.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Harrods-Edition-Front-Shot.jpg?v=1544692850", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Harrods-Edition-Creative-1.jpg?v=1544692850", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Harrods-Edition-Wrist-Shot.jpg?v=1544692850", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Harrods-Edition-AR-Shot.jpg?v=1544692850", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Harrods-Edition-AL-Shot.jpg?v=1544692850", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Harrods-Edition-Creative.jpg?v=1544692850", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Harrods-Edition-Caseback-Shot.jpg?v=1544692850", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Harrods-Edition-Side-Shot.jpg?v=1544692850"]},
{"productYear": "2017", "title": "Omega Speedmaster Racing 'Tin Tin'", "productPrice": null, "productDescription": ["While the Omega Speedmaster was created as a racing watch, with its chronograph function and tachymeter scale, today this has long been forgotten and instead has become more famous for its exploits in space. Known as the ‘Moonwatch’, the Omega Speedmaster Professional made history by being flight-qualified by NASA for all manned space flights and becoming the first watch worn on the moon when it was on the wrists of astronauts during the Apollo 11 mission in 1969. ", "The story was uncovered by the good guys at Fratello Watches, where they figured out that this Omega ‘Racing’ Speedmaster was actually supposed to be an official collaboration with Hergé the owners of Tin Tin. The red and white colours you see on the dial are representative of the similarly coloured rocket ship that Tin Tin used in the comic strips to land on the moon. Working together, Omega actually created this dial with a rocket ship on the subdial and a special caseback but towards the tail end, Hergé decided to pull out, leaving Omega with all of these dials. "], "productCr": "This Omega Speedmaster Tin Tin is in mint condition. It comes with an unused Omega Speedmaster bracelet with its stickers still attached on the buckle. Furthermore, it comes complete as a full set with its inner and outer box, international warranty, pictogram card, operating instructions and hang tag.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Tin-Tin-2-Front-Shot.jpg?v=1565165848", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Tin-Tin-Creative.jpg?v=1565165848", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Tin-Tin-2-AR-Shot.jpg?v=1565165848", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Tin-Tin-2-AL-Shot.jpg?v=1565165848", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Tin-Tin-2-Caseback-Shot.jpg?v=1565165848", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Speedmaster-Tin-Tin-2-Side-Shot.jpg?v=1565165848"]},
{"productYear": "2017", "title": "Omega Speedmaster Skywalker X-33", "productPrice": null, "productDescription": ["While the Omega Speedmaster was created as a racing watch, with its chronograph function and tachymeter scale, today this has long been forgotten and instead has become more famous for its exploits in space. Known as the ‘Moonwatch’, the Omega Speedmaster Professional made history by being flight-qualified by NASA for all manned space flights and becoming the first watch worn on the moon when it was on the wrists of astronauts during the Apollo 11 mission in 1969.", "As a result, the Speedmaster has become a cult icon, and it's hard not to see why. Collectors can buy into such a great story and with a generation that grew up idolizing space travel and astronauts, this watch would certainly have to be one of the most important wristwatches ever made. While the Speedmaster we know is iconic in its looks, the ‘Speedmaster’ name has had many iterations, including the example here today.", "First introduced in 1998, the first generation X-33 was designed to supplement the existing and more familiar Speedmaster Professional as the rise of digital technology and quartz movements could provide greater functionality needed for future missions. The process was spearheaded by General Tom Stafford, who was a former NASA Apollo X astronaut and at the time sat on the board of Omega. He provided great insight as to the type of capabilities the watch would require, and this was further supplemented by the feedback that came from professionals ranging from the Navy Seals to the US Air Force. As a result, the Speedmaster Professional X-33 was born.", " ", "In 2012, a 2nd iteration was introduced with an even more bizarre design, despite maintaining the same level of functionality as the original X-33. It was dubbed the Speedmaster Spacemaster Z-33. It was a flop and as a result, the true heir to the original X-33 was released only two years later- the Skywalker X-33. The watch looks and feels much more reminiscent of the original X-33 but catered to a more modern taste and with even greater technical enhancements.", "The watch is large at 45mm in diameter, but the all-titanium case means the watch wears light. The grade-2 titanium case is a slightly darker grey, which was done deliberately in order to minimize the amount of light reflected. ", "Looking at the dial, you’ll notice that the dial has two levels, with the outer ring indicating the standard hour and minute function, whilst the center containing the LCD, which is backlit to enable greater legibility when in darker settings. In terms of its capabilities, the watch has three different time zones, three alarms, a chronograph and countdown function, and a perpetual calendar. Additionally, the Skywalker integrates a mission elapsed time (MET) and a phase elapsed time (PET), which allows for astronauts to record the time the instant the spacecraft launches. With the PET function, it removes the need for manual calculations to set a timer or an alarm, making it a lot less stressful during high-pressure situations.", "As for the heart of the watch, it is powered by the Cal. 5619, which was developed under an ESA patent license and has a thermo-compensated circuit to negate the undesirable variation that results from changes in the surrounding temperature. The cal. 5619 is hugely important, especially in the context of space because it removes the need for the user to calculate the time elapsed since, or the time remaining until a given event. Making the PET a vital function to have since all space missions are timed in the context of MET or UTC.", " ", "Unlike the first-generation X-33, which was NASA flight approved, this watch is yet to be approved but it has been certified for use in manned space flights by the European Space Agency (ESA) and is currently being used on the ISS. More recently, however, the previous iteration of the X-33 was spotted on the SpaceX Falcon 9 rocket. This was the first time in history that NASA astronauts used a commercially built spacecraft, by Elon Musk no less, to reach the ISS."], "productCr": "This Omega Speedmaster Skywalker X-33 is in excellent condition. It comes as a full set with all of it manuals and brochures, inner and outer box and most importantly, it’s guarantee card. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-X-33-Chronograph_0028_Layer-10.png?v=1596702338", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Skywalker-X-33_0008_Layer-100.png?v=1596702338", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-X-33-Chronograph_0030_Layer-11.png?v=1596702338", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-X-33-Chronograph_0027_Layer-12.png?v=1596702338", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Skywalker-X-33_0006_Layer-103.png?v=1596702338", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-X-33-Chronograph_0025_Layer-14.png?v=1596702338", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Skywalker-X-33_0007_Layer-101.png?v=1596702338", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Skywalker-X-33_0009_Layer-99.png?v=1596702338", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-X-33-Chronograph_0024_Layer-15.png?v=1596702338", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-X-33-Chronograph_0026_Layer-13.png?v=1596702338"]},
{"productYear": "2016", "title": "Tudor Black Bay Bronze", "productPrice": null, "productDescription": ["The Tudor Black Bay is an iconic model for Tudor. It was the line that revived the Tudor name when it was first released back in 2012. When it was released and ever since then, it has struck a chord with collectors and it has consistently been seen as one of the best value watches in the market. The Black Bay was a reinterpretation of Tudor’s rich dive watch history and the brand drew upon design cues from their early Submariners in the 20th century, including the iconic ‘Snowflake’ hands, the ‘Big Crown’ no crown guard stainless steel case and the stainless steel riveted bracelet. With its vintage roots and that famous Rolex quality at such an attractive price point, it is hard not to love the Black Bay. ", "After quite a few years of production, there is now a whole range of Black Bays varying in colours and case material. This Tudor Black Bay Bronze is the same as the rest, but as the name suggests, the case is made entirely from bronze and with that, it is all about one thing and one thing only, patina. Naturally, over time, bronze oxidises and develops a patina. This is an interesting take on the Black Bay as users will get to see their watch change in a relatively short period of time. This example here is in used condition and you can already see patina developing on the case and around the crown. This is certainly not for those after mint pieces, but for those who enjoy a rugged look. "], "productCr": "This Tudor Black Bay Bronze is in used condition. There is patina building up on the case and it has darkened. This is the intention of this watch and a characteristic of bronze. Overtime it will develop more. There is a ding on the top left lug as visible in the photos and the straps are both in used condition. It comes as a full set with its box, card holder, booklets and warranty card.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Bronze-Front-Shot.jpg?v=1552042760", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Bronze-Creative-Shot.jpg?v=1552042760", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Bronze-Wrist-Shot.jpg?v=1552042760", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Bronze-AR-Shot.jpg?v=1552042760", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Bronze-AL-SHot.jpg?v=1552042760", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Bronze-Caseback-Shot.jpg?v=1552042760", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Tudor-Black-Bay-Bronze-Side-Shot.jpg?v=1552042760"]},
{"productYear": "2016", "title": "Zenith El Primero for Hodinkee Unopened", "productPrice": null, "productDescription": ["In horological history, the release of the Zenith El Primero in the late 60’s stands out as one of the more defining moments. Dubbed the first ever automatic chronograph to be made in production, the El Primero to this day remains largely unchanged and truly an icon.", "So what so special about this El Primero? A lot of things. For one, I’m not so much of a fan of the current El Primeros that Zenith has in their collection. I find them too large, with the proportions of the logos, subdials really out of place. This limited edition changes all of that. ", "While it is not a traditional El Primero in the sense that it doesn't feature a tricolour subdial layout and Zenith’s usual branding, it is a faithful recreation of Zenith’s past, as Hodinkee drew upon several historical models. Starting with the 38mm case, it is exactly the same case found on the original Zenith El Primero A386, which was the first ever El Primero released in 1969. The finishing on the case is remarkably accurate too, with thick bevels on the lugs, brushed on top and polished on the sides. The crown is smaller and also features ridged pushers. ", "Flip the watch over, and you will be greeted by Zenith’s in-house El Primero Calibre 4069. The high beat movement beats at 36,000 vph and is already a legendary movement, but Hodinkee took it a step further by requesting that it be adjusted and regulated to within COSC standards. As a result, it has a precision of -4/+6 seconds a day and comes with its official chronometer certification from COSC. It has a power reserve of 50 hours and is water resistant to 50 meters.", "This has to be one of my favourite Hodinkee collaborations as if you know me, you’ll know that I am a proper vintage guy. This is not only faithful to Zenith’s past but also listens to collectors out there to what their perfect watch should be. It is extremely rare with 25 pieces only made and I have no doubt that this is the most collectable Zenith out there. ", "This Zenith El Primero for Hodinkee is brand new and sealed in its box. It comes as a full set including 3 extra straps from Hodinkee, its COSC certificate, official papers from Zenith and its inner and outer box. "], "productCr": "This Zenith El Primero for Hodinkee is in unused condition. It is brand new and remains sealed it is plastic membrane box. It comes as a full set with its inner and outer box, official guarantee and warranty, official chronometer certificate, a Zenith black leather card holder, its instruction manual, a hand written letter from Hodinkee to its original owner and two additional straps in a separate Hodinkee box, one being a black alligator strap made by Zenith and the other a black perforated leather racing strap by Hodinkee. It comes fitted with a dark blue shell cordovan strap by Hodinkee and a Zenith tang buckle.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Zenith-El-Primero-Hodinkee-Front-Shot.jpg?v=1544697456", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Zenith-El-Primero-for-Hodinkee-Creative.jpg?v=1544697456", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Zenith-El-Primero-Hodinkee-AL-Shot.jpg?v=1544697456", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Zenith-El-Primero-Hodinkee-Movement-Shot.jpg?v=1544697456"]}
]