[
{"productYear": "2019", "title": "Patek Philippe Aquanaut Chronograph 5968A", "productPrice": "$130,000.00", "productDescription": ["The Patek Philippe Aquanaut needs no introduction. Launched in 1997 to attract a younger crowd, it was priced as an entry-level Patek Philippe made in stainless steel and equipped with a rubber strap. Marketed as a luxury sport watch and as a younger sibling to the Nautilus, it was not exactly loved when it was first released and it was seen as blasphemous to the identity of Patek Philippe. Well, that didn’t last very long. Fast forward to today and it is, without a doubt, one of the hottest offerings from the manufacture. ", "I am sure all of you would know by now, that perhaps after the Nautilus, the Aquanaut is the hardest model to buy at retail with crazy waitlists. It is no secret that you have to buy many pieces from Patek before they will even let you onto the waitlist. What you may not know though, is that the example you see here today is even scarcer and more in-demand than some of the Nautilus models out there.", "Introduced only in 2018, Patek Philippe unveiled the 5968A- an Aquanaut with a chronograph function. It was only a matter of time before Patek did this and it was certainly long-awaited. Using the same CH 28-250 C movement as the Nautilus chronograph, this is a serious watch and as a result, can no longer be considered the ‘younger sibling’ of the Nautilus. Furthermore, as it is incredibly difficult to be allocated a piece, and with currently only a 2-year production run so far, there are far fewer examples of these on the market than other sought after Pateks.", "On the wrist, it’s 42mm case sits nicely and has some nice weight and heft to it. The most distinctive feature of this watch, of course, is the use of orange both on the strap and the accents on the dial. The Aquanaut was always meant to be a sporty and young watch, and somehow, Patek has managed to make this piece work with the bright orange not coming off tacky at all. I can imagine wearing this on holiday, on the beach or just during the weekend at a barbecue. I’m really not one for bright colors but somehow, this watch has managed to convince me otherwise. What is nice as well, is if you do not feel like the orange, this watch also comes with an uncut, brand new black rubber strap to tone things down a bit when you need to, but for me- it has to be orange.", "The 5968A is just as versatile as any sports watch out there and perfectly encapsulates the term ‘luxury sport’ watch. I am sure you didn’t need to read the above for you to decide whether you love this piece or not. It is one of the most in-demand watches produced today and the perfect do-anything watch."], "productCr": "This Patek Philippe Aquanaut 5968A is in excellent condition. The case is in mint condition with no dings or dents. This watch comes as a full set with all of its accessories including its inner and outer box, papers, and manual. It is fitted on a cut orange Patek Philippe rubber strap and it also comes with an additional black and orange uncut and brand new strap. This watch is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-Chronograph-5968A-2_0015_Layer-67.png?v=1621838895", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-Chronograph-5968A_0016_Layer-54.png?v=1621838895", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-Chronograph-5968A_0010_Layer-63.png?v=1621838895", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-Chronograph-5968A_0009_Layer-66.png?v=1621838895", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-Chronograph-5968A-2_0010_Layer-72.png?v=1621838895", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-Chronograph-5968A_0012_Layer-60.png?v=1621838895", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-Chronograph-5968A_0011_Layer-62.png?v=1621838895", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-Chronograph-5968A-2_0016_Layer-68.png?v=1621838895", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-Chronograph-5968A-2_0011_Layer-71.png?v=1621838895", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-Chronograph-5968A_0013_Layer-59.png?v=1621838895", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-Chronograph-5968A-2_0014_Layer-69.png?v=1621838895", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-Chronograph-5968A-2_0013_Layer-70.png?v=1621838895", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-Chronograph-5968A_0014_Layer-58.png?v=1621838895", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-Chronograph-5968A-2_0012_Layer-73.png?v=1621838895", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-Chronograph-5968A-2_0009_Layer-74.png?v=1621838895", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Aquanaut-Chronograph-5968A_0015_Layer-56.png?v=1621838895"]},
{"productYear": "2019", "title": "Patek Philippe Chronograph 5170P", "productPrice": "$105,000.00", "productDescription": ["Every industry seems to have a brand within it that captures the imaginations of every customer, competing brand and member of the public that gazes upon its designs. In the automotive world, you have Ferrari, in the world of jewelry you have Tiffany & Co., and in the world of horology, you have Patek Philippe. Situated at the zenith of watchmaking for well over a century, Patek Philippe has created some of the most historically significant timepieces of all time.", "In typical Patek Philippe fashion, their timepieces are functional, excellently made, and objectively beautiful, and one such watch that exemplifies this is the ref. 5170. Constructed of platinum and featuring baguette diamond hour markers and an incredibly executed dial, this is a timepiece that both, flies under the radar and packs a serious punch for those that give it a second glance.", "The star of the ref. 5170 is, without a doubt, its dial. Offered with a graduated blue to black dial, which is designated on the Certificate of Origin as \"bleu degrade noir\", the ref. 5170 has to be experienced in the metal to be truly appreciated. The polymerization of its blue to black gradient, a sunburst finish, and grooved chronograph subdials provides one of the most visually appealing dials of any timepiece. In addition to this, as alluded to, the hour markers are baguette diamonds, further enriching the already graceful dial that extra bit and subtly hinting at the luxurious foundations upon which Patek Philippe has been built upon.", "While objectively I’d say that this is a very beautiful watch, the desirability of it is further emphasized by its rarity. Patek Philippe didn’t make and sell many 5170s, but this particular platinum version goes above and beyond that as it was only produced for two years between 2017 and 2019, before being discontinued altogether. I do think that this particular variant of the 5170 is a sleeper and one that will be insanely collectible once people start to realize it. ", "While not overly complicated, the ref. 5170 perfectly captures everything that a Patek Philippe timepiece is. Gorgeously designed and fantastically finished, the attention to detail on display here is second to none. It is only through appreciating timepieces like the ref. 5170 does it become blatantly obvious why Patek Philippe resides within the Holy Trinity, as watchmakers par excellence. "], "productCr": "This Patek Philippe 5170P is in mint condition. It comes as a full set with all of its original paperwork, manual, leather folder, brochures, inner box, and outer box. It has been recently serviced by Patek Philippe and is in full working order. The strap is brand new and unused.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0006_Curves-1.png?v=1622590310", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0042_Layer-36.png?v=1622590310", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0036_Layer-45.png?v=1622590310", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0034_Layer-47.png?v=1622590310", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0043_Layer-35.png?v=1622590310", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0007_Layer-140.png?v=1622590310", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0003_Layer-143.png?v=1622590310", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0040_Layer-33.png?v=1622590310", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0001_Layer-145.png?v=1622590310", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0038_Layer-41.png?v=1622590310", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0041_Layer-31.png?v=1622590310", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0004_Layer-142.png?v=1622590310", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0005_Layer-141.png?v=1622590307", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0002_Layer-144.png?v=1622589984", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0039_Layer-39.png?v=1622589984", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0037_Layer-43.png?v=1622589984", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P-2_0035_Layer-48.png?v=1622589984"]},
{"productYear": "2000s", "title": "Cartier Tortue Monopoussoir CPCP", "productPrice": "$60,000.00", "productDescription": ["The name Cartier needs no introduction. As one of the most influential and celebrated jewellery and watch brands of the last 100 years, it has always stood as a mark of luxury and desirability. Without taking away from its historical significance, I would say that when it comes to watches, Cartier has always been predominantly known as a ‘design’ brand rather than a pure watchmaking one, with stunningly iconic models such as the Tank, the Crash and the Santos all seen as important due to how it looks. In fact, to this day, it is the beautiful and unconventional designs that attract collectors and a unique position in the watch brand hierarchy that no other possesses. ", "As I have mentioned many times, the ’90s was an unconventional and murky time for watch brands, having just come out of the quartz crisis that decimated most of the industry. Brands were either experimenting like crazy or strictly conservative, wary of the fact they just survived the equivalent of a nuclear bomb. The industry was slowly coming back, with consumers beginning to take an interest in mechanical watches and with this in mind, Cartier decided that I was time to improve its image as a true watchmaking brand. ", "The result was the Collection Privé Cartier Paris division, referred to simply as the CPCP. The intention of the CPCP was to be the premier mechanical watchmaking division of Cartier and looking back on it today, it was one of the best decisions they ever made. The philosophy was simple, the CPCP took iconic models that were already loved by many, and reproduced them with high-grade movements, working with bonafide watch manufactures such as Piaget, Jaeger-LeCoultre, Frédéric Piguet, Girard-Perregaux and more. ", "The easiest way to differentiate a CPCP watch was by the dial, with all but one model (Tank Cintrée) featuring a ‘Cartier Paris’ inscription- an ode to its heritage. The dials were always crafted from solid gold and often featured a strong hand-turned guilloche pattern.", "The CPCP collection ran for 10 years between 1998 and 2008 and I can confidently say it is one of the most significant periods in Cartier’s history. It’s beautiful to see that Cartier was doing ‘reissues’ before it was even a thing and doing it the right way- respecting the past while producing something that is modern. Not only this, but the CPCP models were produced in truly limited numbers, with many having a designated run of 50 to 100 pieces. For those in the Collection Privé that weren’t strictly ‘limited’, it is estimated that only 250-300 pieces were made for each reference making any CPCP watch out there truly special. "], "productCr": "This Cartier Tortue Monopoussoir is in excellent condition. It comes as a watch only and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-WG-2_0032_Layer-90.png?v=1622591495", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-WG-2_0019_Layer-55.png?v=1622691278", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-WG-2_0012_Layer-67.png?v=1622691278", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-WG-2_0013_Layer-65.png?v=1622691278", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-WG-2_0001_Layer-69.png?v=1622691278", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-WG-2_0018_Layer-57.png?v=1622691278", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-WG-2_0017_Layer-58.png?v=1622691278", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-WG-2_0027_Layer-95.png?v=1622691276", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-WG-2_0028_Layer-94.png?v=1622691275", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-WG-2_0029_Layer-96.png?v=1622691275", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-WG-2_0033_Layer-91.png?v=1622591495", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-WG-2_0031_Layer-92.png?v=1622591495", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-WG-2_0030_Layer-93.png?v=1622591495", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-WG-2_0026_Layer-97.png?v=1622591495", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-WG-2_0025_Layer-98.png?v=1622591495", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Monopoussoir-CPCP-WG-2_0016_Layer-59.png?v=1622591495"]},
{"productYear": "2005", "title": "Cartier Tortue Perpetual Calendar CPCP", "productPrice": null, "productDescription": ["The name Cartier needs no introduction. As one of the most influential and celebrated jewelry and watch brands of the last 100 years, it has always stood as a mark of luxury and desirability. Without taking away from its historical significance, I would say that when it comes to watches, Cartier has always been predominantly known as a ‘design’ brand rather than a pure watchmaking one, with stunningly iconic models such as the Tank, the Crash, and the Santos all seen as important due to how it looks. In fact, to this day, it is the beautiful and unconventional designs that attract collectors and a unique position in the watch brand hierarchy that no other possesses. ", "As I have mentioned many times, the ’90s was an unconventional and murky time for watch brands, having just come out of the quartz crisis that decimated most of the industry. Brands were either experimenting like crazy or strictly conservative, wary of the fact they just survived the equivalent of a nuclear bomb. The industry was slowly coming back, with consumers beginning to take an interest in mechanical watches, and with this in mind, Cartier decided that it was time to improve its image as a true watchmaking brand. ", "The result was the Collection Privé Cartier Paris division, referred to simply as the CPCP. The intention of the CPCP was to be the premier mechanical watchmaking division of Cartier and looking back on it today, it was one of the best decisions they ever made. The philosophy was simple, the CPCP took iconic models that were already loved by many, and reproduced them with high-grade movements, working with bonafide watch manufactures such as Piaget, Jaeger-LeCoultre, Frédéric Piguet, Girard-Perregaux, and more. ", "The CPCP collection ran for 10 years between 1998 and 2008 and I can confidently say it is one of the most significant periods in Cartier’s history. It’s beautiful to see that Cartier was doing ‘reissues’ before it was even a thing and doing it the right way- respecting the past while producing something that is modern. Not only this but the CPCP models were produced in truly limited numbers, with many having a designated run of 50 to 100 pieces. For those in the Collection Privé that weren’t strictly ‘limited’, it is estimated that only 250-300 pieces were made for each reference making any CPCP watch out there truly special. ", "Collectors are finally taking notice of this, and Cartier in general as a brand worth collecting. With more knowledge available now, the demand for Cartier has been huge and I only see it getting larger, especially for important references such as those from the CPCP line. "], "productCr": "This Cartier Tortue Perpetual Calendar CPCP is in excellent condition. There are minor swirls and hairlines from previous use. It comes as a full set with its Collection Prive box, papers, and manual. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-XL-CPCP-RG_0023_Layer-99.png?v=1622591736", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-CPCP-RG_0003_Layer-72.png?v=1622591737", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-CPCP-RG_0008_Layer-63.png?v=1622591739", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-CPCP-RG_0009_Layer-56.png?v=1622591740", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-XL-CPCP-RG_0019_Layer-104.png?v=1622591742", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-CPCP-RG_0011_Layer-70.png?v=1622591744", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-CPCP-RG_0006_Layer-66.png?v=1622591745", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-XL-CPCP-RG_0020_Layer-103.png?v=1622591747", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-XL-CPCP-RG_0017_Layer-106.png?v=1622591749", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-CPCP-RG_0007_Layer-64.png?v=1622591751", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-XL-CPCP-RG_0024_Layer-100.png?v=1622591757", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-XL-CPCP-RG_0022_Layer-101.png?v=1622591752", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-CPCP-RG_0004_Layer-68.png?v=1622591755", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-XL-CPCP-RG_0021_Layer-102.png?v=1622591754", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-XL-CPCP-RG_0018_Layer-105.png?v=1622591758", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-CPCP-RG_0005_Layer-71.png?v=1622591760", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tortue-Perpetual-Calendar-CPCP-RG_0002_Layer-73.png?v=1622591761"]},
{"productYear": "2021", "title": "Patek Philippe Chronograph 5172G", "productPrice": "$69,000.00", "productDescription": ["Existing amongst some of their best-known watches, the Patek Philippe Chronograph is a model that has always welcomed serious scrutiny from collectors. Due to the complexity and capital required, the in-house chronograph movement has always been a test of a brand’s capability and for Patek Philippe, this was something to be taken extremely seriously.", "Launched in 2019, the Chronograph ref. 5172G had big shoes to fill with the outgoing 5170 and the legendary 5070 that came before that. ", "Starting with its design, the ref. 5172G features a classical aesthetic that blends the golden vintage era that so many collectors lust over with modern manufacturing techniques and design cues. Framed in a 41mm x 11.45mm round white gold case, the ref. 5172G features a grainy, pared-back navy blue dial with white gold, applied Arabic numerals, syringe hands, and two subdials found just below the 3 to 9 o'clock hemisphere- one the running seconds and the other the chronograph 30-minute counter. With a tachymeter scale around its periphery, the ref. 5172G's dial is legible, functional, and downright stunning. ", "The ref. 5172G's white gold case enhances its vintage-inspired aesthetic far beyond the reach of its dial. With its fluted lugs, stepped mid-case, and pump pushers, it is remarkably reminiscent of the 1940s Patek ref. 1463. With their sunburst decoration on their tips, the ref. 5172's pump pushers are directly inspired by its predecessor, while its crown is a slight departure thanks to its flatter and more ergonomic profile, which offers a hint of modern design to the timepiece. ", "Beyond its incredible construction and gorgeous dial, the crème de la crème of manual-wind chronograph movements is found in the ref. 5172G, as exhibited by its sapphire crystal caseback. Featuring a 65-hour power reserve, a vertical clutch, a column wheel assembly, and Patek's impeccable finishing, the CH 29-535 PS took five years to design and create with six patents found within. An incredible testament to Patek's ingenuity, this movement is a wonderful reminder of Patek's horological merit. While the ref. 5172G might fly under the radar; a second glance will reveal the depth of detail found in this watch, from its case to its pushers, to its movement and beyond. A fantastic exhibition of Swiss watchmaking, this isn't your typical dress chronograph; this is what every other dress chronograph wishes it could be."], "productCr": "This Patek Philippe Chronograph 5172G is in mint condition. It comes as a full set with its box, papers and original documents. It is in full working order and continues to be under Patek Philipe’s warranty.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5172G_0013_Layer-132.png?v=1622590230", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5172G-_0031_Layer-37.png?v=1622590232", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5172G-_0030_Layer-38.png?v=1622590233", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5172G-_0026_Layer-46.png?v=1622590235", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5172G-_0028_Layer-42.png?v=1622590237", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5172G_0009_Layer-137.png?v=1622590238", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5172G-_0032_Layer-34.png?v=1622590240", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5172G_0008_Layer-138.png?v=1622590241", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5172G_0014_Layer-133.png?v=1622590243", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5172G_0012_Layer-134.png?v=1622590244", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5172G_0011_Layer-135.png?v=1622590246", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5172G_0010_Layer-136.png?v=1622590249", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5172G-_0033_Layer-32.png?v=1622590247", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5172G-_0029_Layer-40.png?v=1622590250", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5172G-_0027_Layer-44.png?v=1622590252"]},
{"productYear": "2000's", "title": "Vianney Halter Classic", "productPrice": null, "productDescription": ["It is not often the case we can call a watch entirely unique and original, but if someone were to get close, Vianney Halter would have to be in the conversation. One of the early pioneers of the independent movement, Vianney Halter existed before collecting independents a trend. Small scale and taking his time, he has become known today for his distinctive aesthetic. ", "This is the Vianney Halter Classic, one of his most iconic, next to the more complicated Antiqua. A time only piece, it is housed in a 36mm 18k white gold case and features real rivets on the edge of the case along with a studded crown. Two nibs on the top and bottom of the case connect the lugs which hold the strap, rounding off this undoubtedly steampunk style watch. The case is finished with a circular brushing at the top and polished sides, adding a nice depth to the overall look. Wearing and winding the watch, I found it to be a very pleasant tactile experience, from the grip of the studded crown and touching the different surfaces of the watch. ", "The dial is incredibly beautiful on this Classic, with radial stylized Arabic numerals sitting atop a circular brushed silver surface. Towards the center of the dial, there is contrast with the graining and this is topped off with the delicately beautiful curved blued hands. ", "Powering this watch is a heavily modified Lemania 8810 with a mystery ‘sapphire’ rotor that allows the user to see the movement undisturbed. There are weights on the periphery of the rotor to allow effective oscillation and the movement looks simple but is nevertheless expertly finished with curved angles along the way. ", "At a first glance, the Vianney Halter Classic looks like a relatively simple and novel watch, but the more you look at it the more you realize how much attention to detail has gone into it- from the case design to the textures of the dial and finishing of the movement. Limited to 250 pieces and released in 2001, this is truly a rare and exclusive watch that looks completely unique to what is available in the market today. "], "productCr": "This Vianney Halter is in mint condition. It comes as a full set with box and papers and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG-_0016_Layer-115.png?v=1622589445", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG_0071_Layer-4.png?v=1622589448", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG_0067_Layer-12.png?v=1622589450", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG_0065_Layer-6.png?v=1622589452", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG-_0011_Layer-119.png?v=1622589453", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG-_0017_Layer-116.png?v=1622589458", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG_0066_Layer-14.png?v=1622589456", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG_0073_Layer-1.png?v=1622589455", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG-_0010_Layer-120.png?v=1622589460", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG-_0013_Layer-118.png?v=1622589463", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG_0069_Layer-9.png?v=1622589461", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG-_0014_Layer-117.png?v=1622589468", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG_0070_Layer-5.png?v=1622589465", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG-_0015_Layer-122.png?v=1622589470", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG_0072_Layer-3.png?v=1622589472", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG_0068_Layer-11.png?v=1622589474", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vianney-Halter-Classic-WG-_0012_Layer-121.png?v=1622589475"]},
{"productYear": "2004", "title": "A. Lange & Sohne Datograph 403.035", "productPrice": "$70,000.00", "productDescription": ["Released in 1999, the Lange & Söhne Datograph is rightfully heralded as one of the most influential chronograph wristwatches to have ever been brought to market. Launched five years after Lange was re-established by Walter Lange, the Datograph culminated in years of laborious research and development. Bearing in mind, this was a period when brands like Rolex, Patek, Audemars Piguet, Vacheron Constantin, and so many other famous watchmakers were still using third-party chronograph movements from brands like Zenith and Lemania. The A. Lange & Sohne Datograph is the watch that sparked the in-house revolution that is still ongoing to this day.", "A notoriously tricky movement to design and manufacture, the Datograph's chronograph cal. L951.1 movement symbolized the German watchmaker's triumphant return to the apex of horology. Featuring an innovative fly-back feature and a patented jumping minutes counter, the manual-wind cal. L951.1 was as impressive as a chronograph movement could be. Comprised of 405 hand-finished and polished parts, the cal. L951.1 proudly announced both Lange's intent to challenge the predominantly Swiss horological status quo and their belief in the Datograph as a watch that would perform commercially. A movement as finely finished and complicated as the cal. L951.1 was not cheap to produce.", "Hailed by many as the greatest chronograph movement of all time, including the likes of Philippe Dufour who owns one personally, what makes this movement so crazy is just how beautiful it looks. Architecturally, it has an amazing three-dimensionality to it that other chronograph movements lack. With its bridges and plates made out of German silver, the overall tone achieved is much warmer and nicer to look at compared to the often sterile-looking silver-colored Swiss movements. Making a movement is not just about technicality but also about design and proportionality. Topping it off with incredible hand-finished anglage and the classic engraved balance cock, it doesn’t get any better than this. ", "While the Datograph's movement is certainly iconic, its design has become legendary, and for a good reason. Featuring Lange's signature oversized quick-set date apertures, two panda chronograph subdials found at 4 and 8 o'clock, and a stacked tachymeter scale along its periphery, the Datograph's black dial has become deeply ingrained within its overall look. Furthermore, the round 39mm x 11.8mm platinum case found on first-generation Datographs, like the example I have here, has become the quintessential design for this iconic watch. While other metals have since entered the foray, platinum reigns as the most iconic metal used. ", "Compounded upon by the beautiful case and dial design, the Datograph's movement, finishing, overall build, and position as the watch that forced so many other high-end watchmakers to begin going in-house has enabled it to become a legendary timepiece. Offered as a complete full set, the first generation example I have here is a true collector’s piece thanks to the profound impact it has had on both horology and Germany’s best watchmaker."], "productCr": "This A. Lange & Sohne Datograph is in excellent condition. It has minor hairlines from previous use. It comes as a full set with its inner and outer box, guarantee and manual. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-PT-First-Gen_0008_Layer-123.png?v=1622592555", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-First-Gen-Platinum-_0055_Layer-20.png?v=1622592559", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-First-Gen-Platinum-_0054_Layer-21.png?v=1622592560", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-First-Gen-Platinum-_0050_Layer-30.png?v=1622592567", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-PT-First-Gen_0002_Layer-130.png?v=1622592564", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-First-Gen-Platinum-_0051_Layer-27.png?v=1622592566", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-PT-First-Gen_0004_Layer-128.png?v=1622592573", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-First-Gen-Platinum-_0053_Layer-24.png?v=1622592569", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-PT-First-Gen_0001_Layer-131.png?v=1622592571", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-PT-First-Gen_0005_Layer-127.png?v=1622592581", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-First-Gen-Platinum-_0057_Layer-18.png?v=1622592576", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-PT-First-Gen_0009_Layer-124.png?v=1622592574", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-PT-First-Gen_0007_Layer-125.png?v=1622592563", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-First-Gen-Platinum-_0052_Layer-25.png?v=1622592579", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-PT-First-Gen_0006_Layer-126.png?v=1622592577", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-PT-First-Gen_0003_Layer-129.png?v=1622592582", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-First-Gen-Platinum-_0058_Layer-17.png?v=1622592584", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/A.-Lange-_-Sohne-Datograph-First-Gen-Platinum-_0056_Layer-19.png?v=1622592585"]},
{"productYear": "2019", "title": "Patek Philippe Calatrava Weekly Calendar 5212A", "productPrice": "$45,000.00", "productDescription": ["Released in 2019, the Patek Philippe Calatrava Weekly Calendar ref. 5212A breaks from the Calatrava collection's utilitarian and straightforward aesthetic, thanks to its moderately busy yet wholly functional and remarkably legible display. Inspired by the case of a historically important 1955 Patek Philippe ref. 2512, the ref. 5212A combines a vintage-inspired aesthetic with an entirely modern complication.", "While the ref. 2512 that inspired the ref. 5212A's design is made of yellow gold, the ref. 5212A features a stainless steel case – a rarity for the Calatrava collection. Where the ref. 5212A's aesthetic is vintage-inspired is its two-tiered case and lug design – an aesthetic element borrowed from its 1955 distant cousin. This adds sophistication and elegance and is in line with the current direction of Patek Philippe's design, using more decorative lugs to make their dress watches more unique and interesting. ", "Sized at 40mm in diameter and 10.8mm thick, the ref. 5212A is a comfortable and elegant timepiece to wear thanks to its ergonomic dimensions, angled lugs, and classical calfskin leather strap.", "Beyond its aesthetic design, the engineering forethought that has gone into the ref. 5212A is not to be overlooked. In keeping with its comfortable 'everyday' 40mm stainless steel case, the ref. 5212A features an incredibly legible silver opaline dial with black handwritten-style inscriptions and markings. Featuring a day, week of the year, and month display all alongside its hours, minutes, seconds, and date functions, the ref. 5212A is incredibly useful for anyone whose professional industry refers explicitly to the week of the year, like finance, supply chain management, and so on. This \"useful complication\", as Patek calls it, ensures the ref. 5212A is a practical choice as an everyday timepiece."], "productCr": "This Patek Philippe Calatrava Weekly Calendar 5212A is in excellent condition. There are very minor hairlines from previous use. It comes as a full set with its box, papers, and associated documents and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrava-Weekly-Calendar-5212A_0015_Layer-75.png?v=1622590552", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Weekly-Calendar-5212A_0061_Layer-10.png?v=1622590554", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Weekly-Calendar-5212A_0063_Layer-7.png?v=1622590556", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrava-Weekly-Calendar-5212A_0009_Layer-89.png?v=1622590558", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Weekly-Calendar-5212A_0062_Layer-8.png?v=1622590559", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrava-Weekly-Calendar-5212A_0010_Layer-79.png?v=1622590561", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Weekly-Calendar-5212A_0064_Layer-2.png?v=1622590562", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Weekly-Calendar-5212A_0059_Layer-15.png?v=1622590564", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Weekly-Calendar-5212A_0060_Layer-13.png?v=1622590566", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrava-Weekly-Calendar-5212A_0016_Layer-76.png?v=1622590567", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrava-Weekly-Calendar-5212A_0014_Layer-77.png?v=1622590569", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrava-Weekly-Calendar-5212A_0011_Layer-74.png?v=1622590572", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrava-Weekly-Calendar-5212A_0012_Layer-80.png?v=1622590577", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Calatrava-Weekly-Calendar-5212A_0013_Layer-78.png?v=1622590570"]},
{"productYear": "1997", "title": "Cartier Tank Americaine Hong Kong LE 97", "productPrice": "$32,000.00", "productDescription": ["The name Cartier needs no introduction. As one of the most influential and celebrated jewelry and watch brands of the last 100 years, it has always stood as a mark of luxury and desirability. Without taking away from its historical significance, I would say that when it comes to watches, Cartier has always been predominantly known as a ‘design’ brand rather than a pure watchmaking one, with stunningly iconic models such as the Tank, the Crash, and the Santos all seen as important due to how it looks. In fact, to this day, it is the beautiful and unconventional designs that attract collectors and a unique position in the watch brand hierarchy that no other possesses. ", "While many of Cartier’s design dates back to the early 20th century, the Tank Americaine is a relatively new creation. Released in 1989 and intended to be a more accessible and masculine version of the flagship Tank Cintree, it was released as a normal and unspectacular quartz watch. The dimensions of the Tank Americaine were enlarged, swapping the Cintree’s elongated case for a thicker and wider watch with more presence. ", "It wasn’t until 1993 that Cartier released a mechanical version of the Americaine, and since then, this model has been a mainstay in the company’s model lineup. Many variations of the Cartier Tank Americaine has been released since then, with different sizes and dials, but one of the most peculiar and collectible versions is the example you see here today- the Cartier Tank Americaine Hong Kong Limited Edition, released in 1997 to celebrate Hong Kong’s handover from the British to China. ", "Cartier is famously known for being a design powerhouse and its enduring appeal is down to one reason. As Pierre Rainero, the Director of Image, Style & Heritage for Cartier said, it is because of their strong design fundamentals and their capacity to evolve and provide a sense of continuity. What started as a simple Tank watch has evolved to a multitude of equally iconic designs, from the Tank Basculante and the Tank Obus to the Tank Cintree and the Tank Americaine to name a few, Cartier has managed to transpose its original designs into a family of icons. While the Americaine is late to the party, it certainly has its place in Cartier’s rich heritage.", "With only 97 pieces produced, this Cartier Tank Americaine Hong Kong Limited Edition is extremely rare. With the recent resurgence of Cartier, collectors are increasingly looking to find rare references, with this watch being the perfect example. "], "productCr": "This Cartier Tank Americaine Hong Kong Limited Edition is in good condition. The case is unpolished and the hallmarks are sharp. There are hairlines throughout consistent with a watch of this age. It comes as a watch only and is in full working order. It has been recently serviced.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Hong-Kong-LE-Salmon-2_0008_Layer-108.png?v=1622591943", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Hong-Kong-97-Salmon-2_0025_Layer-49.png?v=1622591945", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Hong-Kong-97-Salmon-2_0022_Layer-52.png?v=1622591946", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Hong-Kong-LE-Salmon-2_0003_Layer-110.png?v=1622591948", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Hong-Kong-LE-Salmon-2_0002_Layer-113.png?v=1622591949", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Hong-Kong-97-Salmon-2_0023_Layer-51.png?v=1622591951", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Hong-Kong-LE-Salmon-2_0001_Layer-114.png?v=1622591956", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Hong-Kong-97-Salmon-2_0024_Layer-50.png?v=1622591954", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Hong-Kong-LE-Salmon-2_0007_Layer-107.png?v=1622591953", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Hong-Kong-97-Salmon-2_0020_Layer-54.png?v=1622591957", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Hong-Kong-LE-Salmon-2_0006_Layer-111.png?v=1622591960", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Hong-Kong-LE-Salmon-2_0005_Layer-109.png?v=1622591961", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Hong-Kong-LE-Salmon-2_0004_Layer-112.png?v=1622591963", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Americaine-Hong-Kong-97-Salmon-2_0021_Layer-53.png?v=1622591964"]},
{"productYear": "2020", "title": "Urban Jurgensen Big 8 London Edition", "productPrice": null, "productDescription": [], "productCr": "This Urban Jurgensen Big 8 is in mint condition. It comes as a full set with its box and papers and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition-Front_0021_Layer-115.png?v=1621838059", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition-_0006_Layer-28.png?v=1621838065", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition-_0003_Layer-31.png?v=1621838065", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition-_0002_Layer-32.png?v=1621838065", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition-_0009_Layer-25.png?v=1621838065", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition-_0008_Layer-26.png?v=1621838065", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition-_0004_Layer-30.png?v=1621838065", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition_0001_Layer-122.png?v=1621838065", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition_0004_Layer-119.png?v=1621838065", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition-_0007_Layer-27.png?v=1621838031", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition-_0005_Layer-29.png?v=1621838031", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition-_0001_Layer-33.png?v=1621838031", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition_0008_Layer-116.png?v=1621838031", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition_0006_Layer-117.png?v=1621838031", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition_0005_Layer-118.png?v=1621838031", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition_0003_Layer-120.png?v=1621838031", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Urban-Jurgensen-Big-8-London-Edition_0002_Layer-121.png?v=1621838031"]},
{"productYear": "2016", "title": "Vacheron Constantin Overseas 4500V Black", "productPrice": "$28,000.00", "productDescription": ["Originally released in 1996, the Vacheron Constantin Overseas was the revival of Vacheron's first sports watch, the 222. Like many other iconic timepieces, the Overseas has evolved over the years with three distinct generations under its belt. The current generation was recently released in 2016 and features some aesthetic design elements from previous generations, while also featuring modern creature comforts and luxuries that Vacheron has pioneered. In my opinion, this current generation is the best Overseas line the brand has ever produced. ", "Perhaps the last accessible high-end stainless steel sports watch, the Overseas competes with the likes of the Audemars Piguet Royal Oak and Patek Philippe Nautilus in terms of quality, finishing, and engineering, but is currently priced at a steal. For a long time, the Overseas has lived in the shadow of the aforementioned watches but since the revamp in 2016, it has slowly started to stand on its own with qualities that I think, are even better than the Royal Oak or Nautilus. ", "Sized at 41mm and tonneau-shaped with a Maltese style bezel, the case is finished excellently with brushed and polished surfaces throughout the case all the way to each bracelet link. Integrated as all luxury sports watches are these days, the bracelet is perhaps one of the stars of the show. Engineered with an innovative quick-release functionality, the Overseas Maltese cross-inspired integrated bracelet can be swapped in seconds for either of the two straps provided with the watch; a suave Mississippiensis alligator leather strap or sporty textured rubber strap. Furthermore, the Overseas bracelet features an incredible extension system on either side of its hidden butterfly clasp that can provide 2mm on either side of the bracelet's partition. None of the Vacheron’s rivals provides any functionality close to this, quite the opposite actually. The Royal Oak and Nautilus annoyingly having a strap and bracelet-specific references- so if you want your bracelet 5711 with a strap, you just have to buy a whole new watch that allows for it. ", "Dedicated to going the extra mile, the Vacheron Constantin Overseas ref. 4500V features one of the most incredible dials in all of watchmaking. A jet black lacquered dial with white gold indices and silver contrasting logos, this dial provides a monochromatic edge to their Overseas' aesthetic while also being extremely legible with two separate chapter rings, one for the minutes along the dial periphery and one for seconds along the rehaut. The depth achieved from the mirrored lacquer finish is amazing. ", "Featuring satin-brushed finishing along with the majority of its 41mm x 11mm case, the Overseas' polished sides and Maltese cross bezel both pop in conjunction with the incredible black dial. Powered by the stunning in-house automatic cal. 5500 movement, the Overseas ref. 4500V features a 22k gold oscillating weight, 60 hours of power reserve, and a myriad of finishing techniques, all on display behind the Overseas' sapphire crystal exhibition screw-down caseback, which aids in providing 150m of water resistance.", "All in all, it is only a matter of time before the Overseas begins to appreciate in tandem with its Holy Trinity counterparts. In fact, waitlists are growing at boutiques just like how the Nautilus and Royal Oak did a few years ago (hint hint). Relatively accessible at the moment given its incredible craftsmanship and rich heritage, collectors will soon understand the plethora of strengths this timepiece has as a luxury sports watch hailing from one of the big three."], "productCr": "This Vacheron Constantin Overseas 4500V is in good condition. There are very minor hairlines and scuffs from previous use, visible in the photography. It is in full working order and comes as a full set with its box and papers and two additional rubber and alligator straps.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0007_Layer-112.png?v=1621838187", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0033_Layer-1.png?v=1621838188", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0027_Layer-10.png?v=1621838190", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0003_Layer-109.png?v=1621838192", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0001_Layer-111.png?v=1621838193", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0030_Layer-5.png?v=1621838196", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0025_Layer-15.png?v=1621838197", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0031_Layer-4.png?v=1621838199", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0026_Layer-12.png?v=1621838200", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0002_Layer-110.png?v=1621838203", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0029_Layer-7.png?v=1621838204", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0006_Layer-114.png?v=1621838207", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0005_Layer-107.png?v=1621838211", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0028_Layer-9.png?v=1621838212", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0008_Layer-113.png?v=1621838214", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0032_Layer-2.png?v=1621838216", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Vacheron-Constantin-Overseas-4500V-Black_0004_Layer-108.png?v=1621838218"]},
{"productYear": "2011", "title": "Patek Philippe World Time 5130G", "productPrice": "$32,000.00", "productDescription": ["Watchmakers often have specific complications that speak to their heritage, DNA and strengths, and Patek Phillipe is no different. An excellent example of this very complication is the World Time, an ingenious complication that displays the time in 24 time zones across the globe that Patek Philippe popularised in the mid-1950s. ", "Released in 2006, the Patek Philippe World Time ref. 5130 replaced the ref. 5110 that had debuted six years earlier just in time for the new millennium. With its beautifully elegant 39.5mm case, the ref. 5130 quickly rose to popularity as the ultimate Patek Philippe World Time thanks to its stunning craftsmanship and beautiful construction. With its white gold case housing an incredible silver dial featuring an exquisite sunburst guilloche engraving within its centre, the ref. 5130's dial is inspired by the World Timers that came before it. Contrasting the guilloche centre portion lies a graduated 24-hour ring and a satin-brushed dial periphery that houses the names of the 24 cities that each represent a specific time zone in a simple, legible font. ", "Featuring a wonderfully elegant and polished white gold case with a simple domed bezel, a crown at 3 o'clock and a pusher at 10 o'clock to advance through the time zones, the ref. 5130's aesthetic is one of understated class. Powered by the automatic cal. 240 HU comprised of 239 parts, a 22kt gold micro-rotor and beautiful finishing throughout, the ref. 5130's exhibition case back provides a visual delight as the cal. 240's micro-rotor construction offers a virtually unobstructed view of the craftsmanship that has made Patek Philippe so iconic. ", "Perhaps the perfect travelling companion for someone with interests in more than one city, the World Time complication aided in the globalisation of the world during the 20th century and reminds us today of just how connected we are as a society - a testament to the power of fine mechanical horology. "], "productCr": "This Patek Philippe 5130G is in excellent condition. There are no dings or scratches on the case. There is some wear to the strap but it is in overall good condition. This Patek Philippe comes as a full set with its box, papers and manuals and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-World-Time-5130G_0006_Layer-99.png?v=1621838584", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-World-Time-5130G_0007_Layer-52.png?v=1621838586", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-World-Time-5130G_0002_Layer-64.png?v=1621838587", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-World-Time-5130G_0001_Layer-65.png?v=1621838589", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-World-Time-5130G_0002_Layer-104.png?v=1621838590", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-World-Time-5130G_0005_Layer-55.png?v=1621838592", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-World-Time-5130G_0001_Layer-105.png?v=1621838594", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-World-Time-5130G_0008_Layer-51.png?v=1621838595", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-World-Time-5130G_0007_Layer-100.png?v=1621838597", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-World-Time-5130G_0003_Layer-61.png?v=1621838598", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-World-Time-5130G_0004_Layer-102.png?v=1621838605", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-World-Time-5130G_0006_Layer-53.png?v=1621838601", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-World-Time-5130G_0005_Layer-101.png?v=1621838603", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-World-Time-5130G_0004_Layer-57.png?v=1621838608", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-World-Time-5130G_0003_Layer-103.png?v=1621838611"]},
{"productYear": "1990s", "title": "Audemars Piguet Edward Piguet 25853OR Perpetual Calendar", "productPrice": "$35,000.00", "productDescription": ["Famed for their Royal Oak, Audemars Piguet is a brand that has permeated most of the watch industry in one way or another. Established as one of the \"Holy Trinity\" brands, Audemars Piguet is known to create some of the most exquisite examples of Haute Horlogerie in the market today. While the Royal Oak and its associated Offshore and Concept models are often vehicles to display their high-end mechanics, there exists another model that has also had that pleasure, the Edward Piguet.", "Named after one of AP's two founding fathers, the Edward Piguet embodies AP's traditional values, free of the sports watch hype and fervent lust for stainless steel timepieces. A classic watch with elegance and beauty at its very core, the Edward Piguet collection has always remained true to the art of high-end watchmaking throughout its history.", "Offered here, I have a limited edition Edward Piguet ref. 25853OR \"Quantième Perpétuel\" from the early 1990s. Limited to just 50 pieces, this is one of the rarest and most visually unique timepieces AP has ever made. Featuring a 27x45mm rectangular case made of 18kt pink gold, this Edward Piguet has an immediately distinctive design, especially for an AP. Featuring a stunning black dial with pink gold Breguet numerals and subsidiary dials, this ref. 25853OR carries a wonderfully consistent aesthetic throughout its design.", "A perpetual calendar, the ref. 25853OR is powered by the incredible calibre 2141 movement, as displayed behind the exhibition caseback at the timepiece's rear. The true flourish to demonstrate just how special this watch is, the movement features incredibly detailed hand-engraved decorations to continue the ref. 25853OR's incredible visual display beyond just its dial and construction.", "An incredibly important complication for AP, perpetual calendars occupy the number one spot as the most sought-after AP watches on the market. With the complication's importance to AP well established, collectors seek it out in an attempt to own a piece of watchmaking history. Having pioneered the first true perpetual calendar with a leap year indicator, today's collectors view AP as the complication's creator and thus holds AP's perpetual calendar models to very high esteem.", "With the rapid growth in demand for AP's perpetual calendars, this Edward Piguet ref. 25853OR's position as a limited edition example of a finely produced watch with unique dimensions and a wonderfully decorated movement renders it an extremely rare and fleeting opportunity to add what is viewed as a distillation of AP's horological prowess to one's own collection."], "productCr": "This Audemars Piguet Royal Oak 25853OR is in excellent condition. The case is thick and all of its engravings remains deep and legible. There are minor hairlines throughout consistent with a watch of this age. This watch is in full working order and comes as a watch only.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Edward-Piguet-25853OR-Perpetual-Calendar_0001_Layer-1.png?v=1616486667", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Edward-Piguet-25853OR-Perpetual-Calendar_0025_Layer-66.png?v=1616486669", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Edward-Piguet-25853OR-Perpetual-Calendar_0021_Layer-69.png?v=1616486671", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Edward-Piguet-25853OR-Perpetual-Calendar_0006_Layer-4.png?v=1616486673", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Edward-Piguet-Perpetual-Calendar-25853OR_0022_Layer-36.png?v=1616486675", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Edward-Piguet-25853OR-Perpetual-Calendar_0024_Layer-67.png?v=1616486677", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Edward-Piguet-25853OR-Perpetual-Calendar_0022_Layer-68.png?v=1616486679", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Edward-Piguet-25853OR-Perpetual-Calendar_0007_Layer-3.png?v=1616486681", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Edward-Piguet-25853OR-Perpetual-Calendar_0002_Layer-2.png?v=1616486683", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Edward-Piguet-25853OR-Perpetual-Calendar_0003_Layer-7.png?v=1616486684", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Edward-Piguet-25853OR-Perpetual-Calendar_0004_Layer-6.png?v=1616486686", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Edward-Piguet-25853OR-Perpetual-Calendar_0005_Layer-5.png?v=1616486687", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Edward-Piguet-25853OR-Perpetual-Calendar_0023_Layer-70.png?v=1616486689", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Edward-Piguet-25853OR-Perpetual-Calendar_0026_Layer-65.png?v=1616486691", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Edward-Piguet-Perpetual-Calendar-25853OR_0021_Layer-37.png?v=1616486693"]},
{"productYear": "2013", "title": "Patek Philippe Nautilus 5711A 'White'", "productPrice": null, "productDescription": ["I guess I have to begin by saying what everyone already knows: The Nautilus has to be the most popular watch of the last five years. At the centre of the hype is the watch you see here today- the time-only Patek Philippe Nautilus 5711.", "First released in the 1970s the Nautilus, designed by none other than Gerald Genta himself, was a crazy, avant-garde sports watch in stainless steel that sold for an eye-watering price. While the Royal Oak was designed in this same sense, Audemars Piguet was largely seen as the bad boys of the industry and when Patek Philippe followed suit, clients and critics alike who were used to seeing elegant dress watches were shocked to see that they followed in the footsteps AP. This was further reinforced by the fact that both were designed by the same man! The reference 3700 ‘Jumbo’, the first Nautilus model ever made, of course as we know managed to defy the odds and today is one of the holy grails of vintage Patek Philippe. ", "Fast forward to 2006, and Patek Philippe releases the heir apparent to the 3700 ‘Jumbo’, the 5711. Featuring an ultra-slim 8.3mm case, it is so thin not only for a sport watch but in general, sliding easily under the cuff of a shirt. The dial, offered in blue and white came with the familiar ridged dial and integrated stainless steel bracelet. For a while, you could’ve bought these at the boutique at retail but in the last few years, it is practically close to impossible to buy any Nautilus, let alone this 5711. While on paper the 5711 sits as the cheapest Nautilus you can buy, it is the hardest one to get as this is the reference collectors want the most. ", "Everybody knows that the 5711 fitted with the blue dial is the most popular, but I do believe that the white dialled version is a sleeper. Discontinued one year before the blue 5711 in 2020, it is less common to see a white dial and the polar white colour really pops and adds a huge contrast to the watch that you won’t get with the blue. As with all Nautilus’, it comes with its beautifully finished case and bracelet, with polished bevelled edges contrasting with the brushed overall finish going from the case to every individual link.", "The Patek Philippe Nautilus is really the ultimate luxury sport watch, combining brutalist design elements with an elegant profile and sizing. It is just such a cool watch and with the 5711 in particular, it is as pure as it gets, remaining faithful to the original Genta designed 3700 ‘Jumbo’ from 40 years ago. ", "With the recent news that the 5711 has finally been discontinued altogether, this has only served to increase the demand for this already hard to get piece. Not only is this now an icon of horology but a discontinued one that will never be made again."], "productCr": "This Patek Philippe Nautilus 5711 is in mint condition. It comes as a full set with all of its accessories including its inner and outer box, certificate of origin, leather wallet, and manuals. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-White_0006_Layer-78.png?v=1621839654", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-White_0010_Layer-24.png?v=1621839656", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-White_0005_Layer-75.png?v=1621839657", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-White_0013_Layer-21.png?v=1621839659", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-White_0011_Layer-23.png?v=1621839660", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-White_0004_Layer-76.png?v=1621839662", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-White_0012_Layer-22.png?v=1621839664", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-White_0003_Layer-80.png?v=1621839665", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-White_0008_Layer-77.png?v=1621839666", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-White_0007_Layer-79.png?v=1621839668", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-White_0002_Layer-81.png?v=1621839669", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711A-White_0001_Layer-82.png?v=1621839671"]},
{"productYear": "2000s", "title": "Cartier Rotonde Jour Et Nuit CPCP", "productPrice": "$18,000.00", "productDescription": ["The name Cartier needs no introduction. As one of the most influential and celebrated jewelry and watch brands of the last 100 years, it has always stood as a mark of luxury and desirability. Without taking away from its historical significance, I would say that when it comes to watches, Cartier has always been predominantly known as a ‘design’ brand rather than a pure watchmaking one, with stunningly iconic models such as the Tank, the Crash, and the Santos all seen as important due to how it looks. In fact, to this day, it is the beautiful and unconventional designs that attract collectors and a unique position in the watch brand hierarchy that no other possesses. ", "As I have mentioned many times, the ’90s was an unconventional and murky time for watch brands, having just come out of the quartz crisis that decimated most of the industry. Brands were either experimenting like crazy or strictly conservative, wary of the fact they just survived the equivalent of a nuclear bomb. The industry was slowly coming back, with consumers beginning to take an interest in mechanical watches, and with this in mind, Cartier decided that it was time to improve its image as a true watchmaking brand. ", "The result was the Collection Privé Cartier Paris division, referred to simply as the CPCP. The intention of the CPCP was to be the premier mechanical watchmaking division of Cartier and looking back on it today, it was one of the best decisions they ever made. The philosophy was simple, the CPCP took iconic models that were already loved by many, and reproduced them with high-grade movements, working with bonafide watch manufactures such as Piaget, Jaeger-LeCoultre, Frédéric Piguet, Girard-Perregaux and more. ", "The easiest way to differentiate a CPCP watch was by the dial, with all but one model (Tank Cintrée) featuring a ‘Cartier Paris’ inscription- an ode to its heritage. The dials were always crafted from solid gold and often featured a strong hand-turned guilloche pattern with Cartier’s signature ‘rosette’ in the middle of the dial beneath the handset. ", "The easiest way to describe in words how the watch works is to separate the top and bottom half of the dial, with the bottom displaying the minutes, and the top displaying the hours. A single, retrograde hand at the bottom displays the minutes, bouncing from the left of the dial back to the right after every 60 minutes, while the top of the dial displays the hours via a rotating disc. In the day time, a sun motif rotates, with the beam that touches the outer track displaying the hours, while in the night time, a moon appears on the wheel, effectively making this a 24-hour indicator and hence the name ‘Jour Et Nuit’, or ‘Day and Night’ in English. ", "The CPCP collection ran for 10 years between 1998 and 2008 and I can confidently say it is one of the most significant periods in Cartier’s history. It’s beautiful to see that Cartier was doing ‘reissues’ before it was even a thing and doing it the right way- respecting the past while producing something that is modern. Not only this but the CPCP models were produced in truly limited numbers, with many having a designated run of 50 to 100 pieces. For those in the Collection Privé that weren’t strictly ‘limited’, it is estimated that only 250-300 pieces were made for each reference making any CPCP watch out there truly special. ", "Collectors are finally taking notice of this, and Cartier in general as a brand worth collecting. With more knowledge available now, the demand for Cartier has been huge and I only see it getting larger, especially for important references such as those from the CPCP line. "], "productCr": "This Cartier Rotonde Jour et Nuit CPCP is in excellent condition. It is unpolished and only has very minor hairlines from previous use. It comes as a watch only and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Rotonde-Jour-Et-Nuit-CPCP_0001_Layer-32.png?v=1619765112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Rotonde-Jour-et-Nuit-CPCP_0028_Layer-30.png?v=1619765112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Rotonde-Jour-et-Nuit-CPCP_0027_Layer-35.png?v=1619765112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Rotonde-Jour-Et-Nuit-CPCP_0007_Layer-34.png?v=1619765112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Rotonde-Jour-et-Nuit-CPCP_0029_Layer-29.png?v=1619765112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Rotonde-Jour-et-Nuit-CPCP_0026_Layer-34.png?v=1619765112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Rotonde-Jour-Et-Nuit-CPCP_0006_Layer-35.png?v=1619765112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Rotonde-Jour-et-Nuit-CPCP_0031_Layer-28.png?v=1619765112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Rotonde-Jour-Et-Nuit-CPCP_0004_Layer-37.png?v=1619765112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Rotonde-Jour-Et-Nuit-CPCP_0002_Layer-33.png?v=1619765112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Rotonde-Jour-Et-Nuit-CPCP_0003_Layer-38.png?v=1619765112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Rotonde-Jour-Et-Nuit-CPCP_0005_Layer-36.png?v=1619765112", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Rotonde-Jour-et-Nuit-CPCP_0030_Layer-37.png?v=1619765112"]},
{"productYear": "1990s", "title": "IWC Ceramic Fliegerchronograph 3705", "productPrice": "$26,000.00", "productDescription": ["Released in 1994, the IWC Ceramic Fliegerchronograph Ref. 3705 is an excellent example of '90s watchmaking and the emergence of modern watchmaking after the industry arose from the disastrous Quartz Crisis. A rare timepiece pushing the boundaries in more ways than one, the ref. 3705 features modern technology and a distinctive aesthetic that pair together to create a unique timepiece that deserves its adoration and plaudits from collectors of this exquisite watch. Without a doubt, this IWC can be considered a historically important watch with a cult-like following. ", "Only produced from 1994 to 1996 (retailed until 1998 due to its expensive price tag), it is believed that only 1000-2000 ref. 3705s were produced, which aides its position as a cult classic. While not the first IWC timepiece made of ceramic, it is the brand's first Pilot's Watch model made of the material. Constructed from pure zirconium oxide powder pressed into a mold under extreme temperature and pressure, the resultant ref. 3705 case is incredibly scratch-resistant, light, hypoallergenic, and remarkable shatter-resistant – the perfect watch case material by most measures. It is important to remember that while ceramic cases are fairly popular today, back then, the usual route for an all-black watch would be to use an extremely low-quality and scratch-prone PVD-coating method.", "An excellent piece of material technology for the mid-'90s, the ref. 3705's black ceramic case is further improved by its wonderfully wearable 39mm diameter and stainless steel crowns and pushers, which help to provide visual intrigue and break up the black aesthetic with their silver hues. Within its case, the ref. 3705 houses a black dial with gorgeously aged yellow tritium markers at 3, 6, 9, and 12 and white accents throughout."], "productCr": "This IWC Ref. 3705 is in excellent condition. It comes with its original guarantee card and two further service guarantee cards. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Fliegerchronograph-3705-_0013_Layer-123.png?v=1621840056", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Ceramic-Fliegerchronograph-Ref.-3705_0023_Layer-6.png?v=1621840056", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Ceramic-Fliegerchronograph-Ref.-3705_0019_Layer-14.png?v=1621840056", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Fliegerchronograph-3705-_0009_Layer-127.png?v=1621840056", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Ceramic-Fliegerchronograph-Ref.-3705_0024_Layer-3.png?v=1621840056", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Ceramic-Fliegerchronograph-Ref.-3705_0020_Layer-13.png?v=1621840056", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Fliegerchronograph-3705-_0008_Layer-129.png?v=1621840056", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Ceramic-Fliegerchronograph-Ref.-3705_0022_Layer-8.png?v=1621840056", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Ceramic-Fliegerchronograph-Ref.-3705_0021_Layer-11.png?v=1621840056", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Fliegerchronograph-3705-_0014_Layer-124.png?v=1621840056", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Fliegerchronograph-3705-_0012_Layer-125.png?v=1621840056", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Fliegerchronograph-3705-_0011_Layer-126.png?v=1621840056", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC-Fliegerchronograph-3705-_0010_Layer-128.png?v=1621840056"]},
{"productYear": "1990s", "title": "Cartier Tank Basculante 2390 Mecanique", "productPrice": null, "productDescription": ["An incredibly iconic timepiece, the Cartier Tank is one of the most easily recognizable timepieces that is produced today. With its signature rectangle-shaped case, thin profile, and elegant dial, it is as classical a timepiece today as when it was released in 1917. Inspired by the Renault FT-17 Tank, the Cartier Tank is, somewhat paradoxically, a dress watch. Remarkably over the century, the Tank model has been reborn into many variants, all with different forms while still managing to maintain its DNA.", "Debuting in 1933, the Tank Basculante took inspiration from the Jaeger-LeCoultre Reverso, a double-sided sports timepiece that would swivel within its case to protect its dial. In keeping with this design, the Basculante also turned in its case to protect its dial. However, different from the Reverso, rather than turning on its horizontal axis, the Basculante turned over its vertical axis, allowing it to stand upright in mid-rotation to double as a table clock. All of this was done elegantly via the central jewel of the watch, where the user would flick it open with his/her nail.", "With a desire to release a model that spoke to the original Tank Basculante's heritage, Cartier released the ref. 2390 in the early 1990s with some modern touch-ups and other period-correct details. A stunning piece of horology, the Tank Basculante has developed its own cult following thanks to its quirky design and unique position within the Tank collection.", "Featuring a 26 x 38mm stainless steel rectangular case, the ref. 2390 is slim on the wrist thanks to its 26mm width and integrated crown at 12 o'clock, but it carries a satisfactory presence on the wrist due to its lug-to-lug measurement. Aiding that wrist presence is the ref. 2390's stunning silver dial, adorned with guilloche engravings, black roman numerals, and blued steel hands – all signature design elements for the iconic French jeweler.", "While there have been many iterations of the Basculante since the ’90s, the Ref. 2390 has always stood out as the reference to collect due to its high-quality mechanical movement. Many Basculantes were quartz-powered as they were mostly produced towards the tail-end of the Quartz Crisis. ", "Powered by the 2mm thick Piguet-derived Cartier cal. 050 MC, the ref. 2390 is manually wound, just like its ancestor, and comes in with a staggeringly thin 5.8mm case profile as a result. A delight to wear, filled with genuine heritage and intrigue, the Tank Basculante ref. 2390 is well-deserving of the adoration it has received in recent years."], "productCr": "This Cartier Tank Basculante is in excellent condition. There are minor hairlines from previous use that are visible in the photography. This watch comes with its original black alligator strap and Cartier tang buckle. It is in full working order and comes as a watch only.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0021_Layer-83.png?v=1621840949", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0009_Layer-48.png?v=1621840950", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0006_Layer-38.png?v=1621840952", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0023_Layer-85.png?v=1621840955", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0022_Layer-84.png?v=1621840953", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0003_Layer-45.png?v=1621840957", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0007_Layer-35.png?v=1621840958", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0005_Layer-41.png?v=1621840960", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0016_Layer-90.png?v=1621840961", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0015_Layer-91.png?v=1621840963", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0002_Layer-49.png?v=1621840964", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0004_Layer-43.png?v=1621840966", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0020_Layer-86.png?v=1621840967", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0019_Layer-87.png?v=1621840968", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0018_Layer-88.png?v=1621840970", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0017_Layer-89.png?v=1621840971", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0008_Layer-34.png?v=1621840972", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Cartier-Tank-Basculante-2390-Steel_0001_Layer-46.png?v=1621840974"]},
{"productYear": "2008", "title": "Jaeger-LeCoultre Memovox Tribute to Polaris 'Pumpkin'", "productPrice": "$15,000.00", "productDescription": ["Famed as the watchmaker's watchmaker, Jaeger-LeCoultre have been known to joust with horological heavyweights in the past, but one of their most iconic collections is derived from a battle with a lesser-known brand, Vulcain. After Vulcain released the Cricket, the world's first successful alarm watch, Jaeger-LeCoultre responded with the Memovox. As the battle tore on, the brand developed a dive watch version of the Memovox in 1959, the Deep Sea Alarm, making it the first alarm dive watch ever made. This model then inspired JLC to release the Memovox Polaris in 1968. Featuring the same twin-crown system for winding and setting the alarm and time as the Deep Sea Alarm but with a chunkier case with improved visibility and usability, the Polaris went on to become an iconic dive watch with a practical function that was executed well thanks to its triple-layered ESPA compressor case.", " ", "In 2008, Jaeger-LeCoultre decided to pay tribute to the very first Polaris with the aptly named \"Memovox Tribute to Polaris\" by releasing a 768 piece limited-edition, historically accurate interpretation of that now-iconic timepiece. Featuring a modern interpretation of the 42mm stainless steel case used on the original, the Tribute version features no bezel, three crowns, and a heavily domed thick acrylic crystal that all combine to feed the vintage-inspired aesthetic and feel of this timepiece.", " ", "Included with its historically accurate construction, the Tribute also features a period-correct movement, the JLC cal. 956. The crown at 2 o'clock operates to wind and adjust the alarm, the crown at 3 o'clock operates the inner rotating bezel, while the crown at 4 o'clock is used to set the time and allow for manual winding of the movement. With the perforated case back hiding the movement beneath, the Tribute receives 200m of water resistance, another point of historical accuracy.", " ", "Finally, we have the Tribute's stunning matte black dial featuring large triangular hour indices with Arabic numerals found at 12, 6, and 9 and a date aperture at 3 o’clock. What makes this particular example very special is that of the 768 piece limited run, the very early examples had very orange ‘pumpkin’ lumes. Interestingly, according to the original owner, these examples were recalled by the brand to be changed to the more subtle creamy yellow you usually see for this reference but as demonstrated by this Polaris example, the previous owner declined. It is not known how many ‘pumpkin’ Polaris’ are out there, but you certainly do not see many around. ", "Overall, a stunning example of what can be achieved when historical accuracy is prioritized, the Tribute is an effortlessly classical and functional timepiece thanks to its vintage-inspired aesthetic and position as a practical dive watch."], "productCr": "This Jaeger-LeCoultre Memovox Tribute to Polaris is in excellent used condition. There are minor hairlines throughout but no deep nicks or dings. It comes as a full set with its box and papers and is in full working order. The alarm is fully functional.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Tribute-to-Polaris_0006_Layer-56.png?v=1620645854", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Tribute-to-Polaris_0009_Layer-13.png?v=1620645854", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Tribute-to-Polaris_0011_Layer-10.png?v=1620645854", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Tribute-to-Polaris_0003_Layer-60.png?v=1620645854", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Tribute-to-Polaris_0013_Layer-6.png?v=1620645854", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Tribute-to-Polaris_0008_Layer-14.png?v=1620645854", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Tribute-to-Polaris_0010_Layer-11.png?v=1620645854", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Tribute-to-Polaris_0002_Layer-61.png?v=1620645854", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Tribute-to-Polaris_0007_Layer-16.png?v=1620645854", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Tribute-to-Polaris_0001_Layer-62.png?v=1620645854", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Tribute-to-Polaris_0004_Layer-59.png?v=1620645854", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Tribute-to-Polaris_0007_Layer-57.png?v=1620645854", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Tribute-to-Polaris_0012_Layer-9.png?v=1620645839", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Tribute-to-Polaris_0005_Layer-58.png?v=1620645839"]},
{"productYear": "2020", "title": "F.P. Journe Elegante 40", "productPrice": null, "productDescription": ["Regarded as one of the hottest horological prospects in the world right now, it is immensely impressive that F.P. Journe has only been around for the length of time that it has. Founded in 1999, F.P. Journe burst onto the watchmaking scene with a 20 piece limited run of Tourbillon Souverain Souscription watches that cash-strapped Francois Paul used to finance his brand, just like Abraham Louis Breguet did over 200 years ago. 20 odd years later, however, the F.P. Journe brand has become a horological powerhouse with waiting lists growing ever-longer and auction results growing ever more impressive."], "productCr": "This F.P. Journe Elegante 40 is in good condition. There are minor hairlines throughout from previous use and minor marks on the clasp. It comes as a full set and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Elegante-40-Titanium_0013_Layer-92.png?v=1621844939", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Elegante-40-_0017_Layer-36.png?v=1621844943", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Elegante-40-_0012_Layer-44.png?v=1621844947", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Elegante-40-_0014_Layer-40.png?v=1621844951", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Elegante-40-_0010_Layer-50.png?v=1621844954", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Elegante-40-_0015_Layer-39.png?v=1621844957", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Elegante-40-Titanium_0009_Layer-96.png?v=1621844960", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Elegante-40-Titanium_0008_Layer-98.png?v=1621844963", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Elegante-40-_0016_Layer-37.png?v=1621844967", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Elegante-40-Titanium_0014_Layer-93.png?v=1621844970", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Elegante-40-Titanium_0012_Layer-94.png?v=1621844973", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Elegante-40-_0013_Layer-42.png?v=1621844976", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Elegante-40-Titanium_0011_Layer-95.png?v=1621844978", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Elegante-40-Titanium_0010_Layer-97.png?v=1621844981", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Elegante-40-Titanium_0002_Layer-106.png?v=1621844984", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Elegante-40-_0011_Layer-47.png?v=1621844987"]},
{"productYear": "2014", "title": "Jaeger-LeCoultre Geophysic 1958", "productPrice": "$8,200.00", "productDescription": ["The Jaeger-LeCoultre Geophysic was first released in 1958 and it had one goal in mind- to be as durable and precise as a wristwatch can be. Made for extreme conditions and exploration, it was produced both as a celebration of Jaeger-LeCoultre’s 125th anniversary and also the world’s first International Geophysical Year. This was a global effort by 67 countries to encourage scientific progress in exploration and experimentation relating to geophyiscs. The result was the Geophysic Chronometer Ref. E 168 and it was a highly precise watch powered by one of the greatest movements ever conceived,", "the in-house caliber P 478 BWSBr. It was a chronometer grade movement that featured anti-magnetic properties, Kif shock resistance, a Glucydur balance spring to keep it protected from temperature change and the now famous swan-neck regulator. As this was a super specialised watch, just over a thousand examples were produced and today the E 168 is considered one of the rarest and most desirable vintage watches in the world. "], "productCr": "This Jaeger-LeCoultre Geophysic 1958 comes as a full set with its inner and outer box, loupe, hang tag, dated guarantee certificate, operating instructions and timepiece registration card. It is in good condition with minor hairlines throughout. It comes with its original strap and buckle. The strap is in used condition. This watch is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-3_0013_Layer-1.png?v=1619764045", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-3_0045_Layer-13.png?v=1619764047", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-3_0042_Layer-19.png?v=1619764049", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-3_0010_Layer-3.png?v=1619764051", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-3_0044_Layer-15.png?v=1619764052", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-3_0043_Layer-17.png?v=1619764057", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-3_0009_Layer-5.png?v=1619764059", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-3_0008_Layer-6.png?v=1619764061", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-3_0007_Layer-7.png?v=1619764063", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-3_0012_Layer-2.png?v=1619764067", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Geophysic-1958-3_0011_Layer-4.png?v=1619764071"]},
{"productYear": "2018", "title": "Lang & Heyne Friedrich III Steel", "productPrice": null, "productDescription": ["straightforward thinking of Freidrich III when, in 1349, he took over the regions of ", "Thuringia and Meissen from his father. He would then go on to improve Wettin’s (later ", "Saxony, Germany) political reach and wealth by developing public administration ", "systems and internal policies. Taking this approach and putting it into the Friedrich III, it ", "is a classically themed timepiece that is bursting with traditional aesthetics that speak ", "to the timepiece’s inspiration.", "modern dress watch. With its entirely polished circular 39.2mm case, the Freidrich III is ", "understated, discreet, and elegant. Featuring a stunning frosted silver dial with ", "elongated black roman numerals, the Freidrich III is as classy as it gets. With a sub-", "seconds dial at 6 o’clock and rose gold cathedral hands, the Freidrich III’s aesthetic is ", "one of utmost craftsmanship and traditional design. Featuring Lang & Heyne’s signature ", "triple lug case design, the Freidrich III remains easily recognizable for those in the know ", "while escaping the brashness of some other brands."], "productCr": "This Lang & Heyne Friedrich III is in mint condition. It comes as a full set with its box and papers and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Lang-_-Heyne-Friedrich-III-Stainless-Steel_0001_Layer-39.png?v=1619763778", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Lang-_-Heyne-Friedrich-III-Stainless-Steel_0040_Layer-16.png?v=1619763778", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Lang-_-Heyne-Friedrich-III-Steel_0002_Layer-68.png?v=1619763778", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Lang-_-Heyne-Friedrich-III-Stainless-Steel_0005_Layer-44.png?v=1619763778", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Lang-_-Heyne-Friedrich-III-Stainless-Steel_0039_Layer-18.png?v=1619763778", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Lang-_-Heyne-Friedrich-III-Stainless-Steel_0038_Layer-20.png?v=1619763778", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Lang-_-Heyne-Friedrich-III-Steel_0003_Layer-67.png?v=1619763778", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Lang-_-Heyne-Friedrich-III-Stainless-Steel_0008_Layer-41.png?v=1619763778", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Lang-_-Heyne-Friedrich-III-Stainless-Steel_0002_Layer-40.png?v=1619763778", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Lang-_-Heyne-Friedrich-III-Stainless-Steel_0003_Layer-46.png?v=1619763778", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Lang-_-Heyne-Friedrich-III-Stainless-Steel_0004_Layer-45.png?v=1619763778", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Lang-_-Heyne-Friedrich-III-Stainless-Steel_0006_Layer-43.png?v=1619763778", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Lang-_-Heyne-Friedrich-III-Steel_0001_Layer-69.png?v=1619763778", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Lang-_-Heyne-Friedrich-III-Stainless-Steel_0041_Layer-14.png?v=1619763778", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Lang-_-Heyne-Friedrich-III-Stainless-Steel_0007_Layer-42.png?v=1619763773"]},
{"productYear": "2020", "title": "Ming 18.01 H41 Diver DLC", "productPrice": null, "productDescription": ["One of the most exciting entrants to the independent watchmaking space, Ming has surely grown far beyond their wildest dreams. With just three years of watchmaking under their belt, they have become one of the most sought-after brands out there, with their limited drops often sold out in minutes. A brand owned by a group of enthusiasts, they have their fingers on the pulse of their collecting community and often gives their customers what they want. Case and point is the Ming 18.01 H41 DLC, the second generation diver that follows the 18.01 Abyss Concept Prototype that was released in 2018.", "There were two variations of the 18.01 released, a two-tone version featuring a titanium case and a black steel bezel, and the example you see here- the DLC coated all-black version. While the former had 250 examples produced, the DLC version is much rarer, with only 50 pieces made.", "Fitted with a black two-level sapphire dial with ceramic HyCeram Super-LumiNova XI infused to the sapphire, the 18.01 H41 continues with Ming’s traditionally complex dial design and strong incorporation of lume. Topped off with additional lume on the bezel and hands, and what you get when this watch is fully charged is a stunningly bright and legible dive watch that might just keep you awake at night. ", "Powered by an automatic ETA 2824-2 movement that has been modified by Ming’s long-time partners, Schwarz Etienne, the 18.01 H41 comes adjusted to five positions across a 250-hour test program. Unapologetically Ming in its design, the 18.01 H41 exists as the brand’s most robust and distinctive watch within their whole arsenal, leaving it to no surprise why this watch is as sought-after as it is."], "productCr": "This Ming 18.01 H41 is in mint condition. It comes as a full set and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-18.01-H41-Diver-DLC_0005_Layer-61.png?v=1619763100", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-H41-18.01-Diver-DLC_0049_Layer-9.png?v=1619763107", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-H41-18.01-Diver-DLC_0046_Layer-12.png?v=1619763110", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-H41-18.01-Diver-DLC_0050_Layer-8.png?v=1619763111", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-18.01-H41-Diver-DLC_0004_Layer-63.png?v=1619763113", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-18.01-H41-Diver-DLC_0003_Layer-64.png?v=1619763115", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-H41-18.01-Diver-DLC_0047_Layer-11.png?v=1619763117", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-18.01-H41-Diver-DLC_0001_Layer-66.png?v=1619763118", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-18.01-H41-Diver-DLC_0002_Layer-65.png?v=1619763121", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-18.01-H41-Diver-DLC_0006_Layer-62.png?v=1619763122", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ming-H41-18.01-Diver-DLC_0048_Layer-10.png?v=1619763126"]},
{"productYear": "2014", "title": "Rolex Day Date 118138", "productPrice": "$21,000.00", "productDescription": ["Legendary in its status, the Rolex Day-Date has long been the Genevan giant’s flagship timepiece. Released all the way back in 1956, the Day-Date quickly rose as the timepiece for world leaders, earning it the nickname ‘the President’ thanks to it being worn by so many Heads of State.", "Today, the Day-Date has retained its standing of luxury and exclusivity within the watch market and exists as the ultimate watch of prestige. As an important asset for Rolex to protect, the Day-Date has experienced many variations over the course of its history, but today I would like to discuss the ref. 118138 Cognac dial that I have here. ", "Released at Baselworld in 2013, the ref 118138 was amongst several new references of the Day-Date. Each blending fresh dial options with classic metals such as white gold rose gold, and yellow gold, these references stayed true to the Day-Date’s original size of 36mm, emphasizing the importance of classic aesthetics. ", "In a time where watchmakers seem to think enlarging a watch is improving, it was a welcome change of pace by Rolex given they had increased the Day-Date to 41mm a few years prior. Remaining true to its classical and timeless design, the ref. 118138 is a stunning piece that breaks from the move towards larger timepieces.", "The ref. 118138 I have here combines a gorgeous sunburst cognac-color dial with the most traditional Day-Date metal of all, 18kt yellow gold. With this reference being offered with a strap only instead of the traditional bracelet, it becomes a lot more wearable and casual, retaining the prestige of the iconic Day-Date without the added attention."], "productCr": "This Rolex Day Date 118138 is in mint condition. It comes as a full set with its box, warranty card and manual. It has been recently serviced and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-118138-YG-Brown_0019_Layer-94.png?v=1614327078", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-Yellow-Gold-118138-Brown-_0031_Layer-35.png?v=1614327078", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-Yellow-Gold-118138-Brown-_0034_Layer-26.png?v=1614327078", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-118138-YG-Brown_0017_Layer-97.png?v=1614327078", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-118138-YG-Brown_0016_Layer-98.png?v=1614327078", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-118138-YG-Brown_0020_Layer-95.png?v=1614327078", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-Yellow-Gold-118138-Brown-_0030_Layer-36.png?v=1614327078", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-Yellow-Gold-118138-Brown-_0033_Layer-29.png?v=1614327078", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-118138-YG-Brown_0014_Layer-93.png?v=1614327077", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-118138-YG-Brown_0015_Layer-92.png?v=1614327077", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-118138-YG-Brown_0018_Layer-96.png?v=1614327077", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-Yellow-Gold-118138-Brown-_0032_Layer-31.png?v=1614327076", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Day-Date-Yellow-Gold-118138-Brown-_0035_Layer-33.png?v=1614327010"]},
{"productYear": null, "title": null, "productPrice": null, "productDescription": [], "productCr": null, "images": []},
{"productYear": "2017", "title": "F.P. Journe Centigraphe Souverain", "productPrice": "$102,500.00", "productDescription": ["Where to begin with F.P. Journe. Started by the man himself in 1999, Journe had previously spent quite a few years restoring and producing movements and also made a couple of pocket watches during that time. It took quite a few years before his brand went from something only a hardcore collector could appreciate to being appreciated by a more mainstream audience and today, he is considered by many as one of the most successful and important independent brands to have emerged.", "In my opinion, F.P. Journe has hit the sweet spot, producing around 900 pieces a year only. This ensures that they are exclusive enough that people consider any Journe a rare piece, but not so rare that it becomes esoteric. There are brands like Roger Smith and Philippe Dufour, both of who are considered godfathers of high horology, but they make so few pieces a year that the average watch collector would not know about them. Mention F.P. Journe though, and you’ll have collectors jumping with joy. ", "What you see here today is one of Journe’s most iconic models- the Centigraphe. Designed to time 1/100th of a second, you can already imagine how complicated this is going to get. There are pushers on the top right-hand side of the case to activate the chronograph, prompting the 10 o’clock sub-dial to start running. Watching this is something very special as you see the foudroyant (flying seconds) run and when you stop the chronograph it can stop anywhere on the sub-dial, allowing the user to record exactly to 1/100th of a second. The other two sub-dials act as a 20 second and 10 minute counter.", "Housed in a 40mm platinum case, there is definitely a nice heft to the watch. I think one of the main reasons why collectors love Journe is because of his signature case. It sits so thin and flat on the wrist and finishes off with lugs that step down and hugs your wrist. Once you strap it on, you’ll understand.", "F.P. Journe has carved a very interesting niche in the independent watch world where he has managed to blend traditional watchmaking and design cues with modern technology and an unmistakably Journe aesthetic. Despite using very traditional elements like his serif’d Arabic numerals, a knurled winding crown and a standard round case, the way it has been laid out combines to create a look that is F.P. Journe through and through. ", "The purists really love Journe because of his motto ‘Invenit et Fecit’, which translates from Latin to Invent and Create. To this day, F.P. Journe has stuck to this mantra, where he continues to invent his own in-house movements. Furthermore, everything else is also in-house, even to the point of owning his own case-maker and dial-maker. For a small brand that makes less than 1000 pieces a year, it is really impressive.", "Now, of course, timing to 1/100th of a second is not something we need in our lives, but just like art, it is the complexity and the ingenuity that we appreciate. After all, isn’t the wristwatch in itself an archaic tool? So why not, just go all out? It is for that reason, I think that the Centigraphe is one of the greatest watches that has come out of this century."], "productCr": "This F.P. Journe Centigraphe Souverain is in mint condition. It is in full working order and comes as a full set with its inner and outer box and warranty card. The chronograph is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-3_0007_Layer-81.png?v=1622591153", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-3_0046_Layer-23.png?v=1622591155", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-3_0045_Layer-28.png?v=1622591157", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-3_0044_Layer-29.png?v=1622591159", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-3_0008_Layer-82.png?v=1622591161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-3_0049_Layer-16.png?v=1622591162", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-3_0002_Layer-87.png?v=1622591164", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-3_0003_Layer-86.png?v=1622591165", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-3_0001_Layer-88.png?v=1622591167", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-3_0048_Layer-22.png?v=1622591168", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-3_0006_Layer-83.png?v=1622591170", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-3_0005_Layer-84.png?v=1622591171", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-3_0047_Layer-26.png?v=1622591173", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Centigraphe-Souverain-PT-3_0004_Layer-85.png?v=1622591174"]},
{"productYear": "2014", "title": "Jaeger-LeCoultre Master 8 Days Perpetual Calendar", "productPrice": "$20,000.00", "productDescription": ["Famed as the watchmaker’s watchmaker, Jaeger LeCoultre is perhaps one of the most prestigious brands in the industry. With over 1200 calibers to their name and with a long history of creating movements for brands such as Patek Philippe, Audemars Piguet, and many others, watchmaking skill is something they have in abundance. Not afraid of flexing their horological muscles, the JLC Master 8 Days Perpetual Calendar is one of the purest expressions of their ability to create incredible watches that feature movements that are simply out of this world. ", "Before we get into its movement, I would like to begin with this timepiece’s design. From an aesthetic point of view, the Master 8 Days Perpetual Calendar’s design seems rather quaint thanks to JLC’s less is more philosophy. With its round 40mm x 12.8mm polished 18kt rose gold case, smooth bezel, and strong lugs, the Master 8 Days certainly portrays itself as quite a regal timepiece, that refrains from the pageantry involved with loud brash designs and allows for great wearability.", "Providing a glimpse into the wonderfully complicated movement beneath, the Master 8 Days features a stunning ivory-coloured dial adorned with case-matching 18kt rose gold dial furniture and applied hour markers. Hinting at the complexity of the cal. 876-440b beneath, the Master 8 Days’ dial houses a power reserve indicator, an AM/PM indicator, the day, date, month, and moon phase while also displaying the full four-digit year between 7 and 8 o’clock. ", "As we expect from a brand of JLC’s prestige, the manual-wind 4Hz cal. 876-440b movement is hand-finished to JLC’s exacting standards. Decorated with JLC’s patented “côtes soleillées” and “perlage” throughout, the exhibition caseback at the rear of the Master 8 Days provides a treat for the senses as the movement beats away. While the cal. 876-440b is rated to 8 Days, JLC is really under-promising and over-delivering as the movement gives about 9 to 10 days of power reserve, but will begin to wane in terms of accuracy, with the advertised 8-day window offering peak performance. ", "An excellent exhibition of JLC’s watchmaking prowess, the Master 8 Days is an incredible timepiece with a high-horology complication offered from a top-tier brand that sacrifices nothing, making it a wonderful addition to any collection it finds itself within."], "productCr": "This Jaeger-LeCoultre Master 8 Days Perpetual Calendar is in mint condition. It comes as a watch only, with its calendar pusher and a leather JLC travel box.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-8-Days-Perpetual-Calendar_0060_Layer-87.png?v=1618385314", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Perpetual-Calendar-8-Days_0020_Layer-27.png?v=1618385314", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Eight-Days-Perpetual-Calendar_0051_Layer-89.png?v=1618385314", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Perpetual-Calendar-8-Days_0026_Layer-17.png?v=1618385314", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Perpetual-Calendar-8-Days_0025_Layer-18.png?v=1618385314", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Perpetual-Calendar-8-Days_0023_Layer-23.png?v=1618385314", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Eight-Days-Perpetual-Calendar_0049_Layer-91.png?v=1618385314", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Perpetual-Calendar-8-Days_0024_Layer-22.png?v=1618385314", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Eight-Days-Perpetual-Calendar_0046_Layer-88.png?v=1618385314", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Eight-Days-Perpetual-Calendar_0047_Layer-93.png?v=1618385314", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Eight-Days-Perpetual-Calendar_0048_Layer-92.png?v=1618385314", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Master-Eight-Days-Perpetual-Calendar_0050_Layer-90.png?v=1618385314", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Jaeger-LeCoultre-Perpetual-Calendar-8-Days_0021_Layer-26.png?v=1618385314"]},
{"productYear": "2020", "title": "Mont Blanc Minerva Heritage Small Second Limited 38", "productPrice": "$14,500.00", "productDescription": ["Released early in 2020, the Montblanc Heritage Small Second is a very special and rare watch, limited to just 38 pieces. Powered by a historically significant pre-Richemont Minerva movement, the watch is limited to only 38 pieces as that was all the movements Montblanc found in the Minvera archives. While known for their fountain pens and leather goods, Montblanc has been stepping up their horological offering in recent years and the Heritage Small Second is emblematic of that.", "Founded in 1868 and absorbed into Montblanc following Richemont’s acquisition of the movement maker in 2006, Minerva was historically known for their premier in-house chronographs and stopwatch movements. Mind you, the big houses such as Patek Philippe and Audemars Piguet didn’t even have their own in-house chronograph movements at the time- a testament to the pedigree of Minerva.", "What you see here today is not only one of the finest watches to come out of Mont Blanc, but one of the best finished time-only pieces in the industry. With a gorgeous salmon-colored lacquered dial, there are amazing textures going on with a grain-finished hour ring that disrupts the underlying sunburst finish. There is a small mark in between 3 and 4 o’clock that states ‘Minerva’, reminding you that this isn’t your ordinary Mont Blanc.", "With lightly-painted Super-LumiNova on its applied numerals, the 38 Heritage Small Seconds combines the functional aspects we have come to appreciate in modern horology with the classic sizing of a dress watch, coming in at 39mm in diameter and just 9.5mm thick.", "While Montblanc today does create some more commercially available timepieces, their Minerva-based Villeret-made timepieces are known for impeccable finishing and hand-assembly and cannot be considered to be under the same umbrella. This is truly a great watch. "], "productCr": "This Mont Blanc Heritage Small Seconds Limited Edition is in excellent condition. It comes as a full set with its box and papers and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Heritage-Small-Seconds-Limited-Salmon_0023_Layer-8.png?v=1607676138", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Small-Seconds-Heritage-Limited-Salmon_0032_Layer-98.png?v=1607676140", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Small-Seconds-Heritage-Limited-Salmon_0030_Layer-100.png?v=1607676141", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Heritage-Small-Seconds-Limited-Salmon_0022_Layer-10.png?v=1607676143", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Small-Seconds-Heritage-Limited-Salmon_0038_Layer-92.png?v=1607676145", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Heritage-Small-Seconds-Limited-Salmon_0021_Layer-11.png?v=1607676146", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Small-Seconds-Heritage-Limited-Salmon_0034_Layer-96.png?v=1607676148", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Small-Seconds-Heritage-Limited-Salmon_0019_Layer-13.png?v=1607676152", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Heritage-Small-Seconds-Limited-Salmon_0017_Layer-15.png?v=1607676150", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Small-Seconds-Heritage-Limited-Salmon_0029_Layer-101.png?v=1607676159", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Heritage-Small-Seconds-Limited-Salmon_0024_Layer-9.png?v=1607676155", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Heritage-Small-Seconds-Limited-Salmon_0018_Layer-14.png?v=1607676154", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Heritage-Small-Seconds-Limited-Salmon_0020_Layer-12.png?v=1607676157", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Small-Seconds-Heritage-Limited-Salmon_0031_Layer-99.png?v=1607676161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Small-Seconds-Heritage-Limited-Salmon_0033_Layer-97.png?v=1607676163", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Small-Seconds-Heritage-Limited-Salmon_0035_Layer-95.png?v=1607676165", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Small-Seconds-Heritage-Limited-Salmon_0036_Layer-94.png?v=1607676166", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Mont-Blanc-Small-Seconds-Heritage-Limited-Salmon_0037_Layer-93.png?v=1607676168"]},
{"productYear": "2017", "title": "Ochs Und Junior Annual Calendar Rust", "productPrice": "$11,000.00", "productDescription": ["While most watch companies are rated by how complicated and intricate their timepieces are, the folks over at independent brand Ochs und Junior strive in the other direction- simplicity. Truly and avant-garde brands, they have over the years garnered a loyal following for their unique approach to watchmaking. ", "Beginning with their philosophy, it was their goal to create pieces with only essential parts, meaning the fewer components the better. Strange to think that most watches use the number of parts as a selling point whereas here is a brand striving for the opposite. Furthermore, customization was a big part of how Ludwig Oechslin wanted to run his brand and as a result, you can create and request all kinds of dial design and case material. ", "The example you see here today is a result of this and one that perfectly encapsulates the philosophy of Ochs und Junior. This is an Annual Calendar model housed in a sterling silver 925 case and rust treated dial. That’s quite a lot to digest but let's start with the mechanics- an annual calendar is considered a high-end complication that takes into account 30 and 31 days of the month, needing only to be adjusted once a year in February. While Patek Philippe uses 154 parts to produce their annual calendar, Ochs und Junior only uses six individual parts using a gear system. This is incredibly forward-thinking and impressive and is in line with the less the better, improving reliability and servicing times. ", "Aesthetically the watch is super rugged, with a sterling silver case that has developed a beautiful patina. The rust dial was a custom order and has a beautiful texture to it contrasted with the cold silver steel hands and dots. Ochs und Junior watches do not come with papers and exist as a watch only, showing how extreme the brand is going with simplicity. ", "You either love or hate Ochs und Junior but you have to commend their forward thinking and beautifully unique complications and timepieces. "], "productCr": "This Ochs Und Junior is in mint condition. The sterling silver case has developed a patina, which was the intention of it, creating a rugged, distressed look. The rust dial was treated by Ochs Und Junior and is in mint condition. This watch is in full working order and comes with its original pouch. Ochs und Junior do not deliver papers with their watch.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ochs-und-Junior-Annual-Calendar-Rust-Front-Shot.jpg?v=1571383701", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ochs-Und-Junior-Rust-Dial-Annual-Calendar-Creative.jpg?v=1571383701", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ochs-Und-Junior-Rust-Dial-Annual-Calendar-Wrist-Shot.jpg?v=1571383701", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ochs-und-Junior-Annual-Calendar-Rust-AR-Shot.jpg?v=1571383701", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ochs-Und-Junior-Rust-Dial-Annual-Calendar-Creative-1.jpg?v=1571383701", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ochs-und-Junior-Annual-Calendar-Rust-AL-Shot.jpg?v=1571383701", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ochs-und-Junior-Annual-Calendar-Rust-Side-Shot.jpg?v=1571383701", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ochs-und-Junior-Annual-Calendar-Rust-Side-Shot-1.jpg?v=1571383701", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ochs-und-Junior-Annual-Calendar-Rust-Caseback-Shot.jpg?v=1571383701", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Ochs-und-Junior-Annual-Calendar-Rust-Buckle-Shot.jpg?v=1571383701"]},
{"productYear": "2019", "title": "F.P. Journe Tourbillon Souverain Regence Circulaire", "productPrice": null, "productDescription": ["Where to begin with F.P. Journe. Started by the man himself in 1999, Journe had previously spent quite a few years restoring and producing movements and also made a couple of pocket watches during that time. It took quite a few years before his brand went from something only a hardcore collector could appreciate to being appreciated by a more mainstream audience and today, he is considered by many as one of the most successful and important independent brands to have emerged.", "In my opinion, F.P. Journe has hit the sweet spot, producing around 900 pieces a year only. This ensures that they are exclusive enough that people consider any Journe a rare piece, but not so rare that it becomes esoteric. There are brands like Roger Smith and Philippe Dufour, both of who are considered godfathers of high horology, but they make so few pieces a year that the average watch collector would not know about them. Mention F.P. Journe though, and you’ll have collectors jumping with joy. ", "One of the pillars of F.P. Journe and certainly a flagship, the Tourbillon Souverain was the first watch released by the brand and has existed in the Journe portfolio since its inception in 1999. With the third generation of this model now in production, the Tourbillon Souverain has seen a multitude of iterations throughout the years, with different dial and case configurations. None though is as special as the example you see here today. ", "This is the F.P. Journe Tourbillon Souverain Regence Circulaire and it is a second generation model from the brand. Made in a series of only twenty examples in 2018, it features a beautiful, artisanal hand-engraved dial. ", "While the Tourbillon Souverain in itself is already considered one of the flagships of F.P. Journe, this particular example takes it a notch further through its unique hand-made dial and overall rarity. This is certainly not a piece you will see around and this is a rare opportunity to acquire an extremely special F.P. Journe."], "productCr": "This F.P. Journe Tourbillon Regence Circulaire is in unused condition. It comes as a full set with its box and warranty. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0008_Layer-15.png?v=1616487085", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0035_Layer-23.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0032_Layer-26.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0030_Layer-28.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0011_Layer-10.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0036_Layer-22.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0010_Layer-13.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0034_Layer-24.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0033_Layer-25.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0013_Layer-11.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0040_Layer-18.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0009_Layer-14.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0012_Layer-12.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0014_Layer-9.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0015_Layer-8.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0031_Layer-27.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0037_Layer-21.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0038_Layer-20.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0039_Layer-19.png?v=1616487161", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-Regence-Circulaire_0041_Layer-17.png?v=1616487129"]},
{"productYear": "2018", "title": "IWC Mark XVIII Top Gun Miramar", "productPrice": "$4,800.00", "productDescription": ["If there is one brand that can safely claim the term ‘pilot’s watch’, it would have to be IWC. With a rich history of supplying aviation watches to both civilians and militaries since the ’30s, the brand continues to make aviation-inspired watches to this day. ", "On the wrist, despite its seemingly larger diameter, it sits very well and wears small for its size, largely due to the thin profile of the case and darker tones used. It’s a great everyday watch that will certainly appeal to not only the IWC crowd but to those who are looking for a fuss-free, casual and solid piece."], "productCr": "This IWC Mark XVIII Top Gun Miramar is in excellent condition. There are no scratches on the case or any damage. The strap is unbranded, attached to the original IWC titanium buckle and in good used condition. This watch comes as a full set with its box and guarantee.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Mark_XVIII_Top_Gun_Miramar_0032_Layer_38.jpg?v=1575993191", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Mark_XVIII_Top_Gun_Miramar_0008_Layer_77.jpg?v=1575993191", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Mark_XVIII_Top_Gun_Miramar_0030_Layer_40.jpg?v=1575993191", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Mark_XVIII_Top_Gun_Miramar_0029_Layer_41.jpg?v=1575993191", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Mark_XVIII_Top_Gun_Miramar_0010_Layer_75.jpg?v=1575993191", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Mark_XVIII_Top_Gun_Miramar_0009_Layer_76.jpg?v=1575993191", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Mark_XVIII_Top_Gun_Miramar_0031_Layer_39.jpg?v=1575993191", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/IWC_Mark_XVIII_Top_Gun_Miramar_0028_Layer_42.jpg?v=1575993191"]},
{"productYear": "2014", "title": "Grand Seiko Hi-Beat SBGH031 Limited", "productPrice": "$6,000.00", "productDescription": ["The recurring narrative in the watch world is that Grand Seiko is highly, highly under-appreciated. Loved by those who truly understand mechanical watches and are unbiased geographically, the majority have historically turned their noses up at a brand that in their eyes, produces ‘cheap’ watches. Well, just like how Lexus in the automotive industry or Yamazaki and Hibiki in the whisky industry initially battled the same bias, Grand Seiko of late has become a real force to reckon with. The Japanese are famously known for their undying work ethic and dedication to quality and with Grand Seiko, it is certainly no different. ", "Founded in 1960, Grand Seiko exists as the arm of Seiko that challenges the dominance of Swiss watchmakers like Rolex with their exquisitely created, gorgeously designed, and impeccably finished Japanese timepieces. With several watchmaking merits under their belt, Grand Seiko has grown since their inception to achieve that very goal and today stand as one of the most highly respected watchmakers in the world, not just Japan.", "Released in 2014 and limited to just 200 pieces in total, the Grand Seiko Asia Limited Edition is one of the more unique versions of the longstanding timepiece. Exclusive to the Asian markets, the SBGH031 features design cues that speak to the region’s geographical qualities and traditions. Famous for their incredible dials, it is no coincidence that Grand Seiko gave the Asia Limited Edition the dial it did. ", "Decorated with a diamond pattern filled with wavy lines, the deep blue dial shimmers tantalizingly in the light. On top of that, the Grand Seiko Lion logo is found located all over the dial presenting another layer of depth, another shade of blue, and another source of texture – all tenets of Grand Seiko’s dials.", "Moving on from its dial, the SBGH031 is housed within a 40mm stainless steel case with a variety of finishes. Ranging from its polished steel bezel to a both, brushed and polished case, the SBGH031 employs sharp lines to delineate between its various finishes."], "productCr": "This Grand Seiko SBGH031 Limited is in mint condition. The bracelet still retains all of its original plastic wrap and it has not been worn. It comes as a full set with its box, papers and timing certificate and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGH031-Cross-Hatch-Blue_0012_Layer-8.png?v=1611301361", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGH031-Cross-Hatch-Blue_0044_Layer-15.png?v=1611301364", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGH031-Cross-Hatch-Blue_0040_Layer-19.png?v=1611301366", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGH031-Cross-Hatch-Blue_0011_Layer-10.png?v=1611301368", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGH031-Cross-Hatch-Blue_0041_Layer-18.png?v=1611301370", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGH031-Cross-Hatch-Blue_0046_Layer-13.png?v=1611301372", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGH031-Cross-Hatch-Blue_0042_Layer-17.png?v=1611301373", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGH031-Cross-Hatch-Blue_0010_Layer-11.png?v=1611301375", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGH031-Cross-Hatch-Blue_0013_Layer-9.png?v=1611301384", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGH031-Cross-Hatch-Blue_0007_Layer-14.png?v=1611301377", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGH031-Cross-Hatch-Blue_0043_Layer-16.png?v=1611301381", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGH031-Cross-Hatch-Blue_0008_Layer-13.png?v=1611301379", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGH031-Cross-Hatch-Blue_0009_Layer-12.png?v=1611301386", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Grand-Seiko-SBGH031-Cross-Hatch-Blue_0045_Layer-14.png?v=1611301390"]},
{"productYear": "2009", "title": "Omega Museum Collection 1941 Officers Chronograph", "productPrice": "$11,000.00", "productDescription": ["Famed for their iconic trio of tool watches, Omega is a brand known for its ability to produce high-performing timepieces. While their readiness to create limited editions can be tiresome, the limited-edition Omega Number 9 Milestone 1941 is a result of Omega’s desire to showcase the historic values they had that have culminated in the modern success of the brand.", "Here I have a Milestone 1941 produced for Omega’s Museum Collection. Seeking to honor one classic timepiece a year, that must be at least fifty years old, the Museum Collection creates a limited edition model that is a modern interpretation of what was an iconic watch at the time. In this case, the watch Omega is paying homage to is the Omega ref. CK2080."], "productCr": "This Omega Museum Collection 1941 is in LNOS condition. It has never been worn and retains its sticker on the caseback. It comes as a full set and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Musuem-Collection-1941-Chronograph-_0014_Layer-39.png?v=1607676473", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Collection-1941-Chronograph_0019_Layer-111.png?v=1607676475", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Collection-1941-Chronograph_0016_Layer-114.png?v=1607676478", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Musuem-Collection-1941-Chronograph-_0012_Layer-41.png?v=1607676480", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Musuem-Collection-1941-Chronograph-_0011_Layer-42.png?v=1607676482", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Collection-1941-Chronograph_0021_Layer-109.png?v=1607676484", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Collection-1941-Chronograph_0017_Layer-113.png?v=1607676486", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Collection-1941-Chronograph_0018_Layer-112.png?v=1607676487", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Musuem-Collection-1941-Chronograph-_0008_Layer-45.png?v=1607676489", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Musuem-Collection-1941-Chronograph-_0009_Layer-44.png?v=1607676491", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Museum-Collection-1941-Chronograph_0020_Layer-110.png?v=1607676493", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Musuem-Collection-1941-Chronograph-_0010_Layer-43.png?v=1607676494", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Omega-Musuem-Collection-1941-Chronograph-_0013_Layer-40.png?v=1607676496"]},
{"productYear": "2000", "title": "Audemars Piguet Royal Oak Perpetual Calendar Openworked 25829ST", "productPrice": null, "productDescription": ["The Royal Oak, with its masculine octagonal case, exposed screws and integrated bracelet is one of the most distinctive watches in the market today. It is imposing and recognizable, and in my opinion, one of the best statement watches money can buy. ", "The Royal Oak is not only famous for what it looks like, but also how it was introduced. First released in the ’70s, the original Ref. 5402 was a bold stainless steel watch designed by Gerald Genta that created shockwaves. It was designed as a luxury sport watch and the scandalous part was that it was priced accordingly- the same as an equivalent gold watch of its era. ", "People just could not accept that a pedestrian material such as steel could be priced so exorbitantly and consequently, it was not very popular. It was only after some time that the public saw this as something genuinely original and avant-garde. Today though, in-line with the craze for stainless steel, the Royal Oak is an icon. ", "Of late, while the Royal Oak itself has been immensely in demand, the discontinued perpetual calendars have been right at the top of it. Furthermore, the example here is one of the most special perpetual calendars Audemars Piguet ever produced, featuring a stunning open-worked skeleton dial. Open working has been one of AP’s signatures since the ’80s and the ref. 25829 is one of its most popular and iconic. Collectors have begun to realize just how special the perpetual calendars are and how rare they are, with extremely low production numbers. ", "With a 39mm case, it sits much better on the wrist than the newer 41mms, with not only better proportions but also being more faithful to the original. In fact, the movement inside this watch is the same you will find on the Jumbo models as it is the legendary JLC Cal. 2120 with a perpetual calendar module built on top. As a result, this watch shares the same thickness as the 15202 with a slightly thicker bezel to accommodate the perpetual calendar module. For such a complicated watch that takes into account how many days each month has, including leap years, this is truly impressive. ", "The open-worked dial is a work of art, beautiful hand finished, giving the wearer insight into the legendary caliber. Despite this, the watch remains legible and simple enough to use. Part of the reason why there is a renewed interest in perpetual calendar Royal Oaks is because AP themselves have been releasing many of their iconic new models with this collection, from the black and white ceramic models, including the most recent open-worked version, and of course the insane RD2 ultra, ultra-thin."], "productCr": "This Audemars Piguet Royal Oak Perpetual Calendar 25820ST is in like-new condition. It comes in mint condition and in a full set with all of its accessories including its inner and outer box, guarantee and manual.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0001_Layer-37.png?v=1587117186", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0001_Layer-138.png?v=1587117186", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0007_Layer-39.png?v=1587117437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0005_Layer-42.png?v=1587117437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0004_Layer-135.png?v=1587117437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0005_Layer-131.png?v=1587117437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0002_Layer-38.png?v=1587117437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0002_Layer-137.png?v=1587117437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0003_Layer-136.png?v=1587117437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0003_Layer-44.png?v=1587117437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0004_Layer-43.png?v=1587117437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0007_Layer-129.png?v=1587117437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0006_Layer-41.png?v=1587117437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0006_Layer-130.png?v=1587117437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0008_Layer-128.png?v=1587117437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0009_Layer-127.png?v=1587117437", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Perpetual-Calendar-Openworked-25829ST_0008_Layer-40.png?v=1587117437"]},
{"productYear": "2002", "title": "F.P. Journe Octa Reserve de Marche Brass", "productPrice": null, "productDescription": ["Where to begin with F.P. Journe. Started by the man himself in 1999, Journe had previously spent quite a few years restoring and producing movements and also made a couple of pocket watches during that time. It took quite a few years before his brand went from something only a hardcore collector could appreciate to being appreciated by a more mainstream audience and today, he is considered by many as one of the most successful and important independent brands to have emerged.", "In my opinion, F.P. Journe has hit the sweet spot, producing around 900 pieces a year only. This ensures that they are exclusive enough that people consider any Journe a rare piece, but not so rare that it becomes esoteric. There are brands like Roger Smith and Philippe Dufour, both of who are considered godfathers of high horology, but they make so few pieces a year that the average watch collector would not know about them. Mention F.P. Journe though, and you’ll have collectors jumping with joy. ", "It goes without saying that F.P. Journe has been one of the hottest brands in the last 12 months, finally gaining the recognition that it deserved all along. With early brass movement pieces hitting records at auction, the rest of the collection has followed. ", "I am very proud to offer the example here today as it is a very important and early Journe. The Octa line is Journe’s self-winding model and while over the years there have been many models based on this movement, the Reserve de Marche is the purest iteration of it all. Featuring a simple time display and power reserve indication, it was one of the earliest models released by the brand, alongside the Chronometre a Resonance and the Tourbillon Souverain. ", "What distinguishes early Journe models from the more common ones is the use of brass in the movements. F.P. Journe only used brass movements up to 2004, switching to complete rose gold calibers after that. As a result of it being produced for only a few short years, these are very rare and hugely desirable by collectors. ", "At the time, buyers had several options to configure their watches, with the choice of rose gold or platinum for the case, and rose, white or yellow gold for the dial. While any brass movement F.P. Journe is considered hard to come by, this particular example is said to be one of the rarest configurations, with an 18k rose gold case and a matching rose gold dial. Around 50-60 examples were produced and you will not see this one very often. ", "All early Journe watches were made in a 38mm case size, as supposed to the 40 or 42mm choice you have today. The 38mm case size is another thing that collectors prefer, and I would agree as it sits on the wrist much more homogeneously. ", "Flip the watch over and you will see the in-house FPJ caliber 1300.3 made of brass. It has a beautiful 22k gold rotor and all parts are hand finished to perfection. It has a 120-hour power reserve, and this is indicated on the dial.", "F.P. Journe has carved a very interesting niche in the independent watch world where he has managed to blend traditional watchmaking and design cues with modern technology and an unmistakably Journe aesthetic. Despite using very traditional elements like his serif’d Arabic numerals, a knurled winding crown, and a standard round case, the way it has been laid out combines to create a look that is F.P. Journe through and through. ", "I am very lucky to be able to offer an example such as this one, made even more special by the fact that it comes as a full set, with its box, card, and brochure, and even with its original sales receipt by Sincere Watches in 2002. "], "productCr": "This F.P. Journe Octa Reserve de Marche is in mint condition. It was serviced by F.P. Journe in 2020 and comes as a full set with its original box and card. Furthermore it comes with its original receipt from Sincere Watches Singapore. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0009_Layer-115.png?v=1608247841", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0066_Layer-88.png?v=1608247843", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0072_Layer-23.png?v=1608247845", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0014_Layer-110.png?v=1608247847", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0071_Layer-26.png?v=1608247849", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0068_Layer-86.png?v=1608247850", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0069_Layer-85.png?v=1608247852", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0011_Layer-113.png?v=1608247854", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0015_Layer-109.png?v=1608247862", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0074_Layer-21.png?v=1608247859", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0067_Layer-87.png?v=1608247860", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0016_Layer-108.png?v=1608247866", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0076_Layer-19.png?v=1608247864", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0070_Layer-27.png?v=1608247874", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0073_Layer-22.png?v=1608247867", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0010_Layer-114.png?v=1608247856", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0077_Layer-2.png?v=1608247872", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0012_Layer-112.png?v=1608247869", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0013_Layer-111.png?v=1608247871", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Octa-Reserve-de-Marche-RGRG-Brass_0075_Layer-20.png?v=1608247876"]},
{"productYear": "2003", "title": "F.P. Journe Tourbillon Souverain Brass", "productPrice": null, "productDescription": ["Where to begin with F.P. Journe. Started by the man himself in 1999, Journe had previously spent quite a few years restoring and producing movements and also made a couple of pocket watches during that time. It took quite a few years before his brand went from something only a hardcore collector could appreciate to being appreciated by a more mainstream audience and today, he is considered by many as one of the most successful and important independent brands to have emerged.", "In my opinion, F.P. Journe has hit the sweet spot, producing around 900 pieces a year only. This ensures that they are exclusive enough that people consider any Journe a rare piece, but not so rare that it becomes esoteric. There are brands like Roger Smith and Philippe Dufour, both of who are considered godfathers of high horology, but they make so few pieces a year that the average watch collector would not know about them. Mention F.P. Journe though, and you’ll have collectors jumping with joy. ", "It goes without saying that F.P. Journe has been one of the hottest brands in the last 12 months, finally gaining the recognition that it deserved all along. With early brass movement pieces hitting records at auction, the rest of the collection has followed. ", "What I have here today is an absolutely beautiful example of an early brass 4th generation Tourbillon Souverain. What distinguishes early Journe models from the more common ones is the use of brass in the movements. F.P. Journe only used brass movements up to 2004, switching to complete rose gold calibers after that. As a result of it being produced for only a few short years, these are very rare and hugely desirable by collectors.", "The Tourbillon was the first wristwatch produced by F.P. Journe and it was part of the original lineup alongside the Chronometre a Resonance and the self-winding Octa Reserve de Marche. The Tourbillon Souverain was powered by the Caliber 1498 and featured a remontoir d’egalite crafted from rhodium-plated brass. ", "Coming as a full set and from the original owner who bought this watch new from Sincere Watches in Malaysia in 2003, it was presented to him by François-Paul himself when he came down to Malaysia in 2003 for a dinner hosted by Sincere. As a result, this watch additionally comes with a presentation book featuring all of the models of the time which was signed by François-Paul. The card of authenticity is also signed by the man himself, making this watch just that much more special. ", "The dial on this particular example is very unique and one of the more interesting early dials I have seen. As it comes from the original owner I know for a fact that this piece was never opened and lived its life mostly in the safe in the hot and humid weather of the Tropics. You can see how the dial has aged and developed a patina that no other example will have. ", "Another thing is that the grainy dials shimmer in the light and display a huge range of hues depending on the lighting conditions. It is hard to capture this phenomenon in the photography but it is really something you have to see to appreciate. Later Journes had more refined finishing to the dials and as such lacks the character that these early ones possess.", "At the time, buyers had several options to configure their watches, with the choice of rose gold or platinum for the case, and rose, white or yellow gold for the dial. This example comes in platinum and houses a white gold dial that has oxidized to a yellow tone. ", "All early Journe watches were made in a 38mm case size, as supposed to the 40 or 42mm choice you have today. The 38mm case size is another thing that collectors prefer, and I would agree as it sits on the wrist much more homogeneously. ", "F.P. Journe has carved a very interesting niche in the independent watch world where he has managed to blend traditional watchmaking and design cues with modern technology and an unmistakably Journe aesthetic. Despite using very traditional elements like his serif’d Arabic numerals, a knurled winding crown, and a standard round case, the way it has been laid out combines to create a look that is F.P. Journe through and through. ", "It is a huge honor to be able to offer this extremely special piece, direct from the original owner based here in Kuala Lumpur, Malaysia, and in a complete set. "], "productCr": "This F.P. Journe Tourbillon Souverain is in excellent condition. It has never been opened or polished before and is a time capsule of how the was presented back in 2003. It comes as a full set with its box and card and also an additional signed book by F.P. Journe when the previous owner had dinner in 2003 to collect his watch.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0024_Layer-161.png?v=1608248195", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0084_Layer-10.png?v=1608248197", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0088_Layer-3.png?v=1608248199", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0026_Layer-159.png?v=1608248200", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0090_Layer-1.png?v=1608248202", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0028_Layer-157.png?v=1608248204", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0081_Layer-13.png?v=1608248206", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0086_Layer-7.png?v=1608248208", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0085_Layer-9.png?v=1608248210", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0083_Layer-11.png?v=1608248213", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0079_Layer-17.png?v=1608248260", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0078_Layer-18.png?v=1608248263", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0025_Layer-160.png?v=1608248215", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0027_Layer-158.png?v=1608248265", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0029_Layer-156.png?v=1608248268", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0030_Layer-155.png?v=1608248270", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0031_Layer-154.png?v=1608248272", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0080_Layer-15.png?v=1608248273", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0082_Layer-12.png?v=1608248275", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0087_Layer-6.png?v=1608248277", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Tourbillon-Souverain-PTWG-Brass_0089_Layer-5.png?v=1608248281"]},
{"productYear": "2019", "title": "Patek Philippe 5270R Perpetual Calendar Chronograph", "productPrice": null, "productDescription": ["There are times, an item becomes so synonymous with an individual or a brand that it becomes an integral part of their identity; An association formed that is so inseparable that doing without it, would diminish the character of the brand or person.", "So for Patek Philippe? Perpetual calendar chronographs. Not much has been left unsaid about this legendary flagship family of watches, and rightly so. Deemed by many not only as the quintessential Patek but also as some of the best watches of all time, they have become graceful lessons in restraint and practicality, in balance and in tradition. The first-ever produced perpetual calendar chronograph by Patek Philippe was in 1941 with the reference 1518 and since then they have only released four more iterations, with the one you see here today, the 5270, the most recent. It goes to show that this reference is taken very seriously, with only five versions (1518, 2499, 3970, 5970, 5270) in nearly 80 years. ", "This particular example is perhaps my favourite iteration of the variations seen so far in the 5270. As Wei Koh said in his article for Revolution ‘There are gold watches, and there’s the Patek Philippe 5270/1R: where one would expect from Patek Philippe a timepiece with just a touch more flash from a reined expression in gold, there is a slack-jaw moment when first confronted with how the watchmaker is serving up gold in flaming spadefuls here.’ First released in 2018, this is the full-fat 5270R, housed in a rose gold case with a deep black dial, with the watch finished off fitted with a stunning integrated ‘goutte’ (French for droplet) solid rose gold bracelet. ", "I am absolutely a huge fan of gold and what may not be known, is that Patek Philippe worked closely with Gay Freres in the 20th century to produce a myriad of uniquely design gold bracelets. For instance, when you bought a Ref. 2526 back in the 1950s, you had four bracelet designs you could choose from! So while some might see this as gaudy, I do think there is some continuity with the choice to have a bracelet option in the catalogue. ", "Looking into the business end of the 5270, this is where Patek made headlines when this watch was first released in 2011. The calibre 29-535 PS Q was the first perpetual calendar chronograph made entirely in-house, replacing the Nouvelle Lemania based 27-70 Q used in the older 5970 and 3970. Although the 27-70 Q was an exquisite, top-tier movement, we live in an age where the term ‘in-house’ has become a selling point for manufacturers and a priority for customers.", "In terms of tradition, this is as pure as it gets. Housed inside the 5270 is a classic column-wheel chronograph, using a lateral clutch engagement so you can see the watch functioning in all of its glory. While there are known drawbacks to a lateral clutch as supposed to a more modern vertical one, Patek opted for the former due to the fact that simply stated, they are architecturally and aesthetically more beautiful. It isn’t always the case that watchmaking is all about technicality, especially in ", " Instead, it is the subtle alternations between the balance of beauty and functionality that truly defines a great movement.", "To be able to see the wheels engage and disengage in the 5270 really is a beautiful thing. This provides a much more immersive experience for the wearer. After all, why have an exhibition case back if there’s nothing to see? Furthermore, it is important to note, that Patek being Patek, they combatted a lot of the downsides of a lateral clutch movement such as hand quivering and backlash through a series of ingenious inventions. This includes a patented tooth profile for the chronograph wheels to reduce wear and prevent tooth tip collisions (which causes hand jumps), a column wheel cap that is actually functional, allowing a more precise adjustment for the clutch lever and a slotted minute counter cam that prevents the second-hand quivering when reset. Above the base calibre, sits a newly developed perpetual calendar module, and at a thickness of 1.65mm, it ensures the watch remains discreet and slim, relative to the level of complications.", "As expected, the 29-535 PS Q is beautifully finished, albeit understatedly. There is nothing superfluous, no flourishes or engravings and that is the way I like it. With expertly finished polished chamfers on all edges and satin-finished flanks, it is aligned with Patek’s pursuit of sophistication and understatement.", "The 41mm case of the 5270 is perhaps my favourite part of the watch, which in my eyes achieved an amazing proportionality and balance. The flared, angular lugs that stick out of the watch are juxtaposed harmoniously with the roundness of the concave bezel. Looking at the side profile, at 12.4mm thick, the rectangular pushers are spaced perfectly, corresponding with the mentioned lugs that stream downwards and narrows at the end. Nothing here is obtrusive as the watch ebbs and flows between fluid shapes and sharp angles, between masculinity and elegance, complementing one another. It is truly a master class in case design. I never thought I’d say this about a watch sized at 41mm, but on the wrist, I was pleasantly surprised at how well it hugged my wrist. The profile really works and it doesn’t look bulky or oversized at all. (That’s coming from someone with a smaller wrist.)", "The dial is unmistakably Patek, with two apertures for the month and day at 12 o’clock, and three recessed sub-dials for the minute counter, seconds counter and moon phase. Using rectangular rose-gold applied index markers, its relationship with the softer shaped Feuille hands is well-balanced. New to the 5270 was the removal of the day/night and leap year indicator from the sub-dials and it was replaced with two apertures that make for a far cleaner look.", "I do think that there is something universally appealing about a rose gold watch with a black dial. This 5270R is further complemented by the tasteful accents of blue in the moon phase and the day/night indicator. There is no doubt that this watch has a huge presence and makes a big statement on the wrist. I always say, it is not what you wear, but how you wear something and when tastefully done, this Patek Philippe 5270R makes for a very classy and elegant watch.", "Note: I wrote an article on the Patek Philippe 5270 back in 2015 for ", " and in this description, I draw heavily from what I wrote then. No plagiarism was involved ;)"], "productCr": "This Patek Philippe 5270R is in unused condition. It comes as a full set, with its box and papers, extra solid caseback and with its full-length 18k rose gold bracelet. It is in full working condition and still under Patek Philippe’s warranty.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Perpetual-Calendar-Chronograph-5270R-Bracelet_0029_Layer-144.png?v=1601358724", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5270R-Perpetual-Calendar-Chronograph_0014_Layer-96.png?v=1601358726", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5270R-Perpetual-Calendar-Chronograph_0015_Layer-94.png?v=1601358729", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5270R-Perpetual-Calendar-Chronograph_0017_Layer-92.png?v=1601358731", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Perpetual-Calendar-Chronograph-5270R-Bracelet_0028_Layer-146.png?v=1601358733", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5270R-Perpetual-Calendar-Chronograph_0016_Layer-93.png?v=1601358735", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Perpetual-Calendar-Chronograph-5270R_0009_Layer-154.png?v=1601358737", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Perpetual-Calendar-Chronograph-5270R-Bracelet_0026_Layer-148.png?v=1601358739", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5270R-Perpetual-Calendar-Chronograph_0011_Layer-103.png?v=1601358742", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5270R-Perpetual-Calendar-Chronograph_0018_Layer-91.png?v=1601358748", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Perpetual-Calendar-Chronograph-5270R-Bracelet_0030_Layer-145.png?v=1601358745", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Perpetual-Calendar-Chronograph-5270R-Bracelet_0027_Layer-147.png?v=1601358750", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Perpetual-Calendar-Chronograph-5270R-Bracelet_0025_Layer-149.png?v=1601358754", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Perpetual-Calendar-Chronograph-5270R-Bracelet_0024_Layer-150.png?v=1601358755", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Perpetual-Calendar-Chronograph-5270R_0010_Layer-157.png?v=1601358759", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5270R-Perpetual-Calendar-Chronograph_0013_Layer-99.png?v=1601358762", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5270R-Perpetual-Calendar-Chronograph_0012_Layer-100.png?v=1601358765", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5270R-Perpetual-Calendar-Chronograph_0010_Layer-104.png?v=1601358767", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5270R-Perpetual-Calendar-Chronograph_0009_Layer-106.png?v=1601358769"]},
{"productYear": "2019", "title": "Audemars Piguet Royal Oak 15202OR Jumbo", "productPrice": null, "productDescription": ["The Royal Oak, with its masculine octagonal case, exposed screws and integrated bracelet is one of the most distinctive watches in the market today. It is imposing and recognisable, and in my opinion, one of the best statement watches money can buy. ", "The Royal Oak is not only famous for what it looks like, but also how it was introduced. First released in the ’70s, the original Ref. 5402 was a bold stainless steel watch designed by Gerald Genta that created shockwaves. It was designed as a luxury sport watch and the scandalous part was that it was priced accordingly- the same as an equivalent gold watch of its era. ", "People just could not accept that a pedestrian material such as steel could be priced so exorbitantly and consequently, it was not very popular. It was only after some time that the public saw this as something genuinely original and avant-garde, making the Royal Oak an icon. ", "While the Royal Oak’s association with steel is fundamental to its history, it was a natural progression to include gold in the lineup. There is just something about a solid gold sports watch that is so cool and this example here today is a testament to that. ", "The stainless steel 15202 is always spoken about and perhaps the model that is most desired, but in my opinion, the gold models are sleepers in the lineup. Of course I understand that it is harder to pull off gold, but the sheer weight and shine of this 15202OR is unbeatable in its presence. The combination of the shining blue tappiserie dial with a rose gold case works so well and the light play from the bevels of the case to the shimmer of the blue makes this one of my favorite watches of all time. ", "Gold over steel for me."], "productCr": "This Audemars Piguet Royal Oak 15202 is in mint condition. The bezel and case are free from scratches and it retains its original unpolished finish. It still has its inner bracelet stickers.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202OR-Blue_0009_Layer-153.png?v=1608247064", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202OR-_0058_Layer-36.png?v=1608247066", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202OR-Blue_0011_Layer-151.png?v=1608247068", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202OR-_0062_Layer-32.png?v=1608247071", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202OR-Blue_0014_Layer-148.png?v=1608247073", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202OR-Blue_0010_Layer-152.png?v=1608247075", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202OR-_0064_Layer-30.png?v=1608247077", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202OR-Blue_0015_Layer-147.png?v=1608247080", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202OR-_0063_Layer-31.png?v=1608247082", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202OR-Blue_0016_Layer-146.png?v=1608247096", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202OR-_0061_Layer-33.png?v=1608247098", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202OR-Blue_0012_Layer-150.png?v=1608247100", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202OR-_0060_Layer-34.png?v=1608247102", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202OR-Blue_0013_Layer-149.png?v=1608247103", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202OR-_0059_Layer-35.png?v=1608247105", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15202OR-_0065_Layer-29.png?v=1608247107"]},
{"productYear": "2019", "title": "Patek Philippe Nautilus 5711R", "productPrice": null, "productDescription": ["I guess I have to begin by saying what everyone already knows: The Nautilus has to be the most popular watch of the last five years. ", "First released in the 1970’s the Nautilus, designed by none other than Gerald Genta himself, it was a crazy, avant-garde sports watch in stainless steel that sold for an eye-watering price. While the Royal Oak was designed in this same sense, Audemars Piguet was largely seen as the bad boys of the industry and when Patek Philippe followed suit, clients and critics alike who were used to seeing elegant dress watches were shocked to see that they followed in the footsteps AP. This was further reinforced by the fact that both were designed by the same man! The reference 3700 ‘Jumbo’, the first Nautilus model ever made, of course as we know managed to defy the odds and today is one of the holy grails of vintage Patek Philippe. ", "Fast forward to 2006, and Patek Philippe releases the heir apparent to the 3700 ‘Jumbo’, the 5711. Featuring an ultra-slim 8.3mm case, it is so thin not only for a sports watch but in general, sliding easily under the cuff of a shirt. And while the stainless steel model has been the center of attention and has been around for the longest, in 2015 Patek Philippe released what you see here today- the 5711R.", "I know that gold has taken a back seat in recent times and while I am a huge fan of the steel version, there is a certain aura that this rose gold version has that cannot compare. The weight is immense and the presence on the wrist is just unbelievable. With its chocolate brown ridged dial and integrated bracelet, there is a lot of gold!", "This 5711R is made in much lower quantities than the steel version and it has a similarly immense waitlist. Like every other Nautilus, you get the incredible case finishing from the polished bevels to the brushed surfaces and the warmth and shine of the gold is the cherry on top.", "The Patek Philippe Nautilus is really the ultimate luxury sports watch, combining brutalist design elements with an elegant profile and sizing. It is just such a cool watch and with the 5711 in particular, it is as pure as it gets, remaining faithful to the original Genta designed 3700 ‘Jumbo’ from 40 years ago with that extra heft of bling."], "productCr": "This Patek Philippe Nautilus 5711 is in mint condition. It comes as a full set with all of its accessories including its inner and outer box, certificate of origin, leather wallet and manuals. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711R_0018_Layer-46.png?v=1592301921", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711R_0001_Layer-70.png?v=1592301921", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711R_0005_Layer-65.png?v=1592301921", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711R_0003_Layer-68.png?v=1592301921", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711R_0020_Layer-44.png?v=1592301921", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711R_0022_Layer-42.png?v=1592301921", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711R_0004_Layer-66.png?v=1592301921", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711R_0002_Layer-69.png?v=1592301921", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711R_0019_Layer-45.png?v=1592301921", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711R_0024_Layer-40.png?v=1592301921", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711R_0025_Layer-39.png?v=1592301921", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711R_0021_Layer-43.png?v=1592301921", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-5711R_0023_Layer-41.png?v=1592301921"]},
{"productYear": "2012", "title": "F.P. Journe Souveraine Repetition Minutes", "productPrice": null, "productDescription": ["Where to begin with F.P. Journe. Started by the man himself in 1999, Journe had previously spent quite a few years restoring and producing movements and also made a couple of pocket watches during that time. It took quite a few years before his brand went from something only a hardcore collector could appreciate to being appreciated by a more mainstream audience and today, he is considered by many as one of the most successful and important independent brands to have emerged.", "In my opinion, F.P. Journe has hit the sweet spot, producing around 900 pieces a year only. This ensures that they are exclusive enough that people consider any Journe a rare piece, but not so rare that it becomes esoteric. There are brands like Roger Smith and Philippe Dufour, both of who are considered godfathers of high horology, but they make so few pieces a year that the average watch collector would not know about them. Mention F.P. Journe though, and you’ll have collectors jumping with joy. ", "The F.P. Journe Souveraine Repetition Minutes is one of the most complicated timepieces that come out of the manufacture and features quite a few technical marvels. Aesthetically, it has the DNA of the Chronometre Souverain, with its familiar stylized Arabic numerals and hobnail guilloche center. What is unique about this reference is that it features a white opaline dial with navy blue numerals. The subtle blue is really beautiful and is reminiscent of the color scheme of antique chinaware. Topping it off, there is an aperture around the 10 o’clock marker that showcases the chiming gongs. ", "A minute repeater has traditionally been seen as the pinnacle of watchmaking and is no easy feat. It was invented back in the day when it was hard to read the time at night and also for times when it was inappropriate to look at your clock. So as a way to tell time, a minute repeater would chime the time with the first singular chimes telling you the hour of the day, the second dual chimes telling you which quarter it was (15, 30, 45) and the final singe chimes telling you how many minutes after the quarter it was, hence giving you the exact time. ", "When the Souveraine Minute Repeater was first released in 2008, it was the thinnest minute repeater ever produced at 8.65mm, so you can imagine how well this sits on the wrist, despite its complication. While it is housed in a traditional F.P. Journe case, what sets it apart is the little lever you see at 10 o’clock, which of course is how you activate the minute repeating function. What is different about this minute repeater is that F.P. Journe adopted flat hammers that he invented so that it can be more compact within the movement. The chimes are louder than your typical repeater as a result and this is further assisted by the fact that it is housed in a stainless steel case as it has a lower density than gold, meaning the sound can be amplified louder.", "F.P. Journe has carved a very interesting niche in the independent watch world where he has managed to blend traditional watchmaking and design cues with modern technology and an unmistakably Journe aesthetic. Despite using very traditional elements like his serif’d Arabic numerals, a knurled winding crown, and a standard round case, the way it has been laid out combines to create a look that is F.P. Journe through and through. It is for this reason that he is today, one of the most sought after and successful independent watchmakers in the industry. ", "The F.P. Journe Souveraine Repetition Minutes is a truly elegant timepiece and packs a hugely complicated mechanism in a seemingly simple layout. While Journe’s timepieces have skyrocketed in value, this minute repeater has yet to reach those heights, perhaps as not many examples were made at all and it has yet to be discovered."], "productCr": "This F.P. Journe Souverain Repetition Minutes is in mint condition. It comes as a full set with its inner and outer box, manual, and guarantee card. It is fitted on a navy blue alligator strap and its original stainless steel deployant clasp.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0001_Layer-38.png?v=1592300994", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0001_Layer-94.png?v=1592300995", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0003_Layer-98.png?v=1592301036", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0006_Layer-93.png?v=1592301036", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0005_Layer-34.png?v=1592301036", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0002_Layer-92.png?v=1592301036", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0002_Layer-37.png?v=1592301036", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0003_Layer-36.png?v=1592301036", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0004_Layer-97.png?v=1592301036", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0005_Layer-96.png?v=1592301036", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0006_Layer-33.png?v=1592301036", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0004_Layer-35.png?v=1592301036", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0008_Layer-31.png?v=1592301036", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0009_Layer-30.png?v=1592301036", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0007_Layer-32.png?v=1592301036", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0007_Layer-91.png?v=1592301036", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Souveraine-Repetition-Minutes_0008_Layer-90.png?v=1592301036"]},
{"productYear": "2019", "title": "Patek Philippe Chronograph 5170P", "productPrice": null, "productDescription": ["Every industry seems to have a brand within it that captures the imaginations of every customer, competing brand and member of the public that gazes upon its designs. In the automotive world, you have Ferrari, in the world of jewelry you have Tiffany & Co., and in the world of horology, you have Patek Philippe. Situated at the zenith of watchmaking for well over a century, Patek Philippe has created some of the most historically significant timepieces of all time.", "In typical Patek Philippe fashion, their timepieces are functional, excellently made, and objectively beautiful, and one such watch that exemplifies this is the ref. 5170. Constructed of platinum and featuring baguette diamond hour markers and an incredibly executed dial, this is a timepiece that both, flies under the radar and packs a serious punch for those that give it a second glance.", "The star of the ref. 5170 is, without a doubt, its dial. Offered with a graduated blue to black dial, which is designated on the Certificate of Origin as \"bleu degrade noir\", the ref. 5170 has to be experienced in the metal to be truly appreciated. The polymerization of its blue to black gradient, a sunburst finish, and grooved chronograph subdials provides one of the most visually appealing dials of any timepiece. In addition to this, as alluded to, the hour markers are baguette diamonds, further enriching the already graceful dial that extra bit and subtly hinting at the luxurious foundations upon which Patek Philippe has been built upon.", "While objectively I’d say that this is a very beautiful watch, the desirability of it is further emphasized by its rarity. Patek Philippe didn’t make and sell many 5170s, but this particular platinum version goes above and beyond that as it was only produced for two years between 2017 and 2019, before being discontinued altogether. I do think that this particular variant of the 5170 is a sleeper and one that will be insanely collectible once people start to realize. ", "While not overly complicated, the ref. 5170 perfectly captures everything that a Patek Philippe timepiece is. Gorgeously designed and fantastically finished, the attention to detail on display here is second to none. It is only through appreciating timepieces like the ref. 5170 does it become blatantly obvious why Patek Philippe resides within the Holy Trinity, as watchmakers par excellence. "], "productCr": "This Patek Philippe 5170P is in mint condition. It comes as a full set with all of its original paperwork, manual, leather folder, brochures, inner box and outer box. It is in full working order and still under Patek Philippe’s warranty.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5170P-Chronograph_0041_Layer-109.png?v=1605172244", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P_0004_Layer-59.png?v=1605172247", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P_0006_Layer-57.png?v=1605172249", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5170P-Chronograph_0043_Layer-108.png?v=1605172251", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P_0008_Layer-55.png?v=1605172253", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5170P-Chronograph_0045_Layer-106.png?v=1605172255", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P_0003_Layer-60.png?v=1605172257", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P_0005_Layer-58.png?v=1605172259", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5170P-Chronograph_0046_Layer-105.png?v=1605172261", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P_0007_Layer-56.png?v=1605172264", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5170P-Chronograph_0047_Layer-104.png?v=1605172266", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5170P-Chronograph_0042_Layer-110.png?v=1605172268", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5170P-Chronograph_0048_Layer-103.png?v=1605172270", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P_0002_Layer-61.png?v=1605172272", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-5170P-Chronograph_0044_Layer-107.png?v=1605172274", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Chronograph-5170P_0001_Layer-62.png?v=1605172277"]},
{"productYear": "2011", "title": "Audemars Piguet Royal Oak 25820 Perpetual Calendar", "productPrice": null, "productDescription": ["The Royal Oak, with its masculine octagonal case, exposed screws and integrated bracelet is one of the most distinctive watches in the market today. It is imposing and recognizable, and in my opinion, one of the best statement watches money can buy. ", "The Royal Oak is not only famous for what it looks like, but also how it was introduced. First released in the ’70s, the original Ref. 5402 was a bold stainless steel watch designed by Gerald Genta that created shockwaves. It was designed as a luxury sports watch and the scandalous part was that it was priced accordingly- the same as an equivalent gold watch of its era. ", "People just could not accept that a pedestrian material such as steel could be priced so exorbitantly and consequently, it was not very popular. It was only after some time that the public saw this as something genuinely original and avant-garde. Today though, in-line with the craze for stainless steel, the Royal Oak is an icon. ", "This example for sale here is a superb and highly complicated variant of the Royal Oak that not many people are aware of- it is the discontinued Ref. 25820 Perpetual Calendar with a blue dial. While most of the limelight goes to the 15202 Jumbo, the 25820 has been slowly gaining traction in the last 18 months as collectors are realizing how great these pieces are. With a 39mm case, it sits much better on the wrist than the newer 41mms, with not only better proportions but also being more faithful to the original. In fact, the movement inside this watch is the same you will find on the Jumbo models as it is the legendary JLC Cal. 2120 with a perpetual calendar module built on top. As a result, this watch shares the same thickness as the 15202 with a slightly thicker bezel to accommodate the perpetual calendar module. For such a complicated watch that takes into account how many days each month has, including leap years, this is truly impressive. ", "In fact, part of the reason why there is a renewed interest in perpetual calendar Royal Oaks is because AP themselves have been releasing many of their iconic new models with this collection, from the black and white ceramic models, including the most recent open-worked version, and of course the insane RD2 ultra, ultra-thin. ", "While the current Royal Oak Perpetual Calendar is fairly common, the 25820, especially in blue is extremely rare. Just try looking around for another, you won’t find too many as they were made in low numbers. On top of this, collectors who own this reference are often reluctant to let them go. ", "Flipping the watch over, you’ll be greeted with the beautifully decorated Cal. 2120/2802, with the engraved rotor especially stunning. This is a grande complication inside one of the most iconic sports watches and I have no doubt that the Royal Oak Perpetual Calendar Ref. 25820 is an investment grade piece. Oh, and its fantastic on the wrist- you can stare at it all day. "], "productCr": "This Audemars Piguet Royal Oak Perpetual Calendar 25820ST is in mint condition. There are no scratches or dings. It comes as a full set with its watch winder box, booklets and guarantee. It was serviced in 2018 and is still under warranty until May 2020.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars_Piguet_Royal_Oak_25820_Perpetual_Calendar_Blue_0001_Layer_105.jpg?v=1577432036", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars_Piguet_Royal_Oak_25820_Perpetual_Calendar_Blue_0011_Layer_73.jpg?v=1577432085", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars_Piguet_Royal_Oak_25820_Perpetual_Calendar_Blue_0007_Layer_99.jpg?v=1577432085", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars_Piguet_Royal_Oak_25820_Perpetual_Calendar_Blue_0010_Layer_74.jpg?v=1577432085", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars_Piguet_Royal_Oak_25820_Perpetual_Calendar_Blue_0012_Layer_71.jpg?v=1577432085", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars_Piguet_Royal_Oak_25820_Perpetual_Calendar_Blue_0006_Layer_100.jpg?v=1577432085", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars_Piguet_Royal_Oak_25820_Perpetual_Calendar_Blue_0009_Layer_85.jpg?v=1577432085", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars_Piguet_Royal_Oak_25820_Perpetual_Calendar_Blue_0014_Layer_67.jpg?v=1577432085", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars_Piguet_Royal_Oak_25820_Perpetual_Calendar_Blue_0003_Layer_103.jpg?v=1577432085", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars_Piguet_Royal_Oak_25820_Perpetual_Calendar_Blue_0002_Layer_104.jpg?v=1577432085", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars_Piguet_Royal_Oak_25820_Perpetual_Calendar_Blue_0013_Layer_68.jpg?v=1577432085", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars_Piguet_Royal_Oak_25820_Perpetual_Calendar_Blue_0008_Layer_98.jpg?v=1577432085", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars_Piguet_Royal_Oak_25820_Perpetual_Calendar_Blue_0005_Layer_101.jpg?v=1577432085", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars_Piguet_Royal_Oak_25820_Perpetual_Calendar_Blue_0004_Layer_102.jpg?v=1577432085"]},
{"productYear": "2009", "title": "Rolex Cosmograph Daytona 116528", "productPrice": null, "productDescription": ["Existing as perhaps the most highly coveted timepiece ever, the Rolex Daytona is steeped in history and mechanical excellence like few other watches are. Thanks to their association to Paul Newman, the famed actor, and race car driver, the first-generation Daytonas have become an incredibly sought-after commodity, and the current third-generation variants seem to be just as hard to purchase too.", "Constructed of 18kt yellow gold, the ref. 116528’s case comes in a familiar 40mm size and features a polished case and bezel. Found inside the case, however, is perhaps one of Rolex’s most defining movements, the inhouse chronograph caliber 4130.", "Improving on the cal. 4030 in just about every way, the 4130 comes with the Rolex-standard free-sprung escapement with a handmade Breguet overcoil hairspring constructed of Parachrom blue, allowing for greater resistance to temperature variations and magnetic fields. Featuring just 201 parts – a 60% reduction from the cal.4030, the cal. 4130 was built from the ground up to maximize efficiency and reduce servicing needs. Chronometer-spec as standard, the cal. 4130’s even features a ceramic ball bearing winding system to maximize the conversion of the wearer's wrist movements into watch power, to be exact this system is 68% more efficient than that of the cal. 4030.", "While all of these technical improvements are impressive, let's not beat around the bush- a gold Rolex Daytona is always going to be a statement piece. This 116528 has an insane presence on the wrist, it just feels special and has something that its steel counterpart lacks. ", "Here I have a 2009 z-serial full set ref. 116528 that even still retains its caseback sticker, alluding to just how well it has been taken care of in the past 11 years. Compounding on this very fact is this example’s case is extremely sharp and blemish-free. While there is practically no end to the ref. 116528’s aesthetic beauty, or mechanical excellence, Rolex has effectively distilled everything that makes the Daytona the legend that it is and put it into one modern and extremely exclusive package that deserves to be in just about every collection out there."], "productCr": "This Rolex Cosmograph Daytona is in excellent condition. It is unpolished and still retains its original case back sticker from when it was new. There are some minor hairlines throughout. It comes as a full set with its large Rolex box, manual and punched papers. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116528-Yellow-Gold_0017_Layer-145.png?v=1608250090", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116528-Yellow-Gold_0051_Layer-76.png?v=1608250092", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116528-Yellow-Gold_0054_Layer-40.png?v=1608250093", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116528-Yellow-Gold_0049_Layer-78.png?v=1608250096", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116528-Yellow-Gold_0018_Layer-144.png?v=1608250095", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116528-Yellow-Gold_0019_Layer-143.png?v=1608250098", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116528-Yellow-Gold_0050_Layer-77.png?v=1608250100", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116528-Yellow-Gold_0052_Layer-42.png?v=1608250101", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116528-Yellow-Gold_0021_Layer-141.png?v=1608250103", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116528-Yellow-Gold_0056_Layer-38.png?v=1608250105", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116528-Yellow-Gold_0020_Layer-142.png?v=1608250111", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116528-Yellow-Gold_0022_Layer-140.png?v=1608250107", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116528-Yellow-Gold_0023_Layer-139.png?v=1608250108", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Rolex-Cosmograph-Daytona-116528-Yellow-Gold_0053_Layer-41.png?v=1608250113"]},
{"productYear": "2014", "title": "Patek Philippe Nautilus 5711A", "productPrice": null, "productDescription": ["I guess I have to begin by saying what everyone already knows: The Nautilus has to be the most popular watch for the last five years, especially in blue. At the center of the hype is the watch you see here today- the Patek Philippe Nautilus 5711 in stainless steel with a blue dial. ", "Fast forward to 2006, and Patek Philippe releases the heir apparent to the 3700 ‘Jumbo’, the 5711. Featuring an ultra-slim 8.3mm case, it is so thin not only for a sports watch but in general, sliding easily under the cuff of a shirt. The dial, offered in blue and white came with the familiar ridged dial and integrated stainless steel bracelet. For a while, you could’ve bought these at the boutique at retail but in the last few years, it is practically close to impossible to buy any Nautilus, let alone this 5711. While on paper the 5711 sits as the cheapest Nautilus you can buy, it is the hardest one to get as this is the reference collectors want the most. With this example, you get a stunning blue dial that throws off shades of green, black and blue depending on the light source and a beautifully finished case, with beautifully polished beveled edges contrasting with the brushed overall finish.", "The Patek Philippe Nautilus is really the ultimate luxury sports watch, combining brutalist design elements with an elegant profile and sizing. It is just such a cool watch and with the 5711 in particular, it is as pure as it gets, remaining faithful to the original Genta designed 3700 ‘Jumbo’ from 40 years ago. "], "productCr": "This Patek Philippe Nautilus 5711 is in mint condition. It comes as a full set with all of its accessories including its inner and outer box, certificate of origin, leather wallet and manuals. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek_Philippe_Nautilus_5711_Blue_0026_Layer_48.jpg?v=1577431780", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek_Philippe_Nautilus_5711_Blue_0017_Layer_72.jpg?v=1577431812", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek_Philippe_Nautilus_5711_Blue_0024_Layer_50.jpg?v=1577431812", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek_Philippe_Nautilus_5711_Blue_0023_Layer_51.jpg?v=1577431812", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek_Philippe_Nautilus-5711-Blue_00226_Layer-48.jpg?v=1577431812", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek_Philippe_Nautilus_5711_Blue_0018_Layer_70.jpg?v=1577431812", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek_Philippe_Nautilus_5711_Blue_0016_Layer_75.jpg?v=1577431812", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek_Philippe_Nautilus_5711_Blue_0021_Layer_53.jpg?v=1577431812", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek_Philippe_Nautilus_5711_Blue_0020_Layer_54.jpg?v=1577431812", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek_Philippe_Nautilus_5711_Blue_0019_Layer_69.jpg?v=1577431812", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek_Philippe_Nautilus_5711_Blue_0025_Layer_49.jpg?v=1577431812", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek_Philippe_Nautilus_5711_Blue_0022_Layer_52.jpg?v=1577431812"]},
{"productYear": "1990s", "title": "Roger Dubuis Sympathie 37", "productPrice": null, "productDescription": ["For a long time, the Roger Dubuis name was thought to be over and irrelevant to collectors. With Dubuis watches of today having garish designs and proportions that are all wrong, it is no wonder why. The truth is, Roger Dubuis, the man, left the company in 2005 and while he was undoubtedly a brilliant watchmaker, he lacked business expertise.", "It is this, and not his watchmaking skills, that caused the brand to be what it is today- devoid of emotion and controlled by business executives with no passion. You see, underneath this sheath of failure lies some of the most beautiful watches ever made. Early Roger Dubuis watches are nothing like what they are today- elegant in their design and finished to the highest standards, these watches rivaled and even bettered contemporaries such as Patek Philippe and Audemars Piguet. In fact, collectors have finally started to realize this and as a result, prices have been skyrocketing. ", "There were two main lines that Dubuis produced- the Homage series, which were more traditional round cased watches, and what you see here today- the Sympathie series. Featuring a more experimental case design, this is the most iconic Dubuis shape with an amorphous and angular shape.", "Constructed of 18kt white gold, the Sympathie’s 37mm case is a feast for the eyes. Featuring a vertical satin grain on the caseband and lug profiles with a contrasting high polish on the bezel, thick fixing screws, and lug hoods, the Sympathie is a finely executed timepiece with appreciable attention to detail. ", "Aside from its case, the Sympathie’s dial also stands out as a unique piece of design. This variant is one of the rarest examples of Sympathie dials and it features exploding Arabic numerals atop a silver grainy dial. ", "Powered by the automatic Roger Dubuis Cal. RD57, the Sympathie is as elegantly equipped within its case, as it is visually appealing from the outside. On display behind its sapphire crystal caseback, the RD57 is a finely finished piece of horology including black polished screws and swan's neck regulator, gorgeous côtes de Geneve motif, and mirrored chamfering throughout. As referenced by the dial signature \"Bulletin D'Observatoire\", a Besançon Observatory chronometer certificate from the French capital of watchmaking certifies the accuracy of this movement and goes to substantiate the level of quality on display by these early Roger Dubuis timepieces."], "productCr": "This Roger Dubuis Sympathie 37 is in excellent condition. It comes as a full set with its original box and guarantee papers and also its Geneva Seal papers and Besancon Observatory Certificate. It is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Silver-WG_0006_Layer-130.png?v=1621838360", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Silver-_0017_Layer-17.png?v=1621838361", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Silver-_0014_Layer-20.png?v=1621838363", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Silver-_0018_Layer-16.png?v=1621838365", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Silver-WG_0004_Layer-132.png?v=1621838367", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Silver-_0016_Layer-18.png?v=1621838368", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Silver-WG_0003_Layer-134.png?v=1621838370", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Silver-WG_0007_Layer-131.png?v=1621838371", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Silver-_0015_Layer-19.png?v=1621838373", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Silver-WG_0005_Layer-133.png?v=1621838374", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Silver-WG_0002_Layer-135.png?v=1621838376", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Roger-Dubuis-Sympathie-37-Silver-WG_0001_Layer-136.png?v=1621838379"]},
{"productYear": "1980's", "title": "Patek Philippe Nautilus 3800 Two Tone", "productPrice": null, "productDescription": ["I guess I have to begin by saying what everyone already knows: The Nautilus has to be the most popular watch of the last five years. With the modern 5711 trading at multiples of its retail and the vintage Jumbo 3700 trading for, even more, most people have been priced out of these examples. ", "Well, good thing Patek had a mid-size sibling to go along the Jumbo back in the day and as a result of these premiums, the prices of these have followed too. The 3800 was introduced at a time when the Nautilus was still seen as a brash, anti-Patek watch. Clients and critics alike were used to seeing elegant dress watches and were perhaps shocked to see that they followed in the footsteps of Audemars Piguet’s Royal Oak when they introduced the 3700 in the 70’s- Not to mention using the same designer in Gerald Genta! Furthermore, watch sizes of that era were much smaller, so to have a 42mm piece was considered hugely oversized and this is where the 3800 fits in, sized at 38mm and more acceptable to the general public. ", "The 3800 is every bit as good as its larger sibling and featuring the same monobloc case with beautiful finishing throughout. Every surface is brushed and polished and when it reflects light it simply looks amazing. The two-tone case is done tastefully well and despite being out of fashion for a long time, recent trends have suggested that it is making a big comeback. The gold dial with its horizontal stripes looks so good in the light and depending on the lighting conditions it is either a more muted yellow tone or a bright gold beam of light. ", "Furthermore, this particular example is made even more special as it is an early series, distinguished by the black date window. Despite this being a little detail, collectors seem to gravitate towards things like this. For the longest time, the 3800 Nautilus has lived in the shadow of the ‘Jumbo’, but as collectors become savvier, knowledgable, and confident, many have realized that they in fact prefer this reference as it suits their wrists better. ", "It’s hard not to love the Nautilus, despite the mainstream craze as once you strap it onto your wrist, you begin to understand why. "], "productCr": "This Patek Philippe Nautilus 3800 is in excellent condition and all original. The stainless steel case and yellow gold case retains its correct brushed and polished surfaces and the bevels still remain in tact and sharp. It comes as a watch only and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Two-Tone_0013_Layer-43.png?v=1616487903", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautiulus-3800-Two-Tone_0018_Layer-44.png?v=1616487905", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautiulus-3800-Two-Tone_0017_Layer-48.png?v=1616487907", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautiulus-3800-Two-Tone_0015_Layer-54.png?v=1616487908", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Two-Tone_0012_Layer-45.png?v=1616487910", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautiulus-3800-Two-Tone_0016_Layer-51.png?v=1616487913", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Two-Tone_0010_Layer-47.png?v=1616487914", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Two-Tone_0014_Layer-44.png?v=1616487921", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Two-Tone_0008_Layer-49.png?v=1616487917", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Two-Tone_0009_Layer-48.png?v=1616487919", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautilus-3800-Two-Tone_0011_Layer-46.png?v=1616487923", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautiulus-3800-Two-Tone_0019_Layer-41.png?v=1616487924", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Patek-Philippe-Nautiulus-3800-Two-Tone_0020_Layer-38.png?v=1616487926"]},
{"productYear": "2014", "title": "F.P. Journe Chronometre Optimum", "productPrice": null, "productDescription": ["Where to begin with F.P. Journe. Started by the man himself in 1999, Journe had previously spent quite a few years restoring and producing movements and also made a couple of pocket watches during that time. It took quite a few years before his brand went from something only a hardcore collector could appreciate to being appreciated by a more mainstream audience and today, he is considered by many as one of the most successful and important independent brands to have emerged.", "I have to say that I always end up with very long descriptions when it comes to Journe due to the complexity of his work and with this Chronometre Optimum, it just might be the longest. The idea of making the ultimate chronometer watch was something that Journe always wanted to do, and had been planning to do since 2001. Only 10 years later, in 2012 did he manage to release what you see here today. ", "The beauty of F.P. Journe is that he manages to be a traditionalist while pushing forward and innovating with unique designs and movements. The Optimum is all about that- combining the finest traditional watchmaking while inventing new ways to do it better. ", "It’s all about the Calibre 1510 with this watch and that is where I’ll spend the most time on. The main goal of the Optimum was to create a watch that focused on chronometry in the most efficient and reliable way possible and as a result, there are a whole host of innovations in the calibre that makes it so. Beginning with the signature Journe double-barrel layout, this ensures that energy is provided in a stable manner, further achieved through Journe’s remontoir d’egalite system. Every second the remontoir stores and releases energy, which aids this constant force. On top of this, there is a dead seconds indicator on the movement side, reinforcing the precision ethos of this watch. ", "There is an entirely unique escapement in this watch which Journe calls the EBHP direct impulse escapement and the two wheels manage to function without any form of lubricants, decreasing its wear and tear. ", "F.P. Journe has carved a very interesting niche in the independent watch world where he has managed to blend traditional watchmaking and design cues with modern technology and an unmistakably Journe aesthetic. Despite using very traditional elements like his serif’d Arabic numerals, a knurled winding crown and a standard round case, the way it has been laid out combines to create a look that is F.P. Journe through and through. ", "The purists really love Journe because of his motto ‘Invenit et Fecit’, which translates from Latin to Invent and Create. To this day, F.P. Journe has stuck to this mantra, where he continues to invent his own in-house movements with this Optimum being a testament to that. Furthermore, everything else is also in-house, even to the point of owning his own case-maker and dial-maker. For a small brand that makes less than 1000 pieces a year, it is really impressive.", "While it has been all about the movement with this Optimum, let’s not forget that aesthetically this is still a Journe through and through. With his signature 40mm platinum case, it houses a grey dial with his classic layout. The amazing thing about this Journe is that to the naked eye, it looks like a normal Journe, which is itself a special thing already. It is super stealth, which is something that I like. "], "productCr": "This F.P. Journe Chronometre Optimum is in mint condition. It is in full working order and comes as a full set with its inner and outer box, warranty card and an additional unused black alligator strap. It was serviced in 2019 and comes with the proof of receipt.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_Optimum_0008_Layer_44.jpg?v=1574420732", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_Optimum_0010_Layer_42.jpg?v=1574420732", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_Optimum_Creative_0026_Layer_2.jpg?v=1574420732", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_Optimum_Creative_0027_Layer_1.jpg?v=1574420732", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_Optimum_0009_Layer_43.jpg?v=1574420732", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_Optimum_0007_Layer_45.jpg?v=1574420732", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_Optimum_0011_Layer_41.jpg?v=1574420732", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_Optimum_0013_Layer_39.jpg?v=1574420732", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_Optimum_Creative_0025_Layer_3.jpg?v=1574420732", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P._Journe_Chronometre_Optimum_0012_Layer_40.jpg?v=1574420726"]},
{"productYear": "2000", "title": "Patek Philippe Nautilus 3710 'Comet'", "productPrice": null, "productDescription": ["I guess I have to begin by saying what everyone already knows: The Nautilus has to be the most popular watch of the last five years. Of course, it’s all about the 5711 and blue dials, but for those who want something a little bit different, and much rarer, this Patek Philippe Nautilus 3710 ‘Comet’ might be for you.", "First released in the 1970s, the Nautilus was designed by none other than Gerald Genta himself and it was a crazy, avant-garde sports watch in stainless steel that sold for an eye-watering price. While the Royal Oak was designed in this same sense, Audemars Piguet was largely seen as the bad boys of the industry and when Patek Philippe followed suit, clients and critics alike who were used to seeing elegant dress watches were shocked to see that they followed in the footsteps AP. This was further reinforced by the fact that both were designed by the same man! The reference 3700 ‘Jumbo’, the first Nautilus model ever made, of course as we know managed to defy the odds and today is one of the holy grails of vintage Patek Philippe. ", "Featuring an ultra-slim 8.1mm case, its considered thin not only for a sport watch but in general, sliding easily under the cuff of a shirt. That being said, for the 3710, the dial is where this piece is super unique. Featuring applied Roman numerals on top of a matte black dial, the look is completed with the now-signature power reserve indicator in the top middle part of the dial, resembling a comet and explaining the nickname for this watch.", "It is practically impossible to buy a Nautilus of any kind these days without paying a huge premium, and for the rarity, the 3710 gives, it looks to be the best value Nautilus out there at the moment. On top of the unique dial, you get everything a Nautilus is supposed to give you with that stunningly hand-finished case- brushed, polished and beveled.", "The Patek Philippe Nautilus is really the ultimate luxury sport watch, combining brutalist design elements with an elegant profile and sizing. It is just such a cool watch and with the 3710, you have that added uniqueness of the ‘Comet’."], "productCr": "This Patek Philippe Nautilus 3710 Comet is in mint condition. It comes as a full set with its box and certificate of origin and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilusComet3710_0016_Layer50.jpg?v=1585059316", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilusComet3710Creatives_0029_Layer1.jpg?v=1585059340", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilusComet3710_0014_Layer52.jpg?v=1585059340", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilusComet3710Creatives_0030_Layer13.jpg?v=1585059340", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilusComet3710_0013_Layer53.jpg?v=1585059340", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilusComet3710Creatives_0028_Layer2.jpg?v=1585059340", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilusComet3710Creatives_0027_Layer3.jpg?v=1585059340", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilusComet3710_0012_Layer54.jpg?v=1585059340", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilusComet3710_0011_Layer55.jpg?v=1585059340", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/PatekPhilippeNautilusComet3710_0015_Layer51.jpg?v=1585059340"]},
{"productYear": "2013", "title": "Audemars Piguet Royal Oak 15305ST Openworked", "productPrice": null, "productDescription": ["The Royal Oak, with its masculine octagonal case, exposed screws, and integrated bracelet is one of the most distinctive watches in the market today. It is imposing and recognizable, and in my opinion, one of the best statement watches money can buy. ", "The Royal Oak is not only famous for what it looks like, but also how it was introduced. First released in the ’70s, the original Ref. 5402 was a bold stainless steel watch designed by Gerald Genta that created shockwaves. It was designed as a luxury sports watch and the scandalous part was that it was priced accordingly- the same as an equivalent gold watch of its era. "], "productCr": "This Audemars Piguet Royal Oak 15305ST Openworked is in excellent condition. It comes as a full set with its box and papers and is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Openworked-15305ST_0021_Layer-45.png?v=1600089454", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15305ST-Openworked_0017_Layer-118.png?v=1600089458", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15305ST-Openworked_0012_Layer-122.png?v=1600089461", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15305ST-Openworked_0014_Layer-120.png?v=1600089463", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Openworked-15305ST_0020_Layer-47.png?v=1600089464", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Openworked-15305ST_0019_Layer-48.png?v=1600089466", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15305ST-Openworked_0013_Layer-121.png?v=1600089469", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audmars-Piguet-Royal-Oak-15305ST-Openworked_0016_Layer-117.png?v=1600089472", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Openworked-15305ST_0022_Layer-46.png?v=1600089475", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15305ST-Openworked_0009_Layer-128.png?v=1600089477", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Openworked-15305ST_0015_Layer-52.png?v=1600089479", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Openworked-15305ST_0016_Layer-51.png?v=1600089481", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15305ST-Openworked_0015_Layer-119.png?v=1600089484", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15305ST-Openworked_0010_Layer-124.png?v=1600089486", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Openworked-15305ST_0017_Layer-50.png?v=1600089488", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-Openworked-15305ST_0018_Layer-49.png?v=1600089490", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/Audemars-Piguet-Royal-Oak-15305ST-Openworked_0011_Layer-123.png?v=1600089492"]},
{"productYear": "2018", "title": "F.P. Journe Chronometre Souverain Havana", "productPrice": null, "productDescription": ["Regarded as one of the hottest horological prospects in the world right now, it is immensely impressive that F.P. Journe has only been around for the length of time that it has. Founded in 1999, F.P. Journe burst onto the watchmaking scene with a 20 piece limited run of Tourbillon Souverain Souscription watches that cash-strapped Francois Paul used to finance his brand, just like Abraham Louis Breguet did over 200 years ago. 20 odd years later, however, the F.P. Journe brand has become a horological powerhouse with waiting lists growing ever-longer and auction results growing ever more impressive.", "Here, I have a highly desirable F.P Journe Chronomètre Souverain ‘Havana’ Edition, named as such because of the brown dial it is fitted with. The Chronometre Souverain is the time-only manual winding watch from F.P. Journe and it has been produced in many variants, with different case and dial combinations. It can be said, that without a doubt, the Havana model is one of the most attractive variants and as such, one of the most in-demand. ", "While you may think it is just another brown dial, it should be known by now that F.P. Journe doesn’t do anything the easy way. This Havana dial is made by mixing ruthenium with gold in order to achieve the rich and reflective brown tone of this watch and by doing it this way, the Havana dial achieves a huge amount of depth. This combined with a hobnail, Cloys de Paris pattern in its center, and you get a wonderfully rich brown dial that can be dark in its tone to a light milk chocolate-like color, depending on the lighting conditions. "], "productCr": "This F.P. Journe Chronometre Souverain Havana is in excellent condition. It comes as a full set with its box and papers and it is in full working order.", "images": ["//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-Havana_0023_Layer-29.png?v=1616486861", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souveraine-Havana_0045_Layer-13.png?v=1616486898", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-Havana_0025_Layer-27.png?v=1616486898", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souveraine-Havana_0042_Layer-16.png?v=1616486898", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-Havana_0027_Layer-25.png?v=1616486898", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souveraine-Havana_0043_Layer-15.png?v=1616486898", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souveraine-Havana_0044_Layer-14.png?v=1616486898", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-Havana_0024_Layer-28.png?v=1616486898", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-Havana_0026_Layer-26.png?v=1616486898", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-Havana_0028_Layer-24.png?v=1616486898", "//cdn.shopifycdn.net/s/files/1/1872/9369/products/F.P.-Journe-Chronometre-Souverain-Havana_0029_Layer-23.png?v=1616486898"]}
]